toread.org
#+TITLE:     Sur la toile
#+OPTIONS:   H:3 num:nil creator:nil timestamp:nil toc:1
#+STYLE: <link rel="stylesheet" type="text/css" href="toread.css" />

* Work
** http://www.psychologicalscience.org/index.php/publications/observer/2010/april-10/improving-classroom-performance-by-challenging-student-misconceptions-about-learning.html
** Easier Decision-Making: Conduct Experiments By Leo Babauta http://zenhabits.net/test
** The science of time perception: stop it slipping away by doing new things http://blog.bufferapp.com/the-science-of-time-perception-how-to-make-your-days-longer
** Buufer : A blog about productivity, life hacks, writing, user experience, customer happiness and business. http://blog.bufferapp.com/
** 27 Productivity Tips & Lifehacks from the Pros http://contactzilla.com/blog/27-productivity-tips-lifehacks-from-the-pros/
** The Top 5 Questions A Data Scientist Should Ask During a Job Interview http://datacommunitydc.org/blog/2013/07/the-top-n-questions-every-budding-data-scientist-should-ask-during-a-job-interview/
** coworking http://www.copass.org/ https://goodcoworking.com/
** series of articles about the challenges of growing an organization http://mdzlog.alcor.net/2013/06/20/scaling-human-systems-organizational-design-and-growth/
** Record Your Terminal Share it with no fuss http://ascii.io/
** About concentrating http://www.howtogetfocused.com/chapters/8-things-everybody-ought-to-know-about-concentrating
** The Importance of Scheduling Nothing by Jeff Weiner CEO at LinkedIn http://www.linkedin.com/today/post/article/20130403215758-22330283-the-importance-of-scheduling-nothing
** The tech industry is a meritocracy. We hire people based on their skills alone. http://aphyr.com/posts/275-meritocracy-is-short-sighted
** Your life is too short and too valuable to fritter away in work. http://www.brainpickings.org/index.php/2012/12/14/how-to-avoid-work/
** how to increase productivity with evernote http://trunk.evernote.com/en
** http://les-ressources-du-changement.fr/les-4-piliers-dune-confiance-en-soi-permanente/
** http://blog.zololabs.com/2012/10/16/the-10-secrets-that-make-networking-easy-fun-and-ridiculously-effective/
You have to earn the right to be heard about what you do and what you want to accomplish.
People really don’t care about what you do until they know that you care about what they do.
Secret #1: Assume the burden of other people’s discomfort
Secret #2: Give and expect nothing in return
Secret #3: Be proud of who you are
Secret #4: Compliment early and often
Secret #5: Look for common ground immediately
Secret #6: Tap your sphere of influence cautiously
Secret #7: Do not keep your personal and professional lives separate
Secret #8: Pull—never push
Secret #9: Include social media into your networking
Secret #10: Lose control of your marketing
** Tips and tricks for conf attendee
If a hallway conversation stalls, ask what they're working on. Discover the project they're passionate about.
@chrishouser

1. take notes in Emacs/Vim/etc.
2. meet people and go to the evening events and such to have good conversations.
@Baranosky

It helps tremendously to read up on the topics before a presentation, so that you aren't entering cold.
@AustinTHaas

take notes. revisit the notes. read them again. then write about them.
@darevay

My two rules: leave the laptop at hotel and introduce yourself to everyone. It opens so many doors to learning.
@jackdanger

the talks will be great, but the hallway conversations are better.
be aggressive about meeting people. Take advantage of the face time.
@jimduey

Talk to people about the presentations during the breaks. Meeting people is the most rewarding part.
@ericnormand
** The Patent Protection Racket http://www.joelonsoftware.com/items/2013/04/02.html
** Hirel like starts up http://blogs.hbr.org/cs/2013/05/to_attract_new_grads_hire_like.html
* Agile
