toread.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Sur la toile</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Sur la toile"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-09T16:53+0200"/>
<meta name="author" content="Maximilien"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="toread.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Sur la toile</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Work</a></li>
<li><a href="#sec-2">Agile</a></li>
<li><a href="#sec-3">devops</a></li>
<li><a href="#sec-4">innovation</a></li>
<li><a href="#sec-5">design</a></li>
<li><a href="#sec-6">hardware</a></li>
<li><a href="#sec-7">linux</a></li>
<li><a href="#sec-8">networks</a></li>
<li><a href="#sec-9">animation</a></li>
<li><a href="#sec-10">Web Dev</a></li>
<li><a href="#sec-11">search</a></li>
<li><a href="#sec-12">programming</a></li>
<li><a href="#sec-13">creative coding</a></li>
<li><a href="#sec-14">concurrency</a></li>
<li><a href="#sec-15">probabilistic programming</a></li>
<li><a href="#sec-16">haskell</a></li>
<li><a href="#sec-17">c#</a></li>
<li><a href="#sec-18">go</a></li>
<li><a href="#sec-19">python</a></li>
<li><a href="#sec-20">scala</a></li>
<li><a href="#sec-21">javascript</a></li>
<li><a href="#sec-22">Algo</a></li>
<li><a href="#sec-23">Math</a></li>
<li><a href="#sec-24">AI</a></li>
<li><a href="#sec-25">UI</a></li>
<li><a href="#sec-26">Category theory in practice</a></li>
<li><a href="#sec-27">Messaging</a></li>
<li><a href="#sec-28">Erlang</a></li>
<li><a href="#sec-29">Java</a></li>
<li><a href="#sec-30">Data NLP</a></li>
<li><a href="#sec-31">Open Data</a></li>
<li><a href="#sec-32">Data</a></li>
<li><a href="#sec-33">Data Analysis</a></li>
<li><a href="#sec-34">Data API</a></li>
<li><a href="#sec-35">Data Computing</a></li>
<li><a href="#sec-36">Data Science</a></li>
<li><a href="#sec-37">R</a></li>
<li><a href="#sec-38">database</a></li>
<li><a href="#sec-39">Data Visualization</a></li>
<li><a href="#sec-40">core.logic</a></li>
<li><a href="#sec-41">constraint programming</a></li>
<li><a href="#sec-42">cascalog</a></li>
<li><a href="#sec-43">clj programming</a></li>
<li><a href="#sec-44">clj math</a></li>
<li><a href="#sec-45">clj API</a></li>
<li><a href="#sec-46">clj concurrency</a></li>
<li><a href="#sec-47">clj image</a></li>
<li><a href="#sec-48">Music</a></li>
<li><a href="#sec-49">clj devops</a></li>
<li><a href="#sec-50">clj data computation</a></li>
<li><a href="#sec-51">clj java</a></li>
<li><a href="#sec-52">clj libraries</a></li>
<li><a href="#sec-53">misc clj</a></li>
<li><a href="#sec-54">clj machine learning</a></li>
<li><a href="#sec-55">clj server</a></li>
<li><a href="#sec-56">clj perf</a></li>
<li><a href="#sec-57">clj webdev</a></li>
<li><a href="#sec-58">clj GUI</a></li>
<li><a href="#sec-59">cljs</a></li>
<li><a href="#sec-60">parser</a></li>
<li><a href="#sec-61">IDE</a></li>
<li><a href="#sec-62">Tech stuff</a></li>
<li><a href="#sec-63">Fablab</a></li>
<li><a href="#sec-64">Education</a></li>
<li><a href="#sec-65">Research</a></li>
<li><a href="#sec-66">Jobs</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Work</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><a href="http://www.psychologicalscience.org/index.php/publications/observer/2010/april-10/improving-classroom-performance-by-challenging-student-misconceptions-about-learning.html">http://www.psychologicalscience.org/index.php/publications/observer/2010/april-10/improving-classroom-performance-by-challenging-student-misconceptions-about-learning.html</a></h3>
<div class="outline-text-3" id="text-1-1">

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Easier Decision-Making: Conduct Experiments By Leo Babauta <a href="http://zenhabits.net/test">http://zenhabits.net/test</a></h3>
<div class="outline-text-3" id="text-1-2">

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">The science of time perception: stop it slipping away by doing new things <a href="http://blog.bufferapp.com/the-science-of-time-perception-how-to-make-your-days-longer">http://blog.bufferapp.com/the-science-of-time-perception-how-to-make-your-days-longer</a></h3>
<div class="outline-text-3" id="text-1-3">

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Buufer : A blog about productivity, life hacks, writing, user experience, customer happiness and business. <a href="http://blog.bufferapp.com/">http://blog.bufferapp.com/</a></h3>
<div class="outline-text-3" id="text-1-4">

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">27 Productivity Tips &amp; Lifehacks from the Pros <a href="http://contactzilla.com/blog/27-productivity-tips-lifehacks-from-the-pros/">http://contactzilla.com/blog/27-productivity-tips-lifehacks-from-the-pros/</a></h3>
<div class="outline-text-3" id="text-1-5">

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">The Top 5 Questions A Data Scientist Should Ask During a Job Interview <a href="http://datacommunitydc.org/blog/2013/07/the-top-n-questions-every-budding-data-scientist-should-ask-during-a-job-interview/">http://datacommunitydc.org/blog/2013/07/the-top-n-questions-every-budding-data-scientist-should-ask-during-a-job-interview/</a></h3>
<div class="outline-text-3" id="text-1-6">

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">coworking <a href="http://www.copass.org/">http://www.copass.org/</a> <a href="https://goodcoworking.com/">https://goodcoworking.com/</a></h3>
<div class="outline-text-3" id="text-1-7">

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8">series of articles about the challenges of growing an organization <a href="http://mdzlog.alcor.net/2013/06/20/scaling-human-systems-organizational-design-and-growth/">http://mdzlog.alcor.net/2013/06/20/scaling-human-systems-organizational-design-and-growth/</a></h3>
<div class="outline-text-3" id="text-1-8">

</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9">Record Your Terminal Share it with no fuss <a href="http://ascii.io/">http://ascii.io/</a></h3>
<div class="outline-text-3" id="text-1-9">

</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10">About concentrating <a href="http://www.howtogetfocused.com/chapters/8-things-everybody-ought-to-know-about-concentrating">http://www.howtogetfocused.com/chapters/8-things-everybody-ought-to-know-about-concentrating</a></h3>
<div class="outline-text-3" id="text-1-10">

</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11">The Importance of Scheduling Nothing by Jeff Weiner CEO at LinkedIn <a href="http://www.linkedin.com/today/post/article/20130403215758-22330283-the-importance-of-scheduling-nothing">http://www.linkedin.com/today/post/article/20130403215758-22330283-the-importance-of-scheduling-nothing</a></h3>
<div class="outline-text-3" id="text-1-11">

</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12">The tech industry is a meritocracy. We hire people based on their skills alone. <a href="http://aphyr.com/posts/275-meritocracy-is-short-sighted">http://aphyr.com/posts/275-meritocracy-is-short-sighted</a></h3>
<div class="outline-text-3" id="text-1-12">

</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13">Your life is too short and too valuable to fritter away in work. <a href="http://www.brainpickings.org/index.php/2012/12/14/how-to-avoid-work/">http://www.brainpickings.org/index.php/2012/12/14/how-to-avoid-work/</a></h3>
<div class="outline-text-3" id="text-1-13">

</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14">how to increase productivity with evernote <a href="http://trunk.evernote.com/en">http://trunk.evernote.com/en</a></h3>
<div class="outline-text-3" id="text-1-14">

</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><a href="http://les-ressources-du-changement.fr/les-4-piliers-dune-confiance-en-soi-permanente/">http://les-ressources-du-changement.fr/les-4-piliers-dune-confiance-en-soi-permanente/</a></h3>
<div class="outline-text-3" id="text-1-15">

</div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16"><a href="http://blog.zololabs.com/2012/10/16/the-10-secrets-that-make-networking-easy-fun-and-ridiculously-effective/">http://blog.zololabs.com/2012/10/16/the-10-secrets-that-make-networking-easy-fun-and-ridiculously-effective/</a></h3>
<div class="outline-text-3" id="text-1-16">

<p>You have to earn the right to be heard about what you do and what you want to accomplish.
People really don’t care about what you do until they know that you care about what they do.
Secret #1: Assume the burden of other people’s discomfort
Secret #2: Give and expect nothing in return
Secret #3: Be proud of who you are
Secret #4: Compliment early and often
Secret #5: Look for common ground immediately
Secret #6: Tap your sphere of influence cautiously
Secret #7: Do not keep your personal and professional lives separate
Secret #8: Pull—never push
Secret #9: Include social media into your networking
Secret #10: Lose control of your marketing
</p></div>

</div>

<div id="outline-container-1-17" class="outline-3">
<h3 id="sec-1-17">Tips and tricks for conf attendee</h3>
<div class="outline-text-3" id="text-1-17">

<p>If a hallway conversation stalls, ask what they're working on. Discover the project they're passionate about.
@chrishouser
</p>
<ol>
<li>take notes in Emacs/Vim/etc.
</li>
<li>meet people and go to the evening events and such to have good conversations.
</li>
</ol>

<p>@Baranosky
</p>
<p>
It helps tremendously to read up on the topics before a presentation, so that you aren't entering cold.
@AustinTHaas
</p>
<p>
take notes. revisit the notes. read them again. then write about them.
@darevay
</p>
<p>
My two rules: leave the laptop at hotel and introduce yourself to everyone. It opens so many doors to learning.
@jackdanger
</p>
<p>
the talks will be great, but the hallway conversations are better.
be aggressive about meeting people. Take advantage of the face time.
@jimduey
</p>
<p>
Talk to people about the presentations during the breaks. Meeting people is the most rewarding part.
@ericnormand
</p></div>

</div>

<div id="outline-container-1-18" class="outline-3">
<h3 id="sec-1-18">The Patent Protection Racket <a href="http://www.joelonsoftware.com/items/2013/04/02.html">http://www.joelonsoftware.com/items/2013/04/02.html</a></h3>
<div class="outline-text-3" id="text-1-18">

</div>

</div>

<div id="outline-container-1-19" class="outline-3">
<h3 id="sec-1-19">Hirel like starts up <a href="http://blogs.hbr.org/cs/2013/05/to_attract_new_grads_hire_like.html">http://blogs.hbr.org/cs/2013/05/to_attract_new_grads_hire_like.html</a></h3>
<div class="outline-text-3" id="text-1-19">

</div>
</div>

</div>
