toread.org
** TDD, where did it all go wrong? https://groups.google.com/forum/#!topic/growing-object-oriented-software/Hxp8cVfE4gI
** A Flexible Git Workflow For Teams http://blog.buildbettersoftware.com/post/55281071972/a-flexible-git-workflow-for-teams
** Two months without Twitter http://bjeanes.com/2013/05/two-months-without-twitter
** 3 approaches to do remote pairing http://blog.cloudcitydevelopment.com/2013/05/22/three-approaches-to-remote-pair-programming-draft/
** The easiest way to teach yourself C++ in 21 days http://abstrusegoose.com/249
** Estimates in Software Development. New Frontiers. http://agile.dzone.com/articles/estimates-software-development
** mumble Low-latency, high-quality voice communication for gamers http://mumble.sourceforge.net/
http://gspadmin.com/how-tos/voice-servers/how-to-install-mumble-linux/
** property-based testing http://blog.jessitron.com/2013/04/property-based-testing-what-is-it.html
Writing tests first forces you to think about the problem you're solving. Writing property-based tests forces you to think way harder.
** pairing experience http://stevenjackson.github.com/2013/02/09/pairing/
** Know your next commit http://programmer.97things.oreilly.com/wiki/index.php/Know_Your_Next_Commit
** Gerrit web based code review system https://code.google.com/p/gerrit/ 
** gerrit better than github http://julien.danjou.info/blog/2013/rant-about-github-pull-request-workflow-implementation
* devops
** Marelle logic programming (prolog) for devops  http://quietlyamused.org/blog/2013/11/09/marelle-for-devops/
** Pull Requests Maintainers Won't Hate http://www.booleanknot.com/blog/2013/09/07/pull-requests.html
** A Ruby JMX Feed for Riemann http://ianrumford.github.io/blog/2013/01/15/a-ruby-jmx-feed-for-riemann/
** First Steps Using Pallet, VMFest and VirtualBox (VBox) 4.2 http://ianrumford.github.io/blog/2012/10/24/first-steps-using-pallet-with-vmfest-and-virtualbox-4-dot-2/
** openstack thoughts by Alex Gaynor http://alexgaynor.net/2013/jul/11/thoughts-openstack/
** expert panel of guests to discuss DevOps and Continuous Delivery leveraging Cloud http://expertintegratedsystemsblog.com/index.php/2013/06/opinionated-infrastructure-devops-and-continuous-delivery-leveraging-cloud
** openstack university http://buildacloud.org/blog/259-cloudstack-university.html http://www.youtube.com/playlist?list=PLb899uhkHRoZCRE00h_9CRgUSiHEgFDbC 
http://www.youtube.com/user/DIYCloudComputing
** cloudmonkey : command line interface for Apache CloudStack  http://rohityadav.in/logs/cloudmonkey/
** OpenStack, Puppet used to build cloud for world's largest particle accelerator. http://arstechnica.com/information-technology/2013/05/150000-cloud-virtual-machines-will-help-solve-mysteries-of-the-universe
** Mohs’ law  hadoop is hard https://rsts11.wordpress.com/2013/05/14/mohs-law-and-big-data-rsts11/
** SaaS reflections http://nosql.mypopescu.com/post/50474394560/this-is-why-big-data-is-the-sweet-spot-for-saas-and
** stackato compared to cloudfoundry http://www.activestate.com/stackato/compare-with-cloud-foundry
** The Cloudcast: From DevOps to Private PaaS http://architects.dzone.com/articles/cloudcast-devops-private-paas
** devopsDays London 2013 http://scribes.tweetscriber.com/RealGeneKim/114
** openstack EPEL http://fedoraproject.org/wiki/Getting_started_with_OpenStack_EPEL
** Cloud foundry open PAAS http://de.slideshare.net/chanezon/cloud-foundry-the-open-platform-as-a-service
** Ansible is the easiest way to deploy, manage, and orchestrate computer systems you've ever seen http://ansible.cc/
** virtiual machine with pallet : vmfest https://gist.github.com/tbatchelli/867526 https://github.com/pallet/vmfest-playground
https://github.com/pallet/pallet-vmfest
** logging solutions http://www.miyagijournal.com/articles/five-steps-application-logging/
** dotcloud https://www.dotcloud.com/static/paas_under_the_hood_printversion.pdf
** http://www.jayway.com/2013/03/03/git-is-a-purely-functional-data-structure/
** Monitoring setup of amara (riemann , graphite better than nagios) http://labs.amara.org/2012-07-16-metrics.html
** riemann video http://vimeo.com/45807716
