toread.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Agile</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">TDD, where did it all go wrong? <a href="https://groups.google.com/forum/#!topic/growing-object-oriented-software/Hxp8cVfE4gI">https://groups.google.com/forum/#!topic/growing-object-oriented-software/Hxp8cVfE4gI</a></h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">A Flexible Git Workflow For Teams <a href="http://blog.buildbettersoftware.com/post/55281071972/a-flexible-git-workflow-for-teams">http://blog.buildbettersoftware.com/post/55281071972/a-flexible-git-workflow-for-teams</a></h3>
<div class="outline-text-3" id="text-2-2">

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Two months without Twitter <a href="http://bjeanes.com/2013/05/two-months-without-twitter">http://bjeanes.com/2013/05/two-months-without-twitter</a></h3>
<div class="outline-text-3" id="text-2-3">

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">3 approaches to do remote pairing <a href="http://blog.cloudcitydevelopment.com/2013/05/22/three-approaches-to-remote-pair-programming-draft/">http://blog.cloudcitydevelopment.com/2013/05/22/three-approaches-to-remote-pair-programming-draft/</a></h3>
<div class="outline-text-3" id="text-2-4">

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5">The easiest way to teach yourself C++ in 21 days <a href="http://abstrusegoose.com/249">http://abstrusegoose.com/249</a></h3>
<div class="outline-text-3" id="text-2-5">

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6">Estimates in Software Development. New Frontiers. <a href="http://agile.dzone.com/articles/estimates-software-development">http://agile.dzone.com/articles/estimates-software-development</a></h3>
<div class="outline-text-3" id="text-2-6">

</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7">mumble Low-latency, high-quality voice communication for gamers <a href="http://mumble.sourceforge.net/">http://mumble.sourceforge.net/</a></h3>
<div class="outline-text-3" id="text-2-7">

<p><a href="http://gspadmin.com/how-tos/voice-servers/how-to-install-mumble-linux/">http://gspadmin.com/how-tos/voice-servers/how-to-install-mumble-linux/</a>
</p></div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8">property-based testing <a href="http://blog.jessitron.com/2013/04/property-based-testing-what-is-it.html">http://blog.jessitron.com/2013/04/property-based-testing-what-is-it.html</a></h3>
<div class="outline-text-3" id="text-2-8">

<p>Writing tests first forces you to think about the problem you're solving. Writing property-based tests forces you to think way harder.
</p></div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9">pairing experience <a href="http://stevenjackson.github.com/2013/02/09/pairing/">http://stevenjackson.github.com/2013/02/09/pairing/</a></h3>
<div class="outline-text-3" id="text-2-9">

</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10">Know your next commit <a href="http://programmer.97things.oreilly.com/wiki/index.php/Know_Your_Next_Commit">http://programmer.97things.oreilly.com/wiki/index.php/Know_Your_Next_Commit</a></h3>
<div class="outline-text-3" id="text-2-10">

</div>

</div>

<div id="outline-container-2-11" class="outline-3">
<h3 id="sec-2-11">Gerrit web based code review system <a href="https://code.google.com/p/gerrit/">https://code.google.com/p/gerrit/</a></h3>
<div class="outline-text-3" id="text-2-11">

</div>

</div>

<div id="outline-container-2-12" class="outline-3">
<h3 id="sec-2-12">gerrit better than github <a href="http://julien.danjou.info/blog/2013/rant-about-github-pull-request-workflow-implementation">http://julien.danjou.info/blog/2013/rant-about-github-pull-request-workflow-implementation</a></h3>
<div class="outline-text-3" id="text-2-12">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">devops</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Pull Requests Maintainers Won't Hate <a href="http://www.booleanknot.com/blog/2013/09/07/pull-requests.html">http://www.booleanknot.com/blog/2013/09/07/pull-requests.html</a></h3>
<div class="outline-text-3" id="text-3-1">

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">A Ruby JMX Feed for Riemann <a href="http://ianrumford.github.io/blog/2013/01/15/a-ruby-jmx-feed-for-riemann/">http://ianrumford.github.io/blog/2013/01/15/a-ruby-jmx-feed-for-riemann/</a></h3>
<div class="outline-text-3" id="text-3-2">

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">First Steps Using Pallet, VMFest and VirtualBox (VBox) 4.2 <a href="http://ianrumford.github.io/blog/2012/10/24/first-steps-using-pallet-with-vmfest-and-virtualbox-4-dot-2/">http://ianrumford.github.io/blog/2012/10/24/first-steps-using-pallet-with-vmfest-and-virtualbox-4-dot-2/</a></h3>
<div class="outline-text-3" id="text-3-3">

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">openstack thoughts by Alex Gaynor <a href="http://alexgaynor.net/2013/jul/11/thoughts-openstack/">http://alexgaynor.net/2013/jul/11/thoughts-openstack/</a></h3>
<div class="outline-text-3" id="text-3-4">

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">expert panel of guests to discuss DevOps and Continuous Delivery leveraging Cloud <a href="http://expertintegratedsystemsblog.com/index.php/2013/06/opinionated-infrastructure-devops-and-continuous-delivery-leveraging-cloud">http://expertintegratedsystemsblog.com/index.php/2013/06/opinionated-infrastructure-devops-and-continuous-delivery-leveraging-cloud</a></h3>
<div class="outline-text-3" id="text-3-5">

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">openstack university <a href="http://buildacloud.org/blog/259-cloudstack-university.html">http://buildacloud.org/blog/259-cloudstack-university.html</a> <a href="http://www.youtube.com/playlist?list=PLb899uhkHRoZCRE00h_9CRgUSiHEgFDbC">http://www.youtube.com/playlist?list=PLb899uhkHRoZCRE00h_9CRgUSiHEgFDbC</a></h3>
<div class="outline-text-3" id="text-3-6">

<p><a href="http://www.youtube.com/user/DIYCloudComputing">http://www.youtube.com/user/DIYCloudComputing</a>
</p></div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">cloudmonkey : command line interface for Apache CloudStack  <a href="http://rohityadav.in/logs/cloudmonkey/">http://rohityadav.in/logs/cloudmonkey/</a></h3>
<div class="outline-text-3" id="text-3-7">

</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8">OpenStack, Puppet used to build cloud for world's largest particle accelerator. <a href="http://arstechnica.com/information-technology/2013/05/150000-cloud-virtual-machines-will-help-solve-mysteries-of-the-universe">http://arstechnica.com/information-technology/2013/05/150000-cloud-virtual-machines-will-help-solve-mysteries-of-the-universe</a></h3>
<div class="outline-text-3" id="text-3-8">

</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9">Mohs’ law  hadoop is hard <a href="https://rsts11.wordpress.com/2013/05/14/mohs-law-and-big-data-rsts11/">https://rsts11.wordpress.com/2013/05/14/mohs-law-and-big-data-rsts11/</a></h3>
<div class="outline-text-3" id="text-3-9">

</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10">SaaS reflections <a href="http://nosql.mypopescu.com/post/50474394560/this-is-why-big-data-is-the-sweet-spot-for-saas-and">http://nosql.mypopescu.com/post/50474394560/this-is-why-big-data-is-the-sweet-spot-for-saas-and</a></h3>
<div class="outline-text-3" id="text-3-10">

</div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11">stackato compared to cloudfoundry <a href="http://www.activestate.com/stackato/compare-with-cloud-foundry">http://www.activestate.com/stackato/compare-with-cloud-foundry</a></h3>
<div class="outline-text-3" id="text-3-11">

</div>

</div>

<div id="outline-container-3-12" class="outline-3">
<h3 id="sec-3-12">The Cloudcast: From DevOps to Private PaaS <a href="http://architects.dzone.com/articles/cloudcast-devops-private-paas">http://architects.dzone.com/articles/cloudcast-devops-private-paas</a></h3>
<div class="outline-text-3" id="text-3-12">

</div>

</div>

<div id="outline-container-3-13" class="outline-3">
<h3 id="sec-3-13">devopsDays London 2013 <a href="http://scribes.tweetscriber.com/RealGeneKim/114">http://scribes.tweetscriber.com/RealGeneKim/114</a></h3>
<div class="outline-text-3" id="text-3-13">

</div>

</div>

<div id="outline-container-3-14" class="outline-3">
<h3 id="sec-3-14">openstack EPEL <a href="http://fedoraproject.org/wiki/Getting_started_with_OpenStack_EPEL">http://fedoraproject.org/wiki/Getting_started_with_OpenStack_EPEL</a></h3>
<div class="outline-text-3" id="text-3-14">

</div>

</div>

<div id="outline-container-3-15" class="outline-3">
<h3 id="sec-3-15">Cloud foundry open PAAS <a href="http://de.slideshare.net/chanezon/cloud-foundry-the-open-platform-as-a-service">http://de.slideshare.net/chanezon/cloud-foundry-the-open-platform-as-a-service</a></h3>
<div class="outline-text-3" id="text-3-15">

</div>

</div>

<div id="outline-container-3-16" class="outline-3">
<h3 id="sec-3-16">Ansible is the easiest way to deploy, manage, and orchestrate computer systems you've ever seen <a href="http://ansible.cc/">http://ansible.cc/</a></h3>
<div class="outline-text-3" id="text-3-16">

</div>

</div>

<div id="outline-container-3-17" class="outline-3">
<h3 id="sec-3-17">virtiual machine with pallet : vmfest <a href="https://gist.github.com/tbatchelli/867526">https://gist.github.com/tbatchelli/867526</a> <a href="https://github.com/pallet/vmfest-playground">https://github.com/pallet/vmfest-playground</a></h3>
<div class="outline-text-3" id="text-3-17">

<p><a href="https://github.com/pallet/pallet-vmfest">https://github.com/pallet/pallet-vmfest</a>
</p></div>

</div>

<div id="outline-container-3-18" class="outline-3">
<h3 id="sec-3-18">logging solutions <a href="http://www.miyagijournal.com/articles/five-steps-application-logging/">http://www.miyagijournal.com/articles/five-steps-application-logging/</a></h3>
<div class="outline-text-3" id="text-3-18">

</div>

</div>

<div id="outline-container-3-19" class="outline-3">
<h3 id="sec-3-19">dotcloud <a href="https://www.dotcloud.com/static/paas_under_the_hood_printversion.pdf">https://www.dotcloud.com/static/paas_under_the_hood_printversion.pdf</a></h3>
<div class="outline-text-3" id="text-3-19">

</div>

</div>

<div id="outline-container-3-20" class="outline-3">
<h3 id="sec-3-20"><a href="http://www.jayway.com/2013/03/03/git-is-a-purely-functional-data-structure/">http://www.jayway.com/2013/03/03/git-is-a-purely-functional-data-structure/</a></h3>
<div class="outline-text-3" id="text-3-20">

</div>

</div>

<div id="outline-container-3-21" class="outline-3">
<h3 id="sec-3-21">Monitoring setup of amara (riemann , graphite better than nagios) <a href="http://labs.amara.org/2012-07-16-metrics.html">http://labs.amara.org/2012-07-16-metrics.html</a></h3>
<div class="outline-text-3" id="text-3-21">

</div>

</div>

<div id="outline-container-3-22" class="outline-3">
<h3 id="sec-3-22">riemann video <a href="http://vimeo.com/45807716">http://vimeo.com/45807716</a></h3>
<div class="outline-text-3" id="text-3-22">

</div>

</div>
