toread.org
** list of  monitoring tools http://blog.lusis.org/blog/2012/06/05/monitoring-sucking-just-a-little-bit-less/  https://github.com/monitoringsucks/tool-repos

** deploy clojure with capistrano http://coffeenco.de/articles/how_to_deploy_clojure_code.html
** comparison config management puppet chef pallet http://java.dzone.com/articles/comparing-flavors-config http://bitfieldconsulting.com/puppet-vs-chef
** puppet webtuesday http://webtuesday.ch/meetings/20130108/
** puppet + jenkins http://mig5.net/content/testing-puppet-jenkins-deploying.html
** configuration with clj https://github.com/sonian/carica  https://github.com/weavejester/environ
Two ways: one is to use .clj data files on the classpath and take
advantage of the fact that different profiles put different resources
directories on the classpath. This is the approach taken by Carica
(https://github.com/sonian/carica) and works great if you have complex
config with nested values.

The other approach is to use environment variables; the best tool for
that is Environ: https://github.com/weavejester/environ
** bug tracker https://github.com/ragnard/clj-squash with squash
** http://logstash.net/ better than splunk ? send data to graphite , librato , gnaglia or graylog ?
** deploy made easy http://docs.vagrantup.com/v1/docs/getting-started/index.html
** http://www.niclas-meier.de/2013/02/bootstrapping-ec2-servers-with-puppet/
* innovation
** Big Data : nouvelle étape de l’informatisation du monde http://www.internetactu.net/2013/05/14/big-data-nouvelle-etape/
** converstion with Alan Kay http://queue.acm.org/detail.cfm?id=1039523
** Education http://www.sophia.org/online-courses-tutorials
** http://memeburn.com/2013/04/computer-pioneer-alan-kay-silicon-valley-is-running-out-of-innovation-video/
* design
** http://www.servicedesigntools.org/
** Pattern Matemorphosis http://www.behance.net/gallery/Pattern-Metamorphosis/9737427
* hardware
** [Kultpfunzel: Kult=cult. Funzel=dim light.] macht hell & ist hackable http://kultpfunzel.ch/
** clj on raspberry pi by @gonzih http://blog.gonzih.me/blog/2013/04/14/clojure-on-raspberry-pi-openjdk-vs-oracle-java-8/
** school for poetic computation  http://sfpc.io/index.html
** A Hardware Accelerated Regular Expression Matcher http://bkase.github.io/CUDA-grep/finalreport.html
** How-to build your own GPS Receiver http://www.holmea.demon.co.uk/GPS/Main.htm
ASM Embedded CPU FORTH
Verilog Spartan 3 FPGA
C++ Raspberry Pi
** Fablab
*** Fablab Boombox http://fab.cba.mit.edu/classes/863.11/people/matthew.keeter/fab_boombox/ http://fab.cba.mit.edu/content/projects/boombox/ 
*** fablab class http://fab.cba.mit.edu/classes/MAS.863/
*** fablab makezine http://makezine.com/2012/01/02/fab-lab-boombox/
** Dual Boot Windows/Android 2.2 Tablet Straight Out Of Shenzhen http://www.gizchina.com/2011/03/18/dual-boot-windowsandroid-22-tablet-straight-shenzhen/
** Tablet billiger : alpentab odys http://tablet-billiger.com/products-page/odys-13-zoll/odys-aeon-android-4-1-133zoll-15ghz/
** Tech Preis Vergleich http://www.heise.de/preisvergleich
** AI / Robots
*** nao robot with clojure http://nakkaya.com/2010/04/26/simple-robocup-simspark-agent-in-clojure/
* linux
** eurosport on linux http://johnthelutheran.tumblr.com/post/174706307/eurosport-on-linux
** delete from line 3 up to and including first blank line: sed 3,/^$/d filename
** Bash part 3 : all about redirections http://www.catonmat.net/blog/bash-one-liners-explained-part-three/
** Major Linux Vs UNIX Kernel Differences http://www.thegeekstuff.com/2012/01/linux-unix-kernel/
** mutt 
*** gmail setup 
http://lifehacker.com/5574557/how-to-use-the-fast-and-powerful-mutt-email-client-with-gmail
http://www.jlime.com/wiki/documentation/user/general/howtos/gmail_mutt
http://7h0ma5.org/2010/12/gmail-mutt-imap/
*** usage
http://www.techrepublic.com/blog/opensource/my-number-one-reason-to-use-mutt-managing-multiple-profiles/3113
http://bouliiii.blogspot.it/2012/02/mutt-and-auto-complete.html
http://bouliiii.blogspot.it/2012/02/mutt-and-auto-complete.html
http://sheet.shiar.nl/mutt
** sed one liners http://www-rohan.sdsu.edu/doc/sed.html
