toread.html

<div id="outline-container-3-23" class="outline-3">
<h3 id="sec-3-23">list of  monitoring tools <a href="http://blog.lusis.org/blog/2012/06/05/monitoring-sucking-just-a-little-bit-less/">http://blog.lusis.org/blog/2012/06/05/monitoring-sucking-just-a-little-bit-less/</a>  <a href="https://github.com/monitoringsucks/tool-repos">https://github.com/monitoringsucks/tool-repos</a></h3>
<div class="outline-text-3" id="text-3-23">


</div>

</div>

<div id="outline-container-3-24" class="outline-3">
<h3 id="sec-3-24">deploy clojure with capistrano <a href="http://coffeenco.de/articles/how_to_deploy_clojure_code.html">http://coffeenco.de/articles/how_to_deploy_clojure_code.html</a></h3>
<div class="outline-text-3" id="text-3-24">

</div>

</div>

<div id="outline-container-3-25" class="outline-3">
<h3 id="sec-3-25">comparison config management puppet chef pallet <a href="http://java.dzone.com/articles/comparing-flavors-config">http://java.dzone.com/articles/comparing-flavors-config</a> <a href="http://bitfieldconsulting.com/puppet-vs-chef">http://bitfieldconsulting.com/puppet-vs-chef</a></h3>
<div class="outline-text-3" id="text-3-25">

</div>

</div>

<div id="outline-container-3-26" class="outline-3">
<h3 id="sec-3-26">puppet webtuesday <a href="http://webtuesday.ch/meetings/20130108/">http://webtuesday.ch/meetings/20130108/</a></h3>
<div class="outline-text-3" id="text-3-26">

</div>

</div>

<div id="outline-container-3-27" class="outline-3">
<h3 id="sec-3-27">puppet + jenkins <a href="http://mig5.net/content/testing-puppet-jenkins-deploying.html">http://mig5.net/content/testing-puppet-jenkins-deploying.html</a></h3>
<div class="outline-text-3" id="text-3-27">

</div>

</div>

<div id="outline-container-3-28" class="outline-3">
<h3 id="sec-3-28">configuration with clj <a href="https://github.com/sonian/carica">https://github.com/sonian/carica</a>  <a href="https://github.com/weavejester/environ">https://github.com/weavejester/environ</a></h3>
<div class="outline-text-3" id="text-3-28">

<p>Two ways: one is to use .clj data files on the classpath and take
advantage of the fact that different profiles put different resources
directories on the classpath. This is the approach taken by Carica
(<a href="https://github.com/sonian/carica">https://github.com/sonian/carica</a>) and works great if you have complex
config with nested values.
</p>
<p>
The other approach is to use environment variables; the best tool for
that is Environ: <a href="https://github.com/weavejester/environ">https://github.com/weavejester/environ</a>
</p></div>

</div>

<div id="outline-container-3-29" class="outline-3">
<h3 id="sec-3-29">bug tracker <a href="https://github.com/ragnard/clj-squash">https://github.com/ragnard/clj-squash</a> with squash</h3>
<div class="outline-text-3" id="text-3-29">

</div>

</div>

<div id="outline-container-3-30" class="outline-3">
<h3 id="sec-3-30"><a href="http://logstash.net/">http://logstash.net/</a> better than splunk ? send data to graphite , librato , gnaglia or graylog ?</h3>
<div class="outline-text-3" id="text-3-30">

</div>

</div>

<div id="outline-container-3-31" class="outline-3">
<h3 id="sec-3-31">deploy made easy <a href="http://docs.vagrantup.com/v1/docs/getting-started/index.html">http://docs.vagrantup.com/v1/docs/getting-started/index.html</a></h3>
<div class="outline-text-3" id="text-3-31">

</div>

</div>

<div id="outline-container-3-32" class="outline-3">
<h3 id="sec-3-32"><a href="http://www.niclas-meier.de/2013/02/bootstrapping-ec2-servers-with-puppet/">http://www.niclas-meier.de/2013/02/bootstrapping-ec2-servers-with-puppet/</a></h3>
<div class="outline-text-3" id="text-3-32">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">innovation</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Big Data : nouvelle étape de l’informatisation du monde <a href="http://www.internetactu.net/2013/05/14/big-data-nouvelle-etape/">http://www.internetactu.net/2013/05/14/big-data-nouvelle-etape/</a></h3>
<div class="outline-text-3" id="text-4-1">

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">converstion with Alan Kay <a href="http://queue.acm.org/detail.cfm?id=1039523">http://queue.acm.org/detail.cfm?id=1039523</a></h3>
<div class="outline-text-3" id="text-4-2">

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Education <a href="http://www.sophia.org/online-courses-tutorials">http://www.sophia.org/online-courses-tutorials</a></h3>
<div class="outline-text-3" id="text-4-3">

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><a href="http://memeburn.com/2013/04/computer-pioneer-alan-kay-silicon-valley-is-running-out-of-innovation-video/">http://memeburn.com/2013/04/computer-pioneer-alan-kay-silicon-valley-is-running-out-of-innovation-video/</a></h3>
<div class="outline-text-3" id="text-4-4">

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">design</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Pattern Matemorphosis <a href="http://www.behance.net/gallery/Pattern-Metamorphosis/9737427">http://www.behance.net/gallery/Pattern-Metamorphosis/9737427</a></h3>
<div class="outline-text-3" id="text-5-1">

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">hardware</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">clj on raspberry pi by @gonzih <a href="http://blog.gonzih.me/blog/2013/04/14/clojure-on-raspberry-pi-openjdk-vs-oracle-java-8/">http://blog.gonzih.me/blog/2013/04/14/clojure-on-raspberry-pi-openjdk-vs-oracle-java-8/</a></h3>
<div class="outline-text-3" id="text-6-1">

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">school for poetic computation  <a href="http://sfpc.io/index.html">http://sfpc.io/index.html</a></h3>
<div class="outline-text-3" id="text-6-2">

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">A Hardware Accelerated Regular Expression Matcher <a href="http://bkase.github.io/CUDA-grep/finalreport.html">http://bkase.github.io/CUDA-grep/finalreport.html</a></h3>
<div class="outline-text-3" id="text-6-3">

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4">How-to build your own GPS Receiver <a href="http://www.holmea.demon.co.uk/GPS/Main.htm">http://www.holmea.demon.co.uk/GPS/Main.htm</a></h3>
<div class="outline-text-3" id="text-6-4">

<p>ASM Embedded CPU FORTH
Verilog Spartan 3 FPGA
C++ Raspberry Pi
</p></div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5">Fablab</h3>
<div class="outline-text-3" id="text-6-5">


</div>

<div id="outline-container-6-5-1" class="outline-4">
<h4 id="sec-6-5-1">Fablab Boombox <a href="http://fab.cba.mit.edu/classes/863.11/people/matthew.keeter/fab_boombox/">http://fab.cba.mit.edu/classes/863.11/people/matthew.keeter/fab_boombox/</a> <a href="http://fab.cba.mit.edu/content/projects/boombox/">http://fab.cba.mit.edu/content/projects/boombox/</a></h4>
<div class="outline-text-4" id="text-6-5-1">

</div>

</div>

<div id="outline-container-6-5-2" class="outline-4">
<h4 id="sec-6-5-2">fablab class <a href="http://fab.cba.mit.edu/classes/MAS.863/">http://fab.cba.mit.edu/classes/MAS.863/</a></h4>
<div class="outline-text-4" id="text-6-5-2">

</div>

</div>

<div id="outline-container-6-5-3" class="outline-4">
<h4 id="sec-6-5-3">fablab makezine <a href="http://makezine.com/2012/01/02/fab-lab-boombox/">http://makezine.com/2012/01/02/fab-lab-boombox/</a></h4>
<div class="outline-text-4" id="text-6-5-3">

</div>
</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6">Dual Boot Windows/Android 2.2 Tablet Straight Out Of Shenzhen <a href="http://www.gizchina.com/2011/03/18/dual-boot-windowsandroid-22-tablet-straight-shenzhen/">http://www.gizchina.com/2011/03/18/dual-boot-windowsandroid-22-tablet-straight-shenzhen/</a></h3>
<div class="outline-text-3" id="text-6-6">

</div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7">Tablet billiger : alpentab odys <a href="http://tablet-billiger.com/products-page/odys-13-zoll/odys-aeon-android-4-1-133zoll-15ghz/">http://tablet-billiger.com/products-page/odys-13-zoll/odys-aeon-android-4-1-133zoll-15ghz/</a></h3>
<div class="outline-text-3" id="text-6-7">

</div>

</div>

<div id="outline-container-6-8" class="outline-3">
<h3 id="sec-6-8">Tech Preis Vergleich <a href="http://www.heise.de/preisvergleich">http://www.heise.de/preisvergleich</a></h3>
<div class="outline-text-3" id="text-6-8">

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">linux</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">eurosport on linux <a href="http://johnthelutheran.tumblr.com/post/174706307/eurosport-on-linux">http://johnthelutheran.tumblr.com/post/174706307/eurosport-on-linux</a></h3>
<div class="outline-text-3" id="text-7-1">

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">delete from line 3 up to and including first blank line: sed 3,/^$/d filename</h3>
<div class="outline-text-3" id="text-7-2">

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3">Bash part 3 : all about redirections <a href="http://www.catonmat.net/blog/bash-one-liners-explained-part-three/">http://www.catonmat.net/blog/bash-one-liners-explained-part-three/</a></h3>
<div class="outline-text-3" id="text-7-3">

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4">Major Linux Vs UNIX Kernel Differences <a href="http://www.thegeekstuff.com/2012/01/linux-unix-kernel/">http://www.thegeekstuff.com/2012/01/linux-unix-kernel/</a></h3>
<div class="outline-text-3" id="text-7-4">

</div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5">mutt</h3>
<div class="outline-text-3" id="text-7-5">


</div>

<div id="outline-container-7-5-1" class="outline-4">
<h4 id="sec-7-5-1">gmail setup</h4>
<div class="outline-text-4" id="text-7-5-1">

<p><a href="http://lifehacker.com/5574557/how-to-use-the-fast-and-powerful-mutt-email-client-with-gmail">http://lifehacker.com/5574557/how-to-use-the-fast-and-powerful-mutt-email-client-with-gmail</a>
<a href="http://www.jlime.com/wiki/documentation/user/general/howtos/gmail_mutt">http://www.jlime.com/wiki/documentation/user/general/howtos/gmail_mutt</a>
<a href="http://7h0ma5.org/2010/12/gmail-mutt-imap/">http://7h0ma5.org/2010/12/gmail-mutt-imap/</a>
</p></div>

</div>

<div id="outline-container-7-5-2" class="outline-4">
<h4 id="sec-7-5-2">usage</h4>
<div class="outline-text-4" id="text-7-5-2">

<p><a href="http://www.techrepublic.com/blog/opensource/my-number-one-reason-to-use-mutt-managing-multiple-profiles/3113">http://www.techrepublic.com/blog/opensource/my-number-one-reason-to-use-mutt-managing-multiple-profiles/3113</a>
<a href="http://bouliiii.blogspot.it/2012/02/mutt-and-auto-complete.html">http://bouliiii.blogspot.it/2012/02/mutt-and-auto-complete.html</a>
<a href="http://bouliiii.blogspot.it/2012/02/mutt-and-auto-complete.html">http://bouliiii.blogspot.it/2012/02/mutt-and-auto-complete.html</a>
<a href="http://sheet.shiar.nl/mutt">http://sheet.shiar.nl/mutt</a>
</p></div>
</div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6">sed one liners <a href="http://www-rohan.sdsu.edu/doc/sed.html">http://www-rohan.sdsu.edu/doc/sed.html</a></h3>
<div class="outline-text-3" id="text-7-6">

</div>

</div>
