toread.org
** Read-only Guest tmux Sessions http://brianmckenna.org/blog/guest_tmux
** cli for monitoring http://net.tutsplus.com/tutorials/15-command-line-tools-for-monitoring-linux-systems/
** Latex on the moon https://www.writelatex.com/ https://www.sharelatex.com/ http://jasalguero.com/ledld/general/latex-on-the-cloud/http://www.cstr.ed.ac.uk/projects/festival/
** TextToSpeech https://help.ubuntu.com/community/TextToSpeech
** Festival TextToSpeech  http://www.cstr.ed.ac.uk/projects/festival/
** FEstival To build own voice http://festvox.org/
** Festival TTS for polish http://nshmyrev.blogspot.fr/2009/08/release-of-polish-voice-for-festival.html
** http://www.thegeekstuff.com/tag/sed-tips-and-tricks/
** find http://www.eriwen.com/productivity/find-is-a-beautiful-tool/
** xmonad explained http://www.youtube.com/watch?v=63MpfyZUcrU
** book on zsh http://www.bash2zsh.com/
**  http://everythingsysadmin.com/2012/09/unorthodoxunix.html
    - grep . *.txt
    - more * | cat
    - "fmt -1" (split lines into individual words)
    -  gnt-job list | egrep --color=always 'running|waiting'
** linux performance http://insidehpc.com/2013/03/02/video-brendan-gregg-presents-on-linux-performance-analysis-and-tools/
* networks
** Source Multiplayer Networking for multi-players games https://developer.valvesoftware.com/wiki/Source_Multiplayer_Networking
** IRC commands http://www.ircbeginner.com/ircinfo/ircc-commands.html connect ot IRC http://irc.lc/freenode/
** Programming Distributed Computing Systems A Foundational Approach By Carlos A. Varela https://mitpress.mit.edu/books/programming-distributed-computing-systems
** localize IP address http://www.maxmind.com/en/news_localizaton 
** network neutrality http://neubot.org/ http://en.wikipedia.org/wiki/Neubot http://data.neubot.org/ http://www.measurementlab.net/fr
** The network is reliable by aphyr http://aphyr.com/posts/288-the-network-is-reliable
** RICON East 2013 review https://gist.github.com/hectcastro/186e567830fe131a1ef1
** safety liveness http://www.bailis.org/blog/safety-and-liveness-eventual-consistency-is-not-safe/
** http://www.cubrid.org/blog/dev-platform/understanding-tcp-ip-network-stack/
** protobuff faster http://kentonv.github.com/capnproto/
** network partition http://damienkatz.net/2013/05/dynamo_sure_works_hard.html
 Amazon Dynamo Paper. It has some very interesting concepts, but ultimately fails to provide a good balance of reliability, performance and cost.

* Web Dev
** angularjs
*** angularjs blig  http://codingsmackdown.tv/blog/tag/angularjs/
http://codingsmackdown.tv/blog/2013/04/29/hailing-all-frequencies-communicating-in-angularjs-with-the-pubsub-design-pattern/
** Static sites are fast, secure, easy to deploy, and manageable using version control http://jaspervdj.be/hakyll/
** REST in practice http://de.slideshare.net/guilhermecaelum/rest-in-practice
** html
*** The Story of the Teapot in DHTML http://queue.acm.org/detail.cfm?id=2436698
*** native HTML dropdowm http://css.dzone.com/articles/making-html-dropdowns-not-suck
** css
*** Animation of How CSS Triangles Work http://css-tricks.com/animation-css-triangles-work/
*** Absolute Horizontal And Vertical Centering In CSS By Stephen Shaw http://coding.smashingmagazine.com/2013/08/09/absolute-horizontal-vertical-centering-css/
*** color brewer http://bl.ocks.org/mbostock/5577023
*** css with less for a better HTML / CSS dev http://www.lispcast.com/cascading-separation-abstraction
*** 22 css frameworks http://designshack.net/articles/css/which-is-right-for-me-22-responsive-css-frameworks-and-boilerplates-explained/
