toread.html

<div id="outline-container-7-7" class="outline-3">
<h3 id="sec-7-7">Read-only Guest tmux Sessions <a href="http://brianmckenna.org/blog/guest_tmux">http://brianmckenna.org/blog/guest_tmux</a></h3>
<div class="outline-text-3" id="text-7-7">

</div>

</div>

<div id="outline-container-7-8" class="outline-3">
<h3 id="sec-7-8">cli for monitoring <a href="http://net.tutsplus.com/tutorials/15-command-line-tools-for-monitoring-linux-systems/">http://net.tutsplus.com/tutorials/15-command-line-tools-for-monitoring-linux-systems/</a></h3>
<div class="outline-text-3" id="text-7-8">

</div>

</div>

<div id="outline-container-7-9" class="outline-3">
<h3 id="sec-7-9">Latex on the moon <a href="https://www.writelatex.com/">https://www.writelatex.com/</a> <a href="https://www.sharelatex.com/">https://www.sharelatex.com/</a> <a href="http://jasalguero.com/ledld/general/latex-on-the-cloud/http://www.cstr.ed.ac.uk/projects/festival/">http://jasalguero.com/ledld/general/latex-on-the-cloud/http://www.cstr.ed.ac.uk/projects/festival/</a></h3>
<div class="outline-text-3" id="text-7-9">

</div>

</div>

<div id="outline-container-7-10" class="outline-3">
<h3 id="sec-7-10">TextToSpeech <a href="https://help.ubuntu.com/community/TextToSpeech">https://help.ubuntu.com/community/TextToSpeech</a></h3>
<div class="outline-text-3" id="text-7-10">

</div>

</div>

<div id="outline-container-7-11" class="outline-3">
<h3 id="sec-7-11">Festival TextToSpeech  <a href="http://www.cstr.ed.ac.uk/projects/festival/">http://www.cstr.ed.ac.uk/projects/festival/</a></h3>
<div class="outline-text-3" id="text-7-11">

</div>

</div>

<div id="outline-container-7-12" class="outline-3">
<h3 id="sec-7-12">FEstival To build own voice <a href="http://festvox.org/">http://festvox.org/</a></h3>
<div class="outline-text-3" id="text-7-12">

</div>

</div>

<div id="outline-container-7-13" class="outline-3">
<h3 id="sec-7-13">Festival TTS for polish <a href="http://nshmyrev.blogspot.fr/2009/08/release-of-polish-voice-for-festival.html">http://nshmyrev.blogspot.fr/2009/08/release-of-polish-voice-for-festival.html</a></h3>
<div class="outline-text-3" id="text-7-13">

</div>

</div>

<div id="outline-container-7-14" class="outline-3">
<h3 id="sec-7-14"><a href="http://www.thegeekstuff.com/tag/sed-tips-and-tricks/">http://www.thegeekstuff.com/tag/sed-tips-and-tricks/</a></h3>
<div class="outline-text-3" id="text-7-14">

</div>

</div>

<div id="outline-container-7-15" class="outline-3">
<h3 id="sec-7-15">find <a href="http://www.eriwen.com/productivity/find-is-a-beautiful-tool/">http://www.eriwen.com/productivity/find-is-a-beautiful-tool/</a></h3>
<div class="outline-text-3" id="text-7-15">

</div>

</div>

<div id="outline-container-7-16" class="outline-3">
<h3 id="sec-7-16">xmonad explained <a href="http://www.youtube.com/watch?v=63MpfyZUcrU">http://www.youtube.com/watch?v=63MpfyZUcrU</a></h3>
<div class="outline-text-3" id="text-7-16">

</div>

</div>

<div id="outline-container-7-17" class="outline-3">
<h3 id="sec-7-17">book on zsh <a href="http://www.bash2zsh.com/">http://www.bash2zsh.com/</a></h3>
<div class="outline-text-3" id="text-7-17">

</div>

</div>

<div id="outline-container-7-18" class="outline-3">
<h3 id="sec-7-18"><a href="http://everythingsysadmin.com/2012/09/unorthodoxunix.html">http://everythingsysadmin.com/2012/09/unorthodoxunix.html</a></h3>
<div class="outline-text-3" id="text-7-18">

<ul>
<li>grep . *.txt
</li>
<li>more * | cat
</li>
<li>"fmt -1" (split lines into individual words)
</li>
<li>gnt-job list | egrep &ndash;color=always 'running|waiting'
</li>
</ul>

</div>

</div>

<div id="outline-container-7-19" class="outline-3">
<h3 id="sec-7-19">linux performance <a href="http://insidehpc.com/2013/03/02/video-brendan-gregg-presents-on-linux-performance-analysis-and-tools/">http://insidehpc.com/2013/03/02/video-brendan-gregg-presents-on-linux-performance-analysis-and-tools/</a></h3>
<div class="outline-text-3" id="text-7-19">

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">networks</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1">Source Multiplayer Networking for multi-players games <a href="https://developer.valvesoftware.com/wiki/Source_Multiplayer_Networking">https://developer.valvesoftware.com/wiki/Source_Multiplayer_Networking</a></h3>
<div class="outline-text-3" id="text-8-1">

</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2">IRC commands <a href="http://www.ircbeginner.com/ircinfo/ircc-commands.html">http://www.ircbeginner.com/ircinfo/ircc-commands.html</a> connect ot IRC <a href="http://irc.lc/freenode/">http://irc.lc/freenode/</a></h3>
<div class="outline-text-3" id="text-8-2">

</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3">Programming Distributed Computing Systems A Foundational Approach By Carlos A. Varela <a href="https://mitpress.mit.edu/books/programming-distributed-computing-systems">https://mitpress.mit.edu/books/programming-distributed-computing-systems</a></h3>
<div class="outline-text-3" id="text-8-3">

</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4">localize IP address <a href="http://www.maxmind.com/en/news_localizaton">http://www.maxmind.com/en/news_localizaton</a></h3>
<div class="outline-text-3" id="text-8-4">

</div>

</div>

<div id="outline-container-8-5" class="outline-3">
<h3 id="sec-8-5">network neutrality <a href="http://neubot.org/">http://neubot.org/</a> <a href="http://en.wikipedia.org/wiki/Neubot">http://en.wikipedia.org/wiki/Neubot</a> <a href="http://data.neubot.org/">http://data.neubot.org/</a> <a href="http://www.measurementlab.net/fr">http://www.measurementlab.net/fr</a></h3>
<div class="outline-text-3" id="text-8-5">

</div>

</div>

<div id="outline-container-8-6" class="outline-3">
<h3 id="sec-8-6">The network is reliable by aphyr <a href="http://aphyr.com/posts/288-the-network-is-reliable">http://aphyr.com/posts/288-the-network-is-reliable</a></h3>
<div class="outline-text-3" id="text-8-6">

</div>

</div>

<div id="outline-container-8-7" class="outline-3">
<h3 id="sec-8-7">RICON East 2013 review <a href="https://gist.github.com/hectcastro/186e567830fe131a1ef1">https://gist.github.com/hectcastro/186e567830fe131a1ef1</a></h3>
<div class="outline-text-3" id="text-8-7">

</div>

</div>

<div id="outline-container-8-8" class="outline-3">
<h3 id="sec-8-8">safety liveness <a href="http://www.bailis.org/blog/safety-and-liveness-eventual-consistency-is-not-safe/">http://www.bailis.org/blog/safety-and-liveness-eventual-consistency-is-not-safe/</a></h3>
<div class="outline-text-3" id="text-8-8">

</div>

</div>

<div id="outline-container-8-9" class="outline-3">
<h3 id="sec-8-9"><a href="http://www.cubrid.org/blog/dev-platform/understanding-tcp-ip-network-stack/">http://www.cubrid.org/blog/dev-platform/understanding-tcp-ip-network-stack/</a></h3>
<div class="outline-text-3" id="text-8-9">

</div>

</div>

<div id="outline-container-8-10" class="outline-3">
<h3 id="sec-8-10">protobuff faster <a href="http://kentonv.github.com/capnproto/">http://kentonv.github.com/capnproto/</a></h3>
<div class="outline-text-3" id="text-8-10">

</div>

</div>

<div id="outline-container-8-11" class="outline-3">
<h3 id="sec-8-11">network partition <a href="http://damienkatz.net/2013/05/dynamo_sure_works_hard.html">http://damienkatz.net/2013/05/dynamo_sure_works_hard.html</a></h3>
<div class="outline-text-3" id="text-8-11">

<p> Amazon Dynamo Paper. It has some very interesting concepts, but ultimately fails to provide a good balance of reliability, performance and cost.
</p></div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">animation</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1">dessin animé <a href="http://www.youtube.com/watch?feature=player_embedded&amp;v=yJZx99-lSnc">http://www.youtube.com/watch?feature=player_embedded&amp;v=yJZx99-lSnc</a> how to do it ?</h3>
<div class="outline-text-3" id="text-9-1">

</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2">codelife - glsl live-coding editor test #5 <a href="http://vimeo.com/51993089">http://vimeo.com/51993089</a></h3>
<div class="outline-text-3" id="text-9-2">

</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><a href="https://www.shadertoy.com/view/lsl3zr">https://www.shadertoy.com/view/lsl3zr</a></h3>
<div class="outline-text-3" id="text-9-3">

</div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4"><a href="http://www.hakantuzunsengun.com/index.php/work/doubt-is-better/">http://www.hakantuzunsengun.com/index.php/work/doubt-is-better/</a></h3>
<div class="outline-text-3" id="text-9-4">

</div>

</div>

<div id="outline-container-9-5" class="outline-3">
<h3 id="sec-9-5">minimum games maximum fun <a href="http://www.java4k.com/index.php?action=home">http://www.java4k.com/index.php?action=home</a></h3>
<div class="outline-text-3" id="text-9-5">

</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">Web Dev</h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10-1" class="outline-3">
<h3 id="sec-10-1">Static sites are fast, secure, easy to deploy, and manageable using version control <a href="http://jaspervdj.be/hakyll/">http://jaspervdj.be/hakyll/</a></h3>
<div class="outline-text-3" id="text-10-1">

</div>

</div>

<div id="outline-container-10-2" class="outline-3">
<h3 id="sec-10-2">REST in practice <a href="http://de.slideshare.net/guilhermecaelum/rest-in-practice">http://de.slideshare.net/guilhermecaelum/rest-in-practice</a></h3>
<div class="outline-text-3" id="text-10-2">

</div>

</div>

<div id="outline-container-10-3" class="outline-3">
<h3 id="sec-10-3">html</h3>
<div class="outline-text-3" id="text-10-3">


</div>

<div id="outline-container-10-3-1" class="outline-4">
<h4 id="sec-10-3-1">The Story of the Teapot in DHTML <a href="http://queue.acm.org/detail.cfm?id=2436698">http://queue.acm.org/detail.cfm?id=2436698</a></h4>
<div class="outline-text-4" id="text-10-3-1">

</div>

</div>

<div id="outline-container-10-3-2" class="outline-4">
<h4 id="sec-10-3-2">native HTML dropdowm <a href="http://css.dzone.com/articles/making-html-dropdowns-not-suck">http://css.dzone.com/articles/making-html-dropdowns-not-suck</a></h4>
<div class="outline-text-4" id="text-10-3-2">

</div>
</div>

</div>

<div id="outline-container-10-4" class="outline-3">
<h3 id="sec-10-4">css</h3>
<div class="outline-text-3" id="text-10-4">


</div>

<div id="outline-container-10-4-1" class="outline-4">
<h4 id="sec-10-4-1">Animation of How CSS Triangles Work <a href="http://css-tricks.com/animation-css-triangles-work/">http://css-tricks.com/animation-css-triangles-work/</a></h4>
<div class="outline-text-4" id="text-10-4-1">

</div>

</div>

<div id="outline-container-10-4-2" class="outline-4">
<h4 id="sec-10-4-2">Absolute Horizontal And Vertical Centering In CSS By Stephen Shaw <a href="http://coding.smashingmagazine.com/2013/08/09/absolute-horizontal-vertical-centering-css/">http://coding.smashingmagazine.com/2013/08/09/absolute-horizontal-vertical-centering-css/</a></h4>
<div class="outline-text-4" id="text-10-4-2">

</div>

</div>

<div id="outline-container-10-4-3" class="outline-4">
<h4 id="sec-10-4-3">color brewer <a href="http://bl.ocks.org/mbostock/5577023">http://bl.ocks.org/mbostock/5577023</a></h4>
<div class="outline-text-4" id="text-10-4-3">

</div>

</div>

<div id="outline-container-10-4-4" class="outline-4">
<h4 id="sec-10-4-4">css with less for a better HTML / CSS dev <a href="http://www.lispcast.com/cascading-separation-abstraction">http://www.lispcast.com/cascading-separation-abstraction</a></h4>
<div class="outline-text-4" id="text-10-4-4">

</div>

</div>

<div id="outline-container-10-4-5" class="outline-4">
<h4 id="sec-10-4-5">22 css frameworks <a href="http://designshack.net/articles/css/which-is-right-for-me-22-responsive-css-frameworks-and-boilerplates-explained/">http://designshack.net/articles/css/which-is-right-for-me-22-responsive-css-frameworks-and-boilerplates-explained/</a></h4>
<div class="outline-text-4" id="text-10-4-5">

</div>
</div>

</div>
