toread.org
** Landing Page Design http://blog.hubspot.com/principles-of-conversion-centered-landing-page-design
** Extending REST APIs with API Aggregator http://3scale.github.io/2013/04/18/accelerate-your-mobile-api-with-nginx-and-lua/
** check elm-lang presentation
** erlang web framework : ezwebframe
** aloha https://github.com/ztellman/aloha webserver on top of netty
** benchmarks on async http server https://github.com/ptaoussanis/clojure-web-server-benchmarks
** https://github.com/shenfeng/http-kit clj web server used by http://rssminer.net/
** https://github.com/shenfeng/async-ring-adapter on top of Netty
** check https://github.com/xavi/noir-auth-app for authtentification https://groups.google.com/forum/?fromgroups=#!topic/enlive-clj/mR8rnmCi5_Y
** REST guidance http://blog.mugunthkumar.com/articles/restful-api-server-doing-it-the-right-way-part-1/
** http://www.smashingmagazine.com/2012/12/22/talks-to-help-you-become-a-better-front-end-engineer-in-2013
** slides in HMTL5 http://www.htmlfivewow.com/
** Reactive Demand Programming (RDP) http://awelonblue.wordpress.com/2012/10/21/local-state-is-poison/ https://github.com/dmbarbour/Sirea
** complete web site example clojars https://github.com/ato/clojars-web
** web deploy with jetty + lein https://groups.google.com/forum/?fromgroups=#!topic/clojure/lNvdKzbhPDY
** friend + openid https://groups.google.com/forum/?fromgroups=#!topic/clojure/g35bhIpQ3ME
** friend screencast http://www.clojurewebdevelopment.com/videos/friend-interactive-form
** web reload https://groups.google.com/forum/?fromgroups=#!topic/clojure/WlSMwIQ_yHU
** page landing http://en.wikipedia.org/wiki/Landing_page
** headless web testing with Gecko https://github.com/laurentj/slimerjs
* search
** https://github.com/sonian/elasticsearch-jetty
** distributed programming
*** strong eventual consistency http://pagesperso-systeme.lip6.fr/Marc.Shapiro/pubs.html
*** Call me maybe Series by Aphyr : zookeeper kafka cassandra nuaDB http://aphyr.com/posts/291-call-me-maybe-zookeeper
*** Distributed systems in GO http://da-data.blogspot.ch/2013/02/teaching-distributed-systems-in-go.html

* programming
** Learn [clojure|elixir|go|haskell|...] in Y minutes http://learnxinyminutes.com/
** Type System
*** Moand Transformers http://functionaltalks.org/2013/10/27/tony-morris-monad-transformers/
*** clj core.type / haskell http://adambard.com/blog/core-typed-vs-haskell/
*** static typing http://scientopia.org/blogs/goodmath/2013/01/20/static-typing-give-me-a-break/ http://brehaut.net/blog/2013/static_types
** Free books on Computer Science by  @okalotieno http://hackershelf.com/browse/
** The Original 'Lambda Papers' by Guy Steele and Gerald Sussman http://library.readscheme.org/page1.html
** The Anti-Human Consequences of Static Typing by  Jay McCarthy http://jeapostrophe.github.io/2013-08-12-types-post.html
** Teach Yourself Programming in Ten Years http://norvig.com/21-days.html
** Python compared to Ocaml Haskell http://roscidus.com/blog/blog/2013/06/20/replacing-python-round-2/
** Name your arguments by Jamie Wong http://jamie-wong.com/2011/11/28/name-your-arguments/
** Learnable Programming : Designing a programming system for understanding programsBret Victor http://worrydream.com/LearnableProgramming/
** Part of a series exploring  Concepts, Techniques, and Models of Computer Programming. http://michaelrbernste.in/2013/06/20/what-is-declarative-programming.html
** The Definitive Reference To Why Maybe Is Better Than Null (error handling) http://nickknowlson.com/blog/2013/04/16/why-maybe-is-better-than-null/
** Scala vs. Haskell vs. Python http://blog.samibadawi.com/2013/02/scala-vs-haskell-vs-python.html
** Bertrand Meyer's blog http://bertrandmeyer.com/
** What does FP mean http://dl.dropboxusercontent.com/u/7810909/docs/what-does-fp-mean/what-does-fp-mean/html/index.html
** fundamentals of OO coding http://blog.learnstreet.com/fundamentals-of-coding/
** tern : editor-independent static analysis engine in javascript http://ternjs.net/ http://marijnhaverbeke.nl/blog/tern.html
