toread.html

<div id="outline-container-10-5" class="outline-3">
<h3 id="sec-10-5">Landing Page Design <a href="http://blog.hubspot.com/principles-of-conversion-centered-landing-page-design">http://blog.hubspot.com/principles-of-conversion-centered-landing-page-design</a></h3>
<div class="outline-text-3" id="text-10-5">

</div>

</div>

<div id="outline-container-10-6" class="outline-3">
<h3 id="sec-10-6">Extending REST APIs with API Aggregator <a href="http://3scale.github.io/2013/04/18/accelerate-your-mobile-api-with-nginx-and-lua/">http://3scale.github.io/2013/04/18/accelerate-your-mobile-api-with-nginx-and-lua/</a></h3>
<div class="outline-text-3" id="text-10-6">

</div>

</div>

<div id="outline-container-10-7" class="outline-3">
<h3 id="sec-10-7">check elm-lang presentation</h3>
<div class="outline-text-3" id="text-10-7">

</div>

</div>

<div id="outline-container-10-8" class="outline-3">
<h3 id="sec-10-8">erlang web framework : ezwebframe</h3>
<div class="outline-text-3" id="text-10-8">

</div>

</div>

<div id="outline-container-10-9" class="outline-3">
<h3 id="sec-10-9">aloha <a href="https://github.com/ztellman/aloha">https://github.com/ztellman/aloha</a> webserver on top of netty</h3>
<div class="outline-text-3" id="text-10-9">

</div>

</div>

<div id="outline-container-10-10" class="outline-3">
<h3 id="sec-10-10">benchmarks on async http server <a href="https://github.com/ptaoussanis/clojure-web-server-benchmarks">https://github.com/ptaoussanis/clojure-web-server-benchmarks</a></h3>
<div class="outline-text-3" id="text-10-10">

</div>

</div>

<div id="outline-container-10-11" class="outline-3">
<h3 id="sec-10-11"><a href="https://github.com/shenfeng/http-kit">https://github.com/shenfeng/http-kit</a> clj web server used by <a href="http://rssminer.net/">http://rssminer.net/</a></h3>
<div class="outline-text-3" id="text-10-11">

</div>

</div>

<div id="outline-container-10-12" class="outline-3">
<h3 id="sec-10-12"><a href="https://github.com/shenfeng/async-ring-adapter">https://github.com/shenfeng/async-ring-adapter</a> on top of Netty</h3>
<div class="outline-text-3" id="text-10-12">

</div>

</div>

<div id="outline-container-10-13" class="outline-3">
<h3 id="sec-10-13">check <a href="https://github.com/xavi/noir-auth-app">https://github.com/xavi/noir-auth-app</a> for authtentification <a href="https://groups.google.com/forum/?fromgroups=#!topic/enlive-clj/mR8rnmCi5_Y">https://groups.google.com/forum/?fromgroups=#!topic/enlive-clj/mR8rnmCi5_Y</a></h3>
<div class="outline-text-3" id="text-10-13">

</div>

</div>

<div id="outline-container-10-14" class="outline-3">
<h3 id="sec-10-14">REST guidance <a href="http://blog.mugunthkumar.com/articles/restful-api-server-doing-it-the-right-way-part-1/">http://blog.mugunthkumar.com/articles/restful-api-server-doing-it-the-right-way-part-1/</a></h3>
<div class="outline-text-3" id="text-10-14">

</div>

</div>

<div id="outline-container-10-15" class="outline-3">
<h3 id="sec-10-15"><a href="http://www.smashingmagazine.com/2012/12/22/talks-to-help-you-become-a-better-front-end-engineer-in-2013">http://www.smashingmagazine.com/2012/12/22/talks-to-help-you-become-a-better-front-end-engineer-in-2013</a></h3>
<div class="outline-text-3" id="text-10-15">

</div>

</div>

<div id="outline-container-10-16" class="outline-3">
<h3 id="sec-10-16">slides in HMTL5 <a href="http://www.htmlfivewow.com/">http://www.htmlfivewow.com/</a></h3>
<div class="outline-text-3" id="text-10-16">

</div>

</div>

<div id="outline-container-10-17" class="outline-3">
<h3 id="sec-10-17">Reactive Demand Programming (RDP) <a href="http://awelonblue.wordpress.com/2012/10/21/local-state-is-poison/">http://awelonblue.wordpress.com/2012/10/21/local-state-is-poison/</a> <a href="https://github.com/dmbarbour/Sirea">https://github.com/dmbarbour/Sirea</a></h3>
<div class="outline-text-3" id="text-10-17">

</div>

</div>

<div id="outline-container-10-18" class="outline-3">
<h3 id="sec-10-18">complete web site example clojars <a href="https://github.com/ato/clojars-web">https://github.com/ato/clojars-web</a></h3>
<div class="outline-text-3" id="text-10-18">

</div>

</div>

<div id="outline-container-10-19" class="outline-3">
<h3 id="sec-10-19">web deploy with jetty + lein <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/lNvdKzbhPDY">https://groups.google.com/forum/?fromgroups=#!topic/clojure/lNvdKzbhPDY</a></h3>
<div class="outline-text-3" id="text-10-19">

</div>

</div>

<div id="outline-container-10-20" class="outline-3">
<h3 id="sec-10-20">friend + openid <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/g35bhIpQ3ME">https://groups.google.com/forum/?fromgroups=#!topic/clojure/g35bhIpQ3ME</a></h3>
<div class="outline-text-3" id="text-10-20">

</div>

</div>

<div id="outline-container-10-21" class="outline-3">
<h3 id="sec-10-21">friend screencast <a href="http://www.clojurewebdevelopment.com/videos/friend-interactive-form">http://www.clojurewebdevelopment.com/videos/friend-interactive-form</a></h3>
<div class="outline-text-3" id="text-10-21">

</div>

</div>

<div id="outline-container-10-22" class="outline-3">
<h3 id="sec-10-22">web reload <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/WlSMwIQ_yHU">https://groups.google.com/forum/?fromgroups=#!topic/clojure/WlSMwIQ_yHU</a></h3>
<div class="outline-text-3" id="text-10-22">

</div>

</div>

<div id="outline-container-10-23" class="outline-3">
<h3 id="sec-10-23">page landing <a href="http://en.wikipedia.org/wiki/Landing_page">http://en.wikipedia.org/wiki/Landing_page</a></h3>
<div class="outline-text-3" id="text-10-23">

</div>

</div>

<div id="outline-container-10-24" class="outline-3">
<h3 id="sec-10-24">headless web testing with Gecko <a href="https://github.com/laurentj/slimerjs">https://github.com/laurentj/slimerjs</a></h3>
<div class="outline-text-3" id="text-10-24">

</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">search</h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1"><a href="https://github.com/sonian/elasticsearch-jetty">https://github.com/sonian/elasticsearch-jetty</a></h3>
<div class="outline-text-3" id="text-11-1">

</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2">distributed programming</h3>
<div class="outline-text-3" id="text-11-2">


</div>

<div id="outline-container-11-2-1" class="outline-4">
<h4 id="sec-11-2-1">strong eventual consistency <a href="http://pagesperso-systeme.lip6.fr/Marc.Shapiro/pubs.html">http://pagesperso-systeme.lip6.fr/Marc.Shapiro/pubs.html</a></h4>
<div class="outline-text-4" id="text-11-2-1">

</div>

</div>

<div id="outline-container-11-2-2" class="outline-4">
<h4 id="sec-11-2-2">Call me maybe Series by Aphyr : zookeeper kafka cassandra nuaDB <a href="http://aphyr.com/posts/291-call-me-maybe-zookeeper">http://aphyr.com/posts/291-call-me-maybe-zookeeper</a></h4>
<div class="outline-text-4" id="text-11-2-2">

</div>

</div>

<div id="outline-container-11-2-3" class="outline-4">
<h4 id="sec-11-2-3">Distributed systems in GO <a href="http://da-data.blogspot.ch/2013/02/teaching-distributed-systems-in-go.html">http://da-data.blogspot.ch/2013/02/teaching-distributed-systems-in-go.html</a></h4>
<div class="outline-text-4" id="text-11-2-3">


</div>
</div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">programming</h2>
<div class="outline-text-2" id="text-12">


</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1">Free books on Computer Science by  @okalotieno <a href="http://hackershelf.com/browse/">http://hackershelf.com/browse/</a></h3>
<div class="outline-text-3" id="text-12-1">

</div>

</div>

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2">The Original 'Lambda Papers' by Guy Steele and Gerald Sussman <a href="http://library.readscheme.org/page1.html">http://library.readscheme.org/page1.html</a></h3>
<div class="outline-text-3" id="text-12-2">

</div>

</div>

<div id="outline-container-12-3" class="outline-3">
<h3 id="sec-12-3">The Anti-Human Consequences of Static Typing by  Jay McCarthy <a href="http://jeapostrophe.github.io/2013-08-12-types-post.html">http://jeapostrophe.github.io/2013-08-12-types-post.html</a></h3>
<div class="outline-text-3" id="text-12-3">

</div>

</div>

<div id="outline-container-12-4" class="outline-3">
<h3 id="sec-12-4">Teach Yourself Programming in Ten Years <a href="http://norvig.com/21-days.html">http://norvig.com/21-days.html</a></h3>
<div class="outline-text-3" id="text-12-4">

</div>

</div>

<div id="outline-container-12-5" class="outline-3">
<h3 id="sec-12-5">Python compared to Ocaml Haskell <a href="http://roscidus.com/blog/blog/2013/06/20/replacing-python-round-2/">http://roscidus.com/blog/blog/2013/06/20/replacing-python-round-2/</a></h3>
<div class="outline-text-3" id="text-12-5">

</div>

</div>

<div id="outline-container-12-6" class="outline-3">
<h3 id="sec-12-6">Name your arguments by Jamie Wong <a href="http://jamie-wong.com/2011/11/28/name-your-arguments/">http://jamie-wong.com/2011/11/28/name-your-arguments/</a></h3>
<div class="outline-text-3" id="text-12-6">

</div>

</div>

<div id="outline-container-12-7" class="outline-3">
<h3 id="sec-12-7">Learnable Programming : Designing a programming system for understanding programsBret Victor <a href="http://worrydream.com/LearnableProgramming/">http://worrydream.com/LearnableProgramming/</a></h3>
<div class="outline-text-3" id="text-12-7">

</div>

</div>

<div id="outline-container-12-8" class="outline-3">
<h3 id="sec-12-8">Part of a series exploring  Concepts, Techniques, and Models of Computer Programming. <a href="http://michaelrbernste.in/2013/06/20/what-is-declarative-programming.html">http://michaelrbernste.in/2013/06/20/what-is-declarative-programming.html</a></h3>
<div class="outline-text-3" id="text-12-8">

</div>

</div>

<div id="outline-container-12-9" class="outline-3">
<h3 id="sec-12-9">The Definitive Reference To Why Maybe Is Better Than Null (error handling) <a href="http://nickknowlson.com/blog/2013/04/16/why-maybe-is-better-than-null/">http://nickknowlson.com/blog/2013/04/16/why-maybe-is-better-than-null/</a></h3>
<div class="outline-text-3" id="text-12-9">

</div>

</div>

<div id="outline-container-12-10" class="outline-3">
<h3 id="sec-12-10">Scala vs. Haskell vs. Python <a href="http://blog.samibadawi.com/2013/02/scala-vs-haskell-vs-python.html">http://blog.samibadawi.com/2013/02/scala-vs-haskell-vs-python.html</a></h3>
<div class="outline-text-3" id="text-12-10">

</div>

</div>

<div id="outline-container-12-11" class="outline-3">
<h3 id="sec-12-11">Bertrand Meyer's blog <a href="http://bertrandmeyer.com/">http://bertrandmeyer.com/</a></h3>
<div class="outline-text-3" id="text-12-11">

</div>

</div>

<div id="outline-container-12-12" class="outline-3">
<h3 id="sec-12-12">What does FP mean <a href="http://dl.dropboxusercontent.com/u/7810909/docs/what-does-fp-mean/what-does-fp-mean/html/index.html">http://dl.dropboxusercontent.com/u/7810909/docs/what-does-fp-mean/what-does-fp-mean/html/index.html</a></h3>
<div class="outline-text-3" id="text-12-12">

</div>

</div>

<div id="outline-container-12-13" class="outline-3">
<h3 id="sec-12-13">fundamentals of OO coding <a href="http://blog.learnstreet.com/fundamentals-of-coding/">http://blog.learnstreet.com/fundamentals-of-coding/</a></h3>
<div class="outline-text-3" id="text-12-13">

</div>

</div>

<div id="outline-container-12-14" class="outline-3">
<h3 id="sec-12-14">tern : editor-independent static analysis engine in javascript <a href="http://ternjs.net/">http://ternjs.net/</a> <a href="http://marijnhaverbeke.nl/blog/tern.html">http://marijnhaverbeke.nl/blog/tern.html</a></h3>
<div class="outline-text-3" id="text-12-14">

</div>

</div>
