toread.org
** VM optimizations http://blog.headius.com/2013/05/on-languages-vms-optimization-and-way.html
** Go and Rust — objects without class http://lwn.net/Articles/548560/
** Bloom language http://www.bloom-lang.net/ Testing distributed systems by Neil Conway
Design patterns -> theorems -> Language & tool support
"When I see patterns in my programs, I consider it a sign of
trouble... a sign that I'm not using abstractions that aren't enough powerful" Paul Graham
Consistency As Logical Monotinicity 
** Brian McKenna blog http://brianmckenna.org/blog/
** Building a Lisp to Javascript compiler http://honza.ca/2013/05/building-a-lisp-to-javascript-compiler
** Turing complete http://en.wikipedia.org/wiki/Turing_completeness
The notion of Turing-completeness does not apply to languages such as
XML, JSON, YAML and S-expressions, because they are typically used to
represent structured data, not describe computation. 
** The fruits of misunderstanding by prof.dr.Edsger W.Dijkstra http://www.cs.utexas.edu/~EWD/transcriptions/EWD08xx/EWD854.html
How anthropomorphism and analogies make concepts in computer programming harder to understand:
** My growing Lisp book collection @reddit http://www.reddit.com/r/lisp/comments/1d4zv6/my_growing_lisp_book_collection/
** http://stackoverflow.com/questions/432922/significant-new-inventions-in-computing-since-1980
** http://en.wikipedia.org/wiki/Computational_geometry
** http://scientopia.org/blogs/goodmath/2013/01/20/static-typing-give-me-a-break/
** A Glimpse of the Future of Scientific Programming http://bit.ly/15yeIjw
http://www.computer.org/portal/web/computingnow/content?g=53319&type=article&urlTitle=a-glimpse-of-the-future-of-scientific-programming&lf1=267408692c637116407312f6779968
**  http://cstheory.stackexchange.com/questions/1168/what-papers-should-everyone-read
** monads in OO http://ericlippert.com/2013/02/25/monads-part-two/
** blog http://eng.42go.com/
 http://eng.42go.com/pattern-matching-in-scala/
http://eng.42go.com/a-simple-time-decaying-approximate-membership-filter/
** density succinct http://blog.josephwilk.net/software-craftmanship/the-aesthetics-of-density.html
** style guide https://google-styleguide.googlecode.com/svn/trunk/ watch Norvig videos http://www.lispcast.com/google-common-lisp-style-guide
** http://www.infoq.com/interviews/erik-meijer-programming-language-design-effects-purity
   Erlang has very cheap threads now you can use concurrency as a control structure  very close to object oriented programming and dynamic dispatch.
   what the Reactive framework is, it’s just the continuation monad ...  it is the observer observable is the dual of enumerable enumerator
** concatenative (applicative) programming http://blog.fogus.me/2013/01/06/pesto5-a-concatenative-programming-library-in-5-lines-of-clojure/
** interview of Alan Kay http://www.drdobbs.com/architecture-and-design/interview-with-alan-kay/240003442
** shen language in clojure https://github.com/hraberg/shen.clj http://www.shenlanguage.org/learn-shen/tutorials/shen_in_15mins.html#shen-in-15mins
** Joe Armstrong on languages http://www.codewiz51.com/blog/post/2013/01/24/Post-from-John-Armstrong-inventor-of-Erlang.aspx
What would I recommend learning?

    - C
    - Prolog
    - Erlang (I'm biased)
    - Smalltalk
    - Javascript
    - Hakell / ML /OCaml
    - LISP/Scheme/Clojure

A couple of years should be enough (PER LANGUAGE).

Notice there is no quick fix here - if you want a quick fix go buy "learn
PHP in ten minutes"
and spend the next twenty years googling for "how do I compute the length
of a string"

The crazy think is we still are extremely bad at fitting things together -
still the best
way of fitting things together is the unix pipe

    find ... | grep | uniq | sort | ...

and the *fundamental* reason for this is that components should be separated
by well-defined protocols in a universal intermediate language.

Fitting things together by message passing is the way to go - this is basis
of
OO programming - but done badly in most programming languages.

If ALL applications in the world were interfaced by (say) sockets + lisp S
expressions
and had the semantics of the protocol written down in a formal notation -
then we could
reuse things (more) easily.

Today there is an unhealthy concentration on language and efficiency and
NOT on how things fit together and protocols - teach protocols and not
languages.

And teach ALGORITHMS.
