toread.html

<div id="outline-container-12-15" class="outline-3">
<h3 id="sec-12-15">VM optimizations <a href="http://blog.headius.com/2013/05/on-languages-vms-optimization-and-way.html">http://blog.headius.com/2013/05/on-languages-vms-optimization-and-way.html</a></h3>
<div class="outline-text-3" id="text-12-15">

</div>

</div>

<div id="outline-container-12-16" class="outline-3">
<h3 id="sec-12-16">Go and Rust — objects without class <a href="http://lwn.net/Articles/548560/">http://lwn.net/Articles/548560/</a></h3>
<div class="outline-text-3" id="text-12-16">

</div>

</div>

<div id="outline-container-12-17" class="outline-3">
<h3 id="sec-12-17">Bloom language <a href="http://www.bloom-lang.net/">http://www.bloom-lang.net/</a> Testing distributed systems by Neil Conway</h3>
<div class="outline-text-3" id="text-12-17">

<p>Design patterns -&gt; theorems -&gt; Language &amp; tool support
"When I see patterns in my programs, I consider it a sign of
trouble&hellip; a sign that I'm not using abstractions that aren't enough powerful" Paul Graham
Consistency As Logical Monotinicity 
</p></div>

</div>

<div id="outline-container-12-18" class="outline-3">
<h3 id="sec-12-18">Brian McKenna blog <a href="http://brianmckenna.org/blog/">http://brianmckenna.org/blog/</a></h3>
<div class="outline-text-3" id="text-12-18">

</div>

</div>

<div id="outline-container-12-19" class="outline-3">
<h3 id="sec-12-19">Building a Lisp to Javascript compiler <a href="http://honza.ca/2013/05/building-a-lisp-to-javascript-compiler">http://honza.ca/2013/05/building-a-lisp-to-javascript-compiler</a></h3>
<div class="outline-text-3" id="text-12-19">

</div>

</div>

<div id="outline-container-12-20" class="outline-3">
<h3 id="sec-12-20">Turing complete <a href="http://en.wikipedia.org/wiki/Turing_completeness">http://en.wikipedia.org/wiki/Turing_completeness</a></h3>
<div class="outline-text-3" id="text-12-20">

<p>The notion of Turing-completeness does not apply to languages such as
XML, JSON, YAML and S-expressions, because they are typically used to
represent structured data, not describe computation. 
</p></div>

</div>

<div id="outline-container-12-21" class="outline-3">
<h3 id="sec-12-21">static typing <a href="http://scientopia.org/blogs/goodmath/2013/01/20/static-typing-give-me-a-break/">http://scientopia.org/blogs/goodmath/2013/01/20/static-typing-give-me-a-break/</a> <a href="http://brehaut.net/blog/2013/static_types">http://brehaut.net/blog/2013/static_types</a></h3>
<div class="outline-text-3" id="text-12-21">

</div>

</div>

<div id="outline-container-12-22" class="outline-3">
<h3 id="sec-12-22">The fruits of misunderstanding by prof.dr.Edsger W.Dijkstra <a href="http://www.cs.utexas.edu/~EWD/transcriptions/EWD08xx/EWD854.html">http://www.cs.utexas.edu/~EWD/transcriptions/EWD08xx/EWD854.html</a></h3>
<div class="outline-text-3" id="text-12-22">

<p>How anthropomorphism and analogies make concepts in computer programming harder to understand:
</p></div>

</div>

<div id="outline-container-12-23" class="outline-3">
<h3 id="sec-12-23">My growing Lisp book collection @reddit <a href="http://www.reddit.com/r/lisp/comments/1d4zv6/my_growing_lisp_book_collection/">http://www.reddit.com/r/lisp/comments/1d4zv6/my_growing_lisp_book_collection/</a></h3>
<div class="outline-text-3" id="text-12-23">

</div>

</div>

<div id="outline-container-12-24" class="outline-3">
<h3 id="sec-12-24"><a href="http://stackoverflow.com/questions/432922/significant-new-inventions-in-computing-since-1980">http://stackoverflow.com/questions/432922/significant-new-inventions-in-computing-since-1980</a></h3>
<div class="outline-text-3" id="text-12-24">

</div>

</div>

<div id="outline-container-12-25" class="outline-3">
<h3 id="sec-12-25"><a href="http://en.wikipedia.org/wiki/Computational_geometry">http://en.wikipedia.org/wiki/Computational_geometry</a></h3>
<div class="outline-text-3" id="text-12-25">

</div>

</div>

<div id="outline-container-12-26" class="outline-3">
<h3 id="sec-12-26"><a href="http://scientopia.org/blogs/goodmath/2013/01/20/static-typing-give-me-a-break/">http://scientopia.org/blogs/goodmath/2013/01/20/static-typing-give-me-a-break/</a></h3>
<div class="outline-text-3" id="text-12-26">

</div>

</div>

<div id="outline-container-12-27" class="outline-3">
<h3 id="sec-12-27">A Glimpse of the Future of Scientific Programming <a href="http://bit.ly/15yeIjw">http://bit.ly/15yeIjw</a></h3>
<div class="outline-text-3" id="text-12-27">

<p><a href="http://www.computer.org/portal/web/computingnow/content?g=53319&amp;type=article&amp;urlTitle=a-glimpse-of-the-future-of-scientific-programming&amp;lf1=267408692c637116407312f6779968">http://www.computer.org/portal/web/computingnow/content?g=53319&amp;type=article&amp;urlTitle=a-glimpse-of-the-future-of-scientific-programming&amp;lf1=267408692c637116407312f6779968</a>
</p></div>

</div>

<div id="outline-container-12-28" class="outline-3">
<h3 id="sec-12-28"><a href="http://cstheory.stackexchange.com/questions/1168/what-papers-should-everyone-read">http://cstheory.stackexchange.com/questions/1168/what-papers-should-everyone-read</a></h3>
<div class="outline-text-3" id="text-12-28">

</div>

</div>

<div id="outline-container-12-29" class="outline-3">
<h3 id="sec-12-29">monads in OO <a href="http://ericlippert.com/2013/02/25/monads-part-two/">http://ericlippert.com/2013/02/25/monads-part-two/</a></h3>
<div class="outline-text-3" id="text-12-29">

</div>

</div>

<div id="outline-container-12-30" class="outline-3">
<h3 id="sec-12-30">blog <a href="http://eng.42go.com/">http://eng.42go.com/</a></h3>
<div class="outline-text-3" id="text-12-30">

<p> <a href="http://eng.42go.com/pattern-matching-in-scala/">http://eng.42go.com/pattern-matching-in-scala/</a>
<a href="http://eng.42go.com/a-simple-time-decaying-approximate-membership-filter/">http://eng.42go.com/a-simple-time-decaying-approximate-membership-filter/</a>
</p></div>

</div>

<div id="outline-container-12-31" class="outline-3">
<h3 id="sec-12-31">density succinct <a href="http://blog.josephwilk.net/software-craftmanship/the-aesthetics-of-density.html">http://blog.josephwilk.net/software-craftmanship/the-aesthetics-of-density.html</a></h3>
<div class="outline-text-3" id="text-12-31">

</div>

</div>

<div id="outline-container-12-32" class="outline-3">
<h3 id="sec-12-32">style guide <a href="https://google-styleguide.googlecode.com/svn/trunk/">https://google-styleguide.googlecode.com/svn/trunk/</a> watch Norvig videos <a href="http://www.lispcast.com/google-common-lisp-style-guide">http://www.lispcast.com/google-common-lisp-style-guide</a></h3>
<div class="outline-text-3" id="text-12-32">

</div>

</div>

<div id="outline-container-12-33" class="outline-3">
<h3 id="sec-12-33"><a href="http://www.infoq.com/interviews/erik-meijer-programming-language-design-effects-purity">http://www.infoq.com/interviews/erik-meijer-programming-language-design-effects-purity</a></h3>
<div class="outline-text-3" id="text-12-33">

<p>   Erlang has very cheap threads now you can use concurrency as a control structure  very close to object oriented programming and dynamic dispatch.
   what the Reactive framework is, it’s just the continuation monad &hellip;  it is the observer observable is the dual of enumerable enumerator
</p></div>

</div>

<div id="outline-container-12-34" class="outline-3">
<h3 id="sec-12-34">concatenative (applicative) programming <a href="http://blog.fogus.me/2013/01/06/pesto5-a-concatenative-programming-library-in-5-lines-of-clojure/">http://blog.fogus.me/2013/01/06/pesto5-a-concatenative-programming-library-in-5-lines-of-clojure/</a></h3>
<div class="outline-text-3" id="text-12-34">

</div>

</div>

<div id="outline-container-12-35" class="outline-3">
<h3 id="sec-12-35">interview of Alan Kay <a href="http://www.drdobbs.com/architecture-and-design/interview-with-alan-kay/240003442">http://www.drdobbs.com/architecture-and-design/interview-with-alan-kay/240003442</a></h3>
<div class="outline-text-3" id="text-12-35">

</div>

</div>

<div id="outline-container-12-36" class="outline-3">
<h3 id="sec-12-36">shen language in clojure <a href="https://github.com/hraberg/shen.clj">https://github.com/hraberg/shen.clj</a> <a href="http://www.shenlanguage.org/learn-shen/tutorials/shen_in_15mins.html#shen-in-15mins">http://www.shenlanguage.org/learn-shen/tutorials/shen_in_15mins.html#shen-in-15mins</a></h3>
<div class="outline-text-3" id="text-12-36">

</div>

</div>

<div id="outline-container-12-37" class="outline-3">
<h3 id="sec-12-37">Joe Armstrong on languages <a href="http://www.codewiz51.com/blog/post/2013/01/24/Post-from-John-Armstrong-inventor-of-Erlang.aspx">http://www.codewiz51.com/blog/post/2013/01/24/Post-from-John-Armstrong-inventor-of-Erlang.aspx</a></h3>
<div class="outline-text-3" id="text-12-37">

<p>What would I recommend learning?
</p>
<ul>
<li>C
</li>
<li>Prolog
</li>
<li>Erlang (I'm biased)
</li>
<li>Smalltalk
</li>
<li>Javascript
</li>
<li>Hakell / ML /OCaml
</li>
<li>LISP/Scheme/Clojure
</li>
</ul>


<p>
A couple of years should be enough (PER LANGUAGE).
</p>
<p>
Notice there is no quick fix here - if you want a quick fix go buy "learn
PHP in ten minutes"
and spend the next twenty years googling for "how do I compute the length
of a string"
</p>
<p>
The crazy think is we still are extremely bad at fitting things together -
still the best
way of fitting things together is the unix pipe
</p>
<p>
    find &hellip; | grep | uniq | sort | &hellip;
</p>
<p>
and the <b>fundamental</b> reason for this is that components should be separated
by well-defined protocols in a universal intermediate language.
</p>
<p>
Fitting things together by message passing is the way to go - this is basis
of
OO programming - but done badly in most programming languages.
</p>
<p>
If ALL applications in the world were interfaced by (say) sockets + lisp S
expressions
and had the semantics of the protocol written down in a formal notation -
then we could
reuse things (more) easily.
</p>
<p>
Today there is an unhealthy concentration on language and efficiency and
NOT on how things fit together and protocols - teach protocols and not
languages.
</p>
<p>
And teach ALGORITHMS.
</p></div>

</div>
