toread.org
** rust http://www.rust-lang.org/ http://static.rust-lang.org/doc/tutorial.html
Rust is a curly-brace, block-structured expression language.
It visually resembles the C language family, but differs significantly in syntactic and semantic details.
Its design is oriented toward concerns of “programming in the large”,
that is, of creating and maintaining boundaries – both abstract and operational – that preserve large-system integrity, availability and concurrency.
It supports a mixture of imperative procedural, concurrent actor, object-oriented and pure functional styles.
Rust also supports generic programming and metaprogramming, in both static and dynamic styles.
*** http://brson.github.com/2013/02/02/redesigning-the-rust-runtime/
** Learning How To Learn Programming http://michaelrbernste.in/2013/02/23/notes-on-teaching-with-the-kernel-language-approach.html
from Van Roy and Haridi's book
** data parallezisation : incremental datalog computation http://research.microsoft.com/en-us/projects/naiad/
http://channel9.msdn.com/posts/Frank-McSherry-Introduction-to-Naiad-and-Differential-Dataflow
Naiad is an investigation of data-parallel dataflow computation in
the spirit of Dryad and DryadLINQ, but with a focus on incremental
computation. Naiad introduces a new computational model, differential
dataflow, operating over collections of differences rather than
collections of records, and resulting in very efficient
implementations of programming patterns that are expensive in existing
systems.

var text.SelectMany(x => x.Split(' '))
        .Count(y => y, (k, c) => k " : " c)
        .subscribe(l => {foreach (var element in l) Console.writeLine(element)})

** concurrency / parallelism http://www.maymounkov.org/clash-concurrency-parallelism-practice
Concurrency is a property of the algorithm that you are designing.
It determines which parts of your data-processing logic are intrinsically independent (under all inputs and circumstances).

Parallelism is a property of the realization of your algorithm.
This is not your source code, but the final executable or — even more abstractly — the behavior of your program when executed.
** ioke folding language http://ioke.org/ http://sam.aaron.name/2010/03/29/conway-s-game-of-life-in-ioke.html
* creative coding
** Image manipulation
*** Dither effect http://gmic.sourceforge.net/

A dithering effect with it:
http://gmic.sourceforge.net/slides/res_039.jpg
http://sourceforge.net/mailarchive/forum.php?thread_name=352429786.899012.1288825011855.JavaMail.root%40sz0023a.westchester.pa.mail.comcast.net&forum_name=graphicsmagick-help
** animation
*** dessin animé http://www.youtube.com/watch?feature=player_embedded&v=yJZx99-lSnc how to do it ?
*** codelife - glsl live-coding editor test #5 http://vimeo.com/51993089
*** https://www.shadertoy.com/view/lsl3zr
*** http://www.hakantuzunsengun.com/index.php/work/doubt-is-better/
*** minimum games maximum fun http://www.java4k.com/index.php?action=home
** Julia Buntaine‘s artwork provides conceptual footholds for issues in neuroscience http://thebeautifulbrain.com/2013/07/interview-julia-buntaine/
** http://weavesilk.com/
** http://www.catodo.net/
**  IMPULSTANZ festival https://vimeo.com/44812164 http://www.impulstanz.com/
** Fork Bomb http://jaromil.dyne.org/journal/forkbomb_art.html
**  phenomenon of creative computing http://10print.org/
** creator of Processing : Casey Reas http://reas.com/
** Processing 
*** OpenCV for processing http://urbanhonking.com/ideasfordozens/2013/07/10/announcing-opencv-for-processing/ https://github.com/atduskgreg/opencv-processing
*** hardware : kinect (detect human motion windows-based) arduino, touchOSC, Monome, Leap motion ()
*** Leap motion https://www.leapmotion.com/ 
*** Generative Art Matt Pearson. / Learning Processing: A Beginner's Guide to Programming Images, Animation, and Interaction Daniel Shiffman.
*** Algorithms for Visual Design Using the Processing Language Kostas Terzidis
* concurrency
** Adopting Ideas from Erlang and Clojure for a Highly Concurrent, Simple and Maintainable Application http://blog.paralleluniverse.co/post/64210769930/spaceships2
** Locks Actors STM http://adit.io/posts/2013-05-15-Locks,-Actors,-And-STM-In-Pictures.html
** RiconEast distributed system http://www.jkemp.net/blog/review-ricon-east/
** Parallelism and concurrency need different tools http://www.yosefk.com/blog/parallelism-and-concurrency-need-different-tools.html
** Erlang (and Go) in Clojure (and Java) http://blog.paralleluniverse.co/post/49445260575/quasar-pulsar
https://github.com/puniverse/pulsar
** great explanation of concurrency concepts in clojure http://www.youtube.com/watch?v=wASCH_gPnDw at the End
   - CAS semantics : Atom
   - Coordinated change inside a transaction : ref
** go in clojure http://thornydev.blogspot.fr/2013/01/go-concurrency-constructs-in-clojure4.html
** http://blog.jayfields.com/2013/02/synchronizing-snapshots-and.html
* probabilistic programming
** Church Intro http://videolectures.net/aaai2012_tenenbaum_grow_mind/
** probabilitic programming in clojure by Nils Bertschinger bertschi@mis.mpg.de https://github.com/bertschi/ProbClojureNice
https://groups.google.com/forum/?fromgroups=#!topic/clojure/9NhsFga4D9s

* haskell
