toread.html

<div id="outline-container-12-38" class="outline-3">
<h3 id="sec-12-38">rust <a href="http://www.rust-lang.org/">http://www.rust-lang.org/</a> <a href="http://static.rust-lang.org/doc/tutorial.html">http://static.rust-lang.org/doc/tutorial.html</a></h3>
<div class="outline-text-3" id="text-12-38">

<p>Rust is a curly-brace, block-structured expression language.
It visually resembles the C language family, but differs significantly in syntactic and semantic details.
Its design is oriented toward concerns of “programming in the large”,
that is, of creating and maintaining boundaries – both abstract and operational – that preserve large-system integrity, availability and concurrency.
It supports a mixture of imperative procedural, concurrent actor, object-oriented and pure functional styles.
Rust also supports generic programming and metaprogramming, in both static and dynamic styles.
</p>
</div>

<div id="outline-container-12-38-1" class="outline-4">
<h4 id="sec-12-38-1"><a href="http://brson.github.com/2013/02/02/redesigning-the-rust-runtime/">http://brson.github.com/2013/02/02/redesigning-the-rust-runtime/</a></h4>
<div class="outline-text-4" id="text-12-38-1">

</div>
</div>

</div>

<div id="outline-container-12-39" class="outline-3">
<h3 id="sec-12-39">Learning How To Learn Programming <a href="http://michaelrbernste.in/2013/02/23/notes-on-teaching-with-the-kernel-language-approach.html">http://michaelrbernste.in/2013/02/23/notes-on-teaching-with-the-kernel-language-approach.html</a></h3>
<div class="outline-text-3" id="text-12-39">

<p>from Van Roy and Haridi's book
</p></div>

</div>

<div id="outline-container-12-40" class="outline-3">
<h3 id="sec-12-40">data parallezisation : incremental datalog computation <a href="http://research.microsoft.com/en-us/projects/naiad/">http://research.microsoft.com/en-us/projects/naiad/</a></h3>
<div class="outline-text-3" id="text-12-40">

<p><a href="http://channel9.msdn.com/posts/Frank-McSherry-Introduction-to-Naiad-and-Differential-Dataflow">http://channel9.msdn.com/posts/Frank-McSherry-Introduction-to-Naiad-and-Differential-Dataflow</a>
Naiad is an investigation of data-parallel dataflow computation in
the spirit of Dryad and DryadLINQ, but with a focus on incremental
computation. Naiad introduces a new computational model, differential
dataflow, operating over collections of differences rather than
collections of records, and resulting in very efficient
implementations of programming patterns that are expensive in existing
systems.
</p>
<p>
var text.SelectMany(x =&gt; x.Split(' '))
        .Count(y =&gt; y, (k, c) =&gt; k " : " c)
        .subscribe(l =&gt; {foreach (var element in l) Console.writeLine(element)})
</p>
</div>

</div>

<div id="outline-container-12-41" class="outline-3">
<h3 id="sec-12-41">concurrency / parallelism <a href="http://www.maymounkov.org/clash-concurrency-parallelism-practice">http://www.maymounkov.org/clash-concurrency-parallelism-practice</a></h3>
<div class="outline-text-3" id="text-12-41">

<p>Concurrency is a property of the algorithm that you are designing.
It determines which parts of your data-processing logic are intrinsically independent (under all inputs and circumstances).
</p>
<p>
Parallelism is a property of the realization of your algorithm.
This is not your source code, but the final executable or — even more abstractly — the behavior of your program when executed.
</p></div>

</div>

<div id="outline-container-12-42" class="outline-3">
<h3 id="sec-12-42">ioke folding language <a href="http://ioke.org/">http://ioke.org/</a> <a href="http://sam.aaron.name/2010/03/29/conway-s-game-of-life-in-ioke.html">http://sam.aaron.name/2010/03/29/conway-s-game-of-life-in-ioke.html</a></h3>
<div class="outline-text-3" id="text-12-42">

</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">creative coding</h2>
<div class="outline-text-2" id="text-13">


</div>

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1">Julia Buntaine‘s artwork provides conceptual footholds for issues in neuroscience <a href="http://thebeautifulbrain.com/2013/07/interview-julia-buntaine/">http://thebeautifulbrain.com/2013/07/interview-julia-buntaine/</a></h3>
<div class="outline-text-3" id="text-13-1">

</div>

</div>

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2"><a href="http://weavesilk.com/">http://weavesilk.com/</a></h3>
<div class="outline-text-3" id="text-13-2">

</div>

</div>

<div id="outline-container-13-3" class="outline-3">
<h3 id="sec-13-3"><a href="http://www.catodo.net/">http://www.catodo.net/</a></h3>
<div class="outline-text-3" id="text-13-3">

</div>

</div>

<div id="outline-container-13-4" class="outline-3">
<h3 id="sec-13-4">IMPULSTANZ festival <a href="https://vimeo.com/44812164">https://vimeo.com/44812164</a> <a href="http://www.impulstanz.com/">http://www.impulstanz.com/</a></h3>
<div class="outline-text-3" id="text-13-4">

</div>

</div>

<div id="outline-container-13-5" class="outline-3">
<h3 id="sec-13-5">Fork Bomb <a href="http://jaromil.dyne.org/journal/forkbomb_art.html">http://jaromil.dyne.org/journal/forkbomb_art.html</a></h3>
<div class="outline-text-3" id="text-13-5">

</div>

</div>

<div id="outline-container-13-6" class="outline-3">
<h3 id="sec-13-6">phenomenon of creative computing <a href="http://10print.org/">http://10print.org/</a></h3>
<div class="outline-text-3" id="text-13-6">

</div>

</div>

<div id="outline-container-13-7" class="outline-3">
<h3 id="sec-13-7">creator of Processing : Casey Reas <a href="http://reas.com/">http://reas.com/</a></h3>
<div class="outline-text-3" id="text-13-7">

</div>

</div>

<div id="outline-container-13-8" class="outline-3">
<h3 id="sec-13-8">Processing</h3>
<div class="outline-text-3" id="text-13-8">


</div>

<div id="outline-container-13-8-1" class="outline-4">
<h4 id="sec-13-8-1">OpenCV for processing <a href="http://urbanhonking.com/ideasfordozens/2013/07/10/announcing-opencv-for-processing/">http://urbanhonking.com/ideasfordozens/2013/07/10/announcing-opencv-for-processing/</a> <a href="https://github.com/atduskgreg/opencv-processing">https://github.com/atduskgreg/opencv-processing</a></h4>
<div class="outline-text-4" id="text-13-8-1">

</div>

</div>

<div id="outline-container-13-8-2" class="outline-4">
<h4 id="sec-13-8-2">hardware : kinect (detect human motion windows-based) arduino, touchOSC, Monome, Leap motion ()</h4>
<div class="outline-text-4" id="text-13-8-2">

</div>

</div>

<div id="outline-container-13-8-3" class="outline-4">
<h4 id="sec-13-8-3">Leap motion <a href="https://www.leapmotion.com/">https://www.leapmotion.com/</a></h4>
<div class="outline-text-4" id="text-13-8-3">

</div>

</div>

<div id="outline-container-13-8-4" class="outline-4">
<h4 id="sec-13-8-4">Generative Art Matt Pearson. / Learning Processing: A Beginner's Guide to Programming Images, Animation, and Interaction Daniel Shiffman.</h4>
<div class="outline-text-4" id="text-13-8-4">

</div>

</div>

<div id="outline-container-13-8-5" class="outline-4">
<h4 id="sec-13-8-5">Algorithms for Visual Design Using the Processing Language Kostas Terzidis</h4>
<div class="outline-text-4" id="text-13-8-5">

</div>
</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">concurrency</h2>
<div class="outline-text-2" id="text-14">


</div>

<div id="outline-container-14-1" class="outline-3">
<h3 id="sec-14-1">Locks Actors STM <a href="http://adit.io/posts/2013-05-15-Locks,-Actors,-And-STM-In-Pictures.html">http://adit.io/posts/2013-05-15-Locks,-Actors,-And-STM-In-Pictures.html</a></h3>
<div class="outline-text-3" id="text-14-1">

</div>

</div>

<div id="outline-container-14-2" class="outline-3">
<h3 id="sec-14-2">RiconEast distributed system <a href="http://www.jkemp.net/blog/review-ricon-east/">http://www.jkemp.net/blog/review-ricon-east/</a></h3>
<div class="outline-text-3" id="text-14-2">

</div>

</div>

<div id="outline-container-14-3" class="outline-3">
<h3 id="sec-14-3">Parallelism and concurrency need different tools <a href="http://www.yosefk.com/blog/parallelism-and-concurrency-need-different-tools.html">http://www.yosefk.com/blog/parallelism-and-concurrency-need-different-tools.html</a></h3>
<div class="outline-text-3" id="text-14-3">

</div>

</div>

<div id="outline-container-14-4" class="outline-3">
<h3 id="sec-14-4">Erlang (and Go) in Clojure (and Java) <a href="http://blog.paralleluniverse.co/post/49445260575/quasar-pulsar">http://blog.paralleluniverse.co/post/49445260575/quasar-pulsar</a></h3>
<div class="outline-text-3" id="text-14-4">

<p><a href="https://github.com/puniverse/pulsar">https://github.com/puniverse/pulsar</a>
</p></div>

</div>

<div id="outline-container-14-5" class="outline-3">
<h3 id="sec-14-5">great explanation of concurrency concepts in clojure <a href="http://www.youtube.com/watch?v=wASCH_gPnDw">http://www.youtube.com/watch?v=wASCH_gPnDw</a> at the End</h3>
<div class="outline-text-3" id="text-14-5">

<ul>
<li>CAS semantics : Atom
</li>
<li>Coordinated change inside a transaction : ref
</li>
</ul>

</div>

</div>

<div id="outline-container-14-6" class="outline-3">
<h3 id="sec-14-6">go in clojure <a href="http://thornydev.blogspot.fr/2013/01/go-concurrency-constructs-in-clojure4.html">http://thornydev.blogspot.fr/2013/01/go-concurrency-constructs-in-clojure4.html</a></h3>
<div class="outline-text-3" id="text-14-6">

</div>

</div>

<div id="outline-container-14-7" class="outline-3">
<h3 id="sec-14-7"><a href="http://blog.jayfields.com/2013/02/synchronizing-snapshots-and.html">http://blog.jayfields.com/2013/02/synchronizing-snapshots-and.html</a></h3>
<div class="outline-text-3" id="text-14-7">

</div>
</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">probabilistic programming</h2>
<div class="outline-text-2" id="text-15">


</div>

<div id="outline-container-15-1" class="outline-3">
<h3 id="sec-15-1">Church Intro <a href="http://videolectures.net/aaai2012_tenenbaum_grow_mind/">http://videolectures.net/aaai2012_tenenbaum_grow_mind/</a></h3>
<div class="outline-text-3" id="text-15-1">

</div>

</div>

<div id="outline-container-15-2" class="outline-3">
<h3 id="sec-15-2">probabilitic programming in clojure by Nils Bertschinger bertschi@mis.mpg.de <a href="https://github.com/bertschi/ProbClojureNice">https://github.com/bertschi/ProbClojureNice</a></h3>
<div class="outline-text-3" id="text-15-2">

<p><a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/9NhsFga4D9s">https://groups.google.com/forum/?fromgroups=#!topic/clojure/9NhsFga4D9s</a>
</p>
</div>
</div>

</div>
