toread.org
** Conquering Folds by Edward Kmett https://www.fpcomplete.com/user/edwardk/conquering-folds
** data science in Haskell http://izbicki.me/blog/category/computer-science/haskell/hlearn
** The polar game in haskell : code commented http://praisecurseandrecurse.blogspot.fr/2013/07/the-polar-game-in-haskell-day-5-12.html
** compiler https://github.com/dfeltey/CompilersFromScratch
http://sebfisch.github.io/haskell-regexp/
http://matt.might.net/articles/implementation-of-regular-expression-matching-in-scheme-with-derivatives/
http://www.mpi-sws.org/~turon/re-deriv.pdf
http://matt.might.net/articles/cek-machines/
http://www.cs.tufts.edu/~nr/cs257/archive/doaitse-swierstra/combinator-parsing-tutorial.pdf
The parsing library for this workshop follows the implementation of
the basic combinators in the above paper.
http://www.brics.dk/RS/03/14/BRICS-RS-03-14.pdf
The CEK machine built in this workshop is based on the derivation in
the above paper, extended with printing, if statements, and binary operations.
** some bloggers : http://donsbot.wordpress.com/  http://blog.ezyang.com/
** Haskell from C: Where are the for Loops? https://www.fpcomplete.com/blog/2013/06/haskell-from-c
** lenses http://www.haskellforall.com/2013/05/program-imperatively-using-haskell.html https://www.fpcomplete.com/school/pick-of-the-week/basic-lensing
** haskell code review http://stefan.saasen.me/articles/git-clone-in-haskell-from-the-bottom-up
** School of Haskell https://www.fpcomplete.com/
** Beautiful concurrency https://www.fpcomplete.com/user/simonpj/beautiful-concurrency
** HTML http://adit.io/posts/2012-04-14-working_with_HTML_in_haskell.html
** anatomy of programming language http://www.cs.utexas.edu/~wcook/anatomy/anatomy.pdf
** Thompson book http://www.cs.kent.ac.uk/people/staff/sjt/craft2e/
** Programming in Haskell, Graham Hutton http://www.cs.nott.ac.uk/~gmh/book.html
** blog http://www.haskellforall.com/
comonad and OO Design pattern http://www.haskellforall.com/2013/02/you-could-have-invented-comonads.html
 http://www.haskellforall.com/2012/06/you-could-have-invented-free-monads.html

** type http://www.haskell.org/haskellwiki/Typeclassopedia
* c#
** Top10 count words in LINQ  http://scottchamberlin.tumblr.com/post/55152416452/linqinterview
* go
**  http://dehora.net/journal/2013/06/01/on-go/
** The examples from Tony Hoare's seminal 1978 paper "Communicating sequential processes" implemented in Go. http://godoc.org/github.com/thomas11/csp
** Go introduction http://cowlark.com/2009-11-15-go/
** Rob Pike Why Go is boring http://www.infoq.com/presentations/Go-Google
* python
** 3D plot wth Matplotlib  http://jakevdp.github.io/blog/2013/07/10/XKCD-plots-in-matplotlib/
** Learn Python The Hard Way http://learnpythonthehardway.org/book
** python data structures tutorial http://net.tutsplus.com/tutorials/advanced-python-data-structures/
** recognizing numbers http://www.johndcook.com/blog/2013/04/30/recognizing-numbers/
>>> from sympy import *
>>> nsimplify(4.242640687119286)
3*sqrt(2)
** python and panda top 10 http://manishamde.github.io/blog/2013/03/07/pandas-and-python-top-10/
** redo: a top-down software build system https://github.com/apenwarr/redo
** Writing clean, testable, high quality code in Python http://www.ibm.com/developerworks/aix/library/au-cleancode/
* scala
** Java to Scale Cheatsheet http://techblog.realestate.com.au/java-to-scala-cheatsheet/
** Applicatives are too restrictive, breaking Applicatives and introducing Functional Builders http://sadache.tumblr.com/post/30955704987/applicatives-are-too-restrictive-breaking-applicatives
** Composing Type classes http://scalapenos.com/2013/07/11/composing-type-classes.html 
** Designing scala librairies (slides) http://scalapenos.com/2013/04/26/scala-presentation.html
** Ztream is POC P2P-assisted Web music streaming built with WebRTC, Media Source API, AngularJS, Play, ReactiveMongo http://ztream.atamborrino.cloudbees.net/
