toread.html

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16">haskell</h2>
<div class="outline-text-2" id="text-16">


</div>

<div id="outline-container-16-1" class="outline-3">
<h3 id="sec-16-1">Conquering Folds by Edward Kmett <a href="https://www.fpcomplete.com/user/edwardk/conquering-folds">https://www.fpcomplete.com/user/edwardk/conquering-folds</a></h3>
<div class="outline-text-3" id="text-16-1">

</div>

</div>

<div id="outline-container-16-2" class="outline-3">
<h3 id="sec-16-2">data science in Haskell <a href="http://izbicki.me/blog/category/computer-science/haskell/hlearn">http://izbicki.me/blog/category/computer-science/haskell/hlearn</a></h3>
<div class="outline-text-3" id="text-16-2">

</div>

</div>

<div id="outline-container-16-3" class="outline-3">
<h3 id="sec-16-3">The polar game in haskell : code commented <a href="http://praisecurseandrecurse.blogspot.fr/2013/07/the-polar-game-in-haskell-day-5-12.html">http://praisecurseandrecurse.blogspot.fr/2013/07/the-polar-game-in-haskell-day-5-12.html</a></h3>
<div class="outline-text-3" id="text-16-3">

</div>

</div>

<div id="outline-container-16-4" class="outline-3">
<h3 id="sec-16-4">compiler <a href="https://github.com/dfeltey/CompilersFromScratch">https://github.com/dfeltey/CompilersFromScratch</a></h3>
<div class="outline-text-3" id="text-16-4">

<p><a href="http://sebfisch.github.io/haskell-regexp/">http://sebfisch.github.io/haskell-regexp/</a>
<a href="http://matt.might.net/articles/implementation-of-regular-expression-matching-in-scheme-with-derivatives/">http://matt.might.net/articles/implementation-of-regular-expression-matching-in-scheme-with-derivatives/</a>
<a href="http://www.mpi-sws.org/~turon/re-deriv.pdf">http://www.mpi-sws.org/~turon/re-deriv.pdf</a>
<a href="http://matt.might.net/articles/cek-machines/">http://matt.might.net/articles/cek-machines/</a>
<a href="http://www.cs.tufts.edu/~nr/cs257/archive/doaitse-swierstra/combinator-parsing-tutorial.pdf">http://www.cs.tufts.edu/~nr/cs257/archive/doaitse-swierstra/combinator-parsing-tutorial.pdf</a>
The parsing library for this workshop follows the implementation of
the basic combinators in the above paper.
<a href="http://www.brics.dk/RS/03/14/BRICS-RS-03-14.pdf">http://www.brics.dk/RS/03/14/BRICS-RS-03-14.pdf</a>
The CEK machine built in this workshop is based on the derivation in
the above paper, extended with printing, if statements, and binary operations.
</p></div>

</div>

<div id="outline-container-16-5" class="outline-3">
<h3 id="sec-16-5">some bloggers : <a href="http://donsbot.wordpress.com/">http://donsbot.wordpress.com/</a>  <a href="http://blog.ezyang.com/">http://blog.ezyang.com/</a></h3>
<div class="outline-text-3" id="text-16-5">

</div>

</div>

<div id="outline-container-16-6" class="outline-3">
<h3 id="sec-16-6">Haskell from C: Where are the for Loops? <a href="https://www.fpcomplete.com/blog/2013/06/haskell-from-c">https://www.fpcomplete.com/blog/2013/06/haskell-from-c</a></h3>
<div class="outline-text-3" id="text-16-6">

</div>

</div>

<div id="outline-container-16-7" class="outline-3">
<h3 id="sec-16-7">lenses <a href="http://www.haskellforall.com/2013/05/program-imperatively-using-haskell.html">http://www.haskellforall.com/2013/05/program-imperatively-using-haskell.html</a> <a href="https://www.fpcomplete.com/school/pick-of-the-week/basic-lensing">https://www.fpcomplete.com/school/pick-of-the-week/basic-lensing</a></h3>
<div class="outline-text-3" id="text-16-7">

</div>

</div>

<div id="outline-container-16-8" class="outline-3">
<h3 id="sec-16-8">haskell code review <a href="http://stefan.saasen.me/articles/git-clone-in-haskell-from-the-bottom-up">http://stefan.saasen.me/articles/git-clone-in-haskell-from-the-bottom-up</a></h3>
<div class="outline-text-3" id="text-16-8">

</div>

</div>

<div id="outline-container-16-9" class="outline-3">
<h3 id="sec-16-9">School of Haskell <a href="https://www.fpcomplete.com/">https://www.fpcomplete.com/</a></h3>
<div class="outline-text-3" id="text-16-9">

</div>

</div>

<div id="outline-container-16-10" class="outline-3">
<h3 id="sec-16-10">Beautiful concurrency <a href="https://www.fpcomplete.com/user/simonpj/beautiful-concurrency">https://www.fpcomplete.com/user/simonpj/beautiful-concurrency</a></h3>
<div class="outline-text-3" id="text-16-10">

</div>

</div>

<div id="outline-container-16-11" class="outline-3">
<h3 id="sec-16-11">HTML <a href="http://adit.io/posts/2012-04-14-working_with_HTML_in_haskell.html">http://adit.io/posts/2012-04-14-working_with_HTML_in_haskell.html</a></h3>
<div class="outline-text-3" id="text-16-11">

</div>

</div>

<div id="outline-container-16-12" class="outline-3">
<h3 id="sec-16-12">anatomy of programming language <a href="http://www.cs.utexas.edu/~wcook/anatomy/anatomy.pdf">http://www.cs.utexas.edu/~wcook/anatomy/anatomy.pdf</a></h3>
<div class="outline-text-3" id="text-16-12">

</div>

</div>

<div id="outline-container-16-13" class="outline-3">
<h3 id="sec-16-13">Thompson book <a href="http://www.cs.kent.ac.uk/people/staff/sjt/craft2e/">http://www.cs.kent.ac.uk/people/staff/sjt/craft2e/</a></h3>
<div class="outline-text-3" id="text-16-13">

</div>

</div>

<div id="outline-container-16-14" class="outline-3">
<h3 id="sec-16-14">Programming in Haskell, Graham Hutton <a href="http://www.cs.nott.ac.uk/~gmh/book.html">http://www.cs.nott.ac.uk/~gmh/book.html</a></h3>
<div class="outline-text-3" id="text-16-14">

</div>

</div>

<div id="outline-container-16-15" class="outline-3">
<h3 id="sec-16-15">blog <a href="http://www.haskellforall.com/">http://www.haskellforall.com/</a></h3>
<div class="outline-text-3" id="text-16-15">

<p>comonad and OO Design pattern <a href="http://www.haskellforall.com/2013/02/you-could-have-invented-comonads.html">http://www.haskellforall.com/2013/02/you-could-have-invented-comonads.html</a>
 <a href="http://www.haskellforall.com/2012/06/you-could-have-invented-free-monads.html">http://www.haskellforall.com/2012/06/you-could-have-invented-free-monads.html</a>
</p>
</div>

</div>

<div id="outline-container-16-16" class="outline-3">
<h3 id="sec-16-16">type <a href="http://www.haskell.org/haskellwiki/Typeclassopedia">http://www.haskell.org/haskellwiki/Typeclassopedia</a></h3>
<div class="outline-text-3" id="text-16-16">

</div>
</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17">c#</h2>
<div class="outline-text-2" id="text-17">


</div>

<div id="outline-container-17-1" class="outline-3">
<h3 id="sec-17-1">Top10 count words in LINQ  <a href="http://scottchamberlin.tumblr.com/post/55152416452/linqinterview">http://scottchamberlin.tumblr.com/post/55152416452/linqinterview</a></h3>
<div class="outline-text-3" id="text-17-1">

</div>
</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18">go</h2>
<div class="outline-text-2" id="text-18">


</div>

<div id="outline-container-18-1" class="outline-3">
<h3 id="sec-18-1"><a href="http://dehora.net/journal/2013/06/01/on-go/">http://dehora.net/journal/2013/06/01/on-go/</a></h3>
<div class="outline-text-3" id="text-18-1">

</div>

</div>

<div id="outline-container-18-2" class="outline-3">
<h3 id="sec-18-2">The examples from Tony Hoare's seminal 1978 paper "Communicating sequential processes" implemented in Go. <a href="http://godoc.org/github.com/thomas11/csp">http://godoc.org/github.com/thomas11/csp</a></h3>
<div class="outline-text-3" id="text-18-2">

</div>

</div>

<div id="outline-container-18-3" class="outline-3">
<h3 id="sec-18-3">Go introduction <a href="http://cowlark.com/2009-11-15-go/">http://cowlark.com/2009-11-15-go/</a></h3>
<div class="outline-text-3" id="text-18-3">

</div>

</div>

<div id="outline-container-18-4" class="outline-3">
<h3 id="sec-18-4">Rob Pike Why Go is boring <a href="http://www.infoq.com/presentations/Go-Google">http://www.infoq.com/presentations/Go-Google</a></h3>
<div class="outline-text-3" id="text-18-4">

</div>
</div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19">python</h2>
<div class="outline-text-2" id="text-19">


</div>

<div id="outline-container-19-1" class="outline-3">
<h3 id="sec-19-1">3D plot wth Matplotlib  <a href="http://jakevdp.github.io/blog/2013/07/10/XKCD-plots-in-matplotlib/">http://jakevdp.github.io/blog/2013/07/10/XKCD-plots-in-matplotlib/</a></h3>
<div class="outline-text-3" id="text-19-1">

</div>

</div>

<div id="outline-container-19-2" class="outline-3">
<h3 id="sec-19-2">Learn Python The Hard Way <a href="http://learnpythonthehardway.org/book">http://learnpythonthehardway.org/book</a></h3>
<div class="outline-text-3" id="text-19-2">

</div>

</div>

<div id="outline-container-19-3" class="outline-3">
<h3 id="sec-19-3">python data structures tutorial <a href="http://net.tutsplus.com/tutorials/advanced-python-data-structures/">http://net.tutsplus.com/tutorials/advanced-python-data-structures/</a></h3>
<div class="outline-text-3" id="text-19-3">

</div>

</div>

<div id="outline-container-19-4" class="outline-3">
<h3 id="sec-19-4">recognizing numbers <a href="http://www.johndcook.com/blog/2013/04/30/recognizing-numbers/">http://www.johndcook.com/blog/2013/04/30/recognizing-numbers/</a></h3>
<div class="outline-text-3" id="text-19-4">

<p>&gt;&gt;&gt; from sympy import *
&gt;&gt;&gt; nsimplify(4.242640687119286)
3*sqrt(2)
</p></div>

</div>

<div id="outline-container-19-5" class="outline-3">
<h3 id="sec-19-5">python and panda top 10 <a href="http://manishamde.github.io/blog/2013/03/07/pandas-and-python-top-10/">http://manishamde.github.io/blog/2013/03/07/pandas-and-python-top-10/</a></h3>
<div class="outline-text-3" id="text-19-5">

</div>

</div>

<div id="outline-container-19-6" class="outline-3">
<h3 id="sec-19-6">redo: a top-down software build system <a href="https://github.com/apenwarr/redo">https://github.com/apenwarr/redo</a></h3>
<div class="outline-text-3" id="text-19-6">

</div>

</div>

<div id="outline-container-19-7" class="outline-3">
<h3 id="sec-19-7">Writing clean, testable, high quality code in Python <a href="http://www.ibm.com/developerworks/aix/library/au-cleancode/">http://www.ibm.com/developerworks/aix/library/au-cleancode/</a></h3>
<div class="outline-text-3" id="text-19-7">

</div>
</div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20">scala</h2>
<div class="outline-text-2" id="text-20">


</div>

<div id="outline-container-20-1" class="outline-3">
<h3 id="sec-20-1">Java to Scale Cheatsheet <a href="http://techblog.realestate.com.au/java-to-scala-cheatsheet/">http://techblog.realestate.com.au/java-to-scala-cheatsheet/</a></h3>
<div class="outline-text-3" id="text-20-1">

</div>

</div>

<div id="outline-container-20-2" class="outline-3">
<h3 id="sec-20-2">Applicatives are too restrictive, breaking Applicatives and introducing Functional Builders <a href="http://sadache.tumblr.com/post/30955704987/applicatives-are-too-restrictive-breaking-applicatives">http://sadache.tumblr.com/post/30955704987/applicatives-are-too-restrictive-breaking-applicatives</a></h3>
<div class="outline-text-3" id="text-20-2">

</div>

</div>

<div id="outline-container-20-3" class="outline-3">
<h3 id="sec-20-3">Composing Type classes <a href="http://scalapenos.com/2013/07/11/composing-type-classes.html">http://scalapenos.com/2013/07/11/composing-type-classes.html</a></h3>
<div class="outline-text-3" id="text-20-3">

</div>

</div>

<div id="outline-container-20-4" class="outline-3">
<h3 id="sec-20-4">Designing scala librairies (slides) <a href="http://scalapenos.com/2013/04/26/scala-presentation.html">http://scalapenos.com/2013/04/26/scala-presentation.html</a></h3>
<div class="outline-text-3" id="text-20-4">

</div>

</div>

<div id="outline-container-20-5" class="outline-3">
<h3 id="sec-20-5">Ztream is POC P2P-assisted Web music streaming built with WebRTC, Media Source API, AngularJS, Play, ReactiveMongo <a href="http://ztream.atamborrino.cloudbees.net/">http://ztream.atamborrino.cloudbees.net/</a></h3>
<div class="outline-text-3" id="text-20-5">

</div>

</div>
