toread.org
**  easy to write MapReduce jobs in Hadoop on top of cascading https://github.com/twitter/scalding/wiki
** Gabbler, a Reactive Chat App – part 2 by hseeberger http://hseeberger.github.io/blog/2013/07/10/gabbler-part2/
** Abstract Algebra for Scala https://github.com/twitter/algebird
 approximate set size (in much less memory with HyperLogLog), approximate item counting (using CountMinSketch)
** Play angularjs elasticsearch http://responsiblysourced.wordpress.com/2013/07/08/reactive-real-time-log-search-with-play-akka-angularjs-and-elasticsearch/
** scala event sourcing http://jonasboner.com/2009/02/12/event-sourcing-using-actors/
** Jscala blog 
** Twitter-server http://twitter.github.io/twitter-server/
** Odersky Talk Devoox Paris 2013 http://parleys.com/play/51704efce4b095cc56d8d4b5/chapter0/about
http://cdn.parleys.com/p/51704efce4b095cc56d8d4b5/51700fa4a360c_1366298459509.pdf
** Hack scala CLI http://dev.bizo.com/2013/04/scala-command-line-hacks.html
** Programmer Fast Track in Atomic Scala book http://www.atomicscala.com/
* javascript
** Roundup of HTML-Based Slide Deck Toolkits http://www.impressivewebs.com/html-slidedeck-toolkits/
   - fathomjs http://markdalgleish.com/projects/fathom/
   - csss
   - 5lide
   - reveal.js 
   - slidedown http://nakajima.github.com/slidedown/#0
   - impressjs (inspired by prezi.com)
   - dzslides 
   - jmpressjs http://jmpressjs.github.io/jmpress.js/examples/automatic-layout/
** json editor http://jsonlint.com/
** angularjs
*** angular-js tips http://joelhooks.com/blog/2013/05/22/lessons-learned-kicking-off-an-angularjs-project/
*** angularjs for big apps http://briantford.com/blog/huuuuuge-angular-apps.html
*** http://blog.appfog.com/angularjs-the-beauty-of-concision/
*** http://angular-tips.com/blog/2013/08/why-does-angular-dot-js-rock/
** deploy JS apps http://alexsexton.com/blog/2013/03/deploying-javascript-applications/
** JavaScript Library for Mobile-Friendly Interactive Maps http://leafletjs.com/
** Editor scripted https://github.com/scripted-editor/scripted
http://blog.cloudfoundry.org/2012/10/11/using-the-new-scripted-javascript-editor-for-node-js-development/
* Algo
** Dijkstra's Algorithm as a Sequence (clojure implementation) http://hueypetersen.com/posts/2013/07/09/dijkstra-as-a-sequence/
** search algorithms in vizu http://qiao.github.io/PathFinding.js https://github.com/qiao/PathFinding.js
** Create perfect maze : Eller's Algorithm  http://www.neocomputer.org/projects/eller.html
**  Purely Functional Data Structures in clj http://www.leonardoborges.com/writings/2013/02/03/purely-functional-data-structures-in-clojure-leftist-heaps/
** http://java.dzone.com/articles/algorithm-week-aho-corasick
** blog http://jonisalonen.com/
http://jonisalonen.com/2013/mathematical-foundations-of-computer-integers/ http://jonisalonen.com/2013/why-we-use-2s-complement/
** Implementations of Monoids for interesting approximation algorithms, such as Bloom filter, HyperLogLog and CountMinSketch https://github.com/twitter/algebird
** http://craftsmanship.sv.cmu.edu/exercises/coin-change-kata
** http://www.michael-noll.com/blog/2013/01/18/implementing-real-time-trending-topics-in-storm/ in storm
** http://architects.dzone.com/articles/algorithm-week-multiplication-0 Kruskal algo in ruby
** algo feeds http://architects.dzone.com/category/dzone-taxonomy/computer-science/algorithms
** Multivariate Change of Variables in Integration Theorem (MCVIT, that’s a mouthful http://onehappybird.com/2012/12/03/whats-the-most-important-theorem/
** Pascal's Triangle http://www.mathsisfun.com/pascals-triangle.html http://en.wikipedia.org/wiki/Pascal's_triangle
** Math ∩ Programming A place for elegant solutions http://jeremykun.com/2013/01/22/depth-and-breadth-first-search/
** Dijkstra algo http://www.nimbustier.net/publications/djikstra/djikstra.html
