toread.html

<div id="outline-container-20-6" class="outline-3">
<h3 id="sec-20-6">easy to write MapReduce jobs in Hadoop on top of cascading <a href="https://github.com/twitter/scalding/wiki">https://github.com/twitter/scalding/wiki</a></h3>
<div class="outline-text-3" id="text-20-6">

</div>

</div>

<div id="outline-container-20-7" class="outline-3">
<h3 id="sec-20-7">Gabbler, a Reactive Chat App – part 2 by hseeberger <a href="http://hseeberger.github.io/blog/2013/07/10/gabbler-part2/">http://hseeberger.github.io/blog/2013/07/10/gabbler-part2/</a></h3>
<div class="outline-text-3" id="text-20-7">

</div>

</div>

<div id="outline-container-20-8" class="outline-3">
<h3 id="sec-20-8">Abstract Algebra for Scala <a href="https://github.com/twitter/algebird">https://github.com/twitter/algebird</a></h3>
<div class="outline-text-3" id="text-20-8">

<p> approximate set size (in much less memory with HyperLogLog), approximate item counting (using CountMinSketch)
</p></div>

</div>

<div id="outline-container-20-9" class="outline-3">
<h3 id="sec-20-9">Play angularjs elasticsearch <a href="http://responsiblysourced.wordpress.com/2013/07/08/reactive-real-time-log-search-with-play-akka-angularjs-and-elasticsearch/">http://responsiblysourced.wordpress.com/2013/07/08/reactive-real-time-log-search-with-play-akka-angularjs-and-elasticsearch/</a></h3>
<div class="outline-text-3" id="text-20-9">

</div>

</div>

<div id="outline-container-20-10" class="outline-3">
<h3 id="sec-20-10">scala event sourcing <a href="http://jonasboner.com/2009/02/12/event-sourcing-using-actors/">http://jonasboner.com/2009/02/12/event-sourcing-using-actors/</a></h3>
<div class="outline-text-3" id="text-20-10">

</div>

</div>

<div id="outline-container-20-11" class="outline-3">
<h3 id="sec-20-11">Jscala blog</h3>
<div class="outline-text-3" id="text-20-11">

</div>

</div>

<div id="outline-container-20-12" class="outline-3">
<h3 id="sec-20-12">Twitter-server <a href="http://twitter.github.io/twitter-server/">http://twitter.github.io/twitter-server/</a></h3>
<div class="outline-text-3" id="text-20-12">

</div>

</div>

<div id="outline-container-20-13" class="outline-3">
<h3 id="sec-20-13">Odersky Talk Devoox Paris 2013 <a href="http://parleys.com/play/51704efce4b095cc56d8d4b5/chapter0/about">http://parleys.com/play/51704efce4b095cc56d8d4b5/chapter0/about</a></h3>
<div class="outline-text-3" id="text-20-13">

<p><a href="http://cdn.parleys.com/p/51704efce4b095cc56d8d4b5/51700fa4a360c_1366298459509.pdf">http://cdn.parleys.com/p/51704efce4b095cc56d8d4b5/51700fa4a360c_1366298459509.pdf</a>
</p></div>

</div>

<div id="outline-container-20-14" class="outline-3">
<h3 id="sec-20-14">Hack scala CLI <a href="http://dev.bizo.com/2013/04/scala-command-line-hacks.html">http://dev.bizo.com/2013/04/scala-command-line-hacks.html</a></h3>
<div class="outline-text-3" id="text-20-14">

</div>

</div>

<div id="outline-container-20-15" class="outline-3">
<h3 id="sec-20-15">Programmer Fast Track in Atomic Scala book <a href="http://www.atomicscala.com/">http://www.atomicscala.com/</a></h3>
<div class="outline-text-3" id="text-20-15">

</div>
</div>

</div>

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21">javascript</h2>
<div class="outline-text-2" id="text-21">


</div>

<div id="outline-container-21-1" class="outline-3">
<h3 id="sec-21-1">Roundup of HTML-Based Slide Deck Toolkits <a href="http://www.impressivewebs.com/html-slidedeck-toolkits/">http://www.impressivewebs.com/html-slidedeck-toolkits/</a></h3>
<div class="outline-text-3" id="text-21-1">

<ul>
<li>fathomjs <a href="http://markdalgleish.com/projects/fathom/">http://markdalgleish.com/projects/fathom/</a>
</li>
<li>csss
</li>
<li>5lide
</li>
<li>reveal.js 
</li>
<li>slidedown <a href="http://nakajima.github.com/slidedown/#0">http://nakajima.github.com/slidedown/#0</a>
</li>
<li>impressjs (inspired by prezi.com)
</li>
<li>dzslides 
</li>
<li>jmpressjs <a href="http://jmpressjs.github.io/jmpress.js/examples/automatic-layout/">http://jmpressjs.github.io/jmpress.js/examples/automatic-layout/</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-21-2" class="outline-3">
<h3 id="sec-21-2">json editor <a href="http://jsonlint.com/">http://jsonlint.com/</a></h3>
<div class="outline-text-3" id="text-21-2">

</div>

</div>

<div id="outline-container-21-3" class="outline-3">
<h3 id="sec-21-3">angularjs</h3>
<div class="outline-text-3" id="text-21-3">


</div>

<div id="outline-container-21-3-1" class="outline-4">
<h4 id="sec-21-3-1">angular-js tips <a href="http://joelhooks.com/blog/2013/05/22/lessons-learned-kicking-off-an-angularjs-project/">http://joelhooks.com/blog/2013/05/22/lessons-learned-kicking-off-an-angularjs-project/</a></h4>
<div class="outline-text-4" id="text-21-3-1">

</div>

</div>

<div id="outline-container-21-3-2" class="outline-4">
<h4 id="sec-21-3-2">angularjs for big apps <a href="http://briantford.com/blog/huuuuuge-angular-apps.html">http://briantford.com/blog/huuuuuge-angular-apps.html</a></h4>
<div class="outline-text-4" id="text-21-3-2">

</div>

</div>

<div id="outline-container-21-3-3" class="outline-4">
<h4 id="sec-21-3-3"><a href="http://blog.appfog.com/angularjs-the-beauty-of-concision/">http://blog.appfog.com/angularjs-the-beauty-of-concision/</a></h4>
<div class="outline-text-4" id="text-21-3-3">

</div>

</div>

<div id="outline-container-21-3-4" class="outline-4">
<h4 id="sec-21-3-4"><a href="http://angular-tips.com/blog/2013/08/why-does-angular-dot-js-rock/">http://angular-tips.com/blog/2013/08/why-does-angular-dot-js-rock/</a></h4>
<div class="outline-text-4" id="text-21-3-4">

</div>
</div>

</div>

<div id="outline-container-21-4" class="outline-3">
<h3 id="sec-21-4">deploy JS apps <a href="http://alexsexton.com/blog/2013/03/deploying-javascript-applications/">http://alexsexton.com/blog/2013/03/deploying-javascript-applications/</a></h3>
<div class="outline-text-3" id="text-21-4">

</div>

</div>

<div id="outline-container-21-5" class="outline-3">
<h3 id="sec-21-5">JavaScript Library for Mobile-Friendly Interactive Maps <a href="http://leafletjs.com/">http://leafletjs.com/</a></h3>
<div class="outline-text-3" id="text-21-5">

</div>

</div>

<div id="outline-container-21-6" class="outline-3">
<h3 id="sec-21-6">Editor scripted <a href="https://github.com/scripted-editor/scripted">https://github.com/scripted-editor/scripted</a></h3>
<div class="outline-text-3" id="text-21-6">

<p><a href="http://blog.cloudfoundry.org/2012/10/11/using-the-new-scripted-javascript-editor-for-node-js-development/">http://blog.cloudfoundry.org/2012/10/11/using-the-new-scripted-javascript-editor-for-node-js-development/</a>
</p></div>
</div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22">Algo</h2>
<div class="outline-text-2" id="text-22">


</div>

<div id="outline-container-22-1" class="outline-3">
<h3 id="sec-22-1">Dijkstra's Algorithm as a Sequence (clojure implementation) <a href="http://hueypetersen.com/posts/2013/07/09/dijkstra-as-a-sequence/">http://hueypetersen.com/posts/2013/07/09/dijkstra-as-a-sequence/</a></h3>
<div class="outline-text-3" id="text-22-1">

</div>

</div>

<div id="outline-container-22-2" class="outline-3">
<h3 id="sec-22-2">search algorithms in vizu <a href="http://qiao.github.io/PathFinding.js">http://qiao.github.io/PathFinding.js</a> <a href="https://github.com/qiao/PathFinding.js">https://github.com/qiao/PathFinding.js</a></h3>
<div class="outline-text-3" id="text-22-2">

</div>

</div>

<div id="outline-container-22-3" class="outline-3">
<h3 id="sec-22-3">Create perfect maze : Eller's Algorithm  <a href="http://www.neocomputer.org/projects/eller.html">http://www.neocomputer.org/projects/eller.html</a></h3>
<div class="outline-text-3" id="text-22-3">

</div>

</div>

<div id="outline-container-22-4" class="outline-3">
<h3 id="sec-22-4">Purely Functional Data Structures in clj <a href="http://www.leonardoborges.com/writings/2013/02/03/purely-functional-data-structures-in-clojure-leftist-heaps/">http://www.leonardoborges.com/writings/2013/02/03/purely-functional-data-structures-in-clojure-leftist-heaps/</a></h3>
<div class="outline-text-3" id="text-22-4">

</div>

</div>

<div id="outline-container-22-5" class="outline-3">
<h3 id="sec-22-5"><a href="http://java.dzone.com/articles/algorithm-week-aho-corasick">http://java.dzone.com/articles/algorithm-week-aho-corasick</a></h3>
<div class="outline-text-3" id="text-22-5">

</div>

</div>

<div id="outline-container-22-6" class="outline-3">
<h3 id="sec-22-6">blog <a href="http://jonisalonen.com/">http://jonisalonen.com/</a></h3>
<div class="outline-text-3" id="text-22-6">

<p><a href="http://jonisalonen.com/2013/mathematical-foundations-of-computer-integers/">http://jonisalonen.com/2013/mathematical-foundations-of-computer-integers/</a> <a href="http://jonisalonen.com/2013/why-we-use-2s-complement/">http://jonisalonen.com/2013/why-we-use-2s-complement/</a>
</p></div>

</div>

<div id="outline-container-22-7" class="outline-3">
<h3 id="sec-22-7">Implementations of Monoids for interesting approximation algorithms, such as Bloom filter, HyperLogLog and CountMinSketch <a href="https://github.com/twitter/algebird">https://github.com/twitter/algebird</a></h3>
<div class="outline-text-3" id="text-22-7">

</div>

</div>

<div id="outline-container-22-8" class="outline-3">
<h3 id="sec-22-8"><a href="http://craftsmanship.sv.cmu.edu/exercises/coin-change-kata">http://craftsmanship.sv.cmu.edu/exercises/coin-change-kata</a></h3>
<div class="outline-text-3" id="text-22-8">

</div>

</div>

<div id="outline-container-22-9" class="outline-3">
<h3 id="sec-22-9"><a href="http://www.michael-noll.com/blog/2013/01/18/implementing-real-time-trending-topics-in-storm/">http://www.michael-noll.com/blog/2013/01/18/implementing-real-time-trending-topics-in-storm/</a> in storm</h3>
<div class="outline-text-3" id="text-22-9">

</div>

</div>

<div id="outline-container-22-10" class="outline-3">
<h3 id="sec-22-10"><a href="http://architects.dzone.com/articles/algorithm-week-multiplication-0">http://architects.dzone.com/articles/algorithm-week-multiplication-0</a> Kruskal algo in ruby</h3>
<div class="outline-text-3" id="text-22-10">

</div>

</div>

<div id="outline-container-22-11" class="outline-3">
<h3 id="sec-22-11">algo feeds <a href="http://architects.dzone.com/category/dzone-taxonomy/computer-science/algorithms">http://architects.dzone.com/category/dzone-taxonomy/computer-science/algorithms</a></h3>
<div class="outline-text-3" id="text-22-11">

</div>

</div>

<div id="outline-container-22-12" class="outline-3">
<h3 id="sec-22-12">Multivariate Change of Variables in Integration Theorem (MCVIT, that’s a mouthful <a href="http://onehappybird.com/2012/12/03/whats-the-most-important-theorem/">http://onehappybird.com/2012/12/03/whats-the-most-important-theorem/</a></h3>
<div class="outline-text-3" id="text-22-12">

</div>

</div>

<div id="outline-container-22-13" class="outline-3">
<h3 id="sec-22-13">Pascal's Triangle <a href="http://www.mathsisfun.com/pascals-triangle.html">http://www.mathsisfun.com/pascals-triangle.html</a> <a href="http://en.wikipedia.org/wiki/Pascal's_triangle">http://en.wikipedia.org/wiki/Pascal's_triangle</a></h3>
<div class="outline-text-3" id="text-22-13">

</div>

</div>

<div id="outline-container-22-14" class="outline-3">
<h3 id="sec-22-14">Math ∩ Programming A place for elegant solutions <a href="http://jeremykun.com/2013/01/22/depth-and-breadth-first-search/">http://jeremykun.com/2013/01/22/depth-and-breadth-first-search/</a></h3>
<div class="outline-text-3" id="text-22-14">

</div>

</div>

<div id="outline-container-22-15" class="outline-3">
<h3 id="sec-22-15">Dijkstra algo <a href="http://www.nimbustier.net/publications/djikstra/djikstra.html">http://www.nimbustier.net/publications/djikstra/djikstra.html</a></h3>
<div class="outline-text-3" id="text-22-15">

</div>

</div>
