toread.org
** search algo astar  http://clj-me.cgrand.net/2010/09/04/a-in-clojure/ https://github.com/aria42/mochi/blob/master/src/mochi/search.clj
** http://awelonblue.wordpress.com/2013/01/24/exponential-decay-of-history-improved/ @cgrand implementation https://gist.github.com/cgrand/4722914
Exponential decay of history is a pattern that competes with ring-buffers, least-recently-used heuristics,
and other techniques that represent historical information in a limited space.
** data mining top 10 algos http://www.cs.uvm.edu/~icdm/algorithms/10Algorithms-08.pdf
** spam filtering algo http://airccse.org/journal/jcsit/0211ijcsit12.pdf
** multi bandit algo  http://www.chrisstucchio.com/blog/2012/bandit_algorithms_vs_ab.html
http://fr.wikipedia.org/wiki/Test_A/B  http://oobaloo.co.uk/multi-armed-bandit-optimisation-in-clojure
John Myles White talk vimeo.com/54970619
http://www.feynmanlectures.info/exercises/Feynmans_restaurant_problem.html
* Math
** Data Driven: The New Big Science https://www.simonsfoundation.org/quanta/20131004-the-mathematical-shape-of-things-to-come/
Topologic Data Analysis , NBA example (Ayasdi)
** Probability (Theory) Tutorials by Noel Vaillant http://www.probability.net/
** Classical Mechanics: A Computational Approach by Jack Wisdom Gerald Jay Sussman  http://groups.csail.mit.edu/mac/users/gjs/6946/
** Counting selections with replacement ((n k)) http://www.johndcook.com/select_with_replacement.html
** The theorems of Frobenius and Suzuki on finite groups by Terence Tao http://terrytao.wordpress.com/2013/04/12/the-theorems-of-frobenius-and-suzuki-on-finite-groups/
** The Probabilistic Method : How many lights can you turn on? http://www.johndcook.com/blog/2013/06/04/how-many-lights-can-you-turn-on/
** Blog I wasnt prepared to work http://symbo1ics.com/blog/?p=1803
** Bezier curves and Picasso http://jeremykun.com/2013/05/11/bezier-curves-and-picasso/
** Week in Number Theory http://blogs.ams.org/blogonmathblogs/2013/05/16/week-in-number-theory/
** Goldback variations http://blogs.scientificamerican.com/roots-of-unity/2013/05/15/goldbach-variations/
** Math Primer for programmers http://jeremykun.com/primers/
** Math with Bad Drawings : blog http://mathwithbaddrawings.com/
** Graph Partitioning and Expanders http://venture-lab.stanford.edu/expanders
algorithms for graph partitioning and clustering, constructions of expander graphs, and analysis of random walks
** blog Norman Wildberger http://njwildberger.wordpress.com
** Type Theory http://golem.ph.utexas.edu/category/2013/01/from_set_theory_to_type_theory.html
** The Life and Times of the Central Limit Theorem (History of Mathematics) William J. Adams
** topology optimisation http://jordanburgess.com/post/41386795824/topology-optimisation
** linear algebra http://ocw.mit.edu/courses/mathematics/18-06-linear-algebra-spring-2010/video-lectures/
** bayes rule http://oscarbonilla.com/2009/05/visualizing-bayes-theorem/
** Vedic maths http://www.hinduism.co.za/vedic.htm http://www.vedicmaths.org/Home%20Page.asp
http://www.vedicmaths.org/Bookstores/Manual%201.pdf
** divine proportion http://web.maths.unsw.edu.au/~norman/
The new form of trigonometry developed here is called rational trigonometry, to
distinguish it from classical trigonometry, the latter involving cos θ, sin θ and the many
trigonometric relations currently taught to students. An essential point of rational
trigonometry is that quadrance and spread, not distance and angle, are the right
concepts for metrical geometry (i.e. a geometry in which measurement
is involved).
* AI 
** Hacking Robot http://www.instructables.com/id/Hacking-Your-iRobot/ 
** Robopedia http://www.robotappstore.com/Robopedia/
** OSCON 2013: Carin Meier "The Joy of Flying Robots with Clojure" http://www.youtube.com/watch?v=Ty9QDqV-_Ak with roomba, drone https://github.com/gigasquid/clj-drone
https://github.com/gigasquid/roomba-drone-friends
* UI
** http://www.uie.com/brainsparks/ http://www.esri.com/events/devsummit/agenda/keynote
** APIs: The Future Is Now http://www.uie.com/articles/api_future/
* Category theory in practice
**  http://www.philandstuff.com/2011/10/25/learning-monads-in-clojure-a-warning.html
** category theoretic approach to optimizing MapReduce-like pipelines http://blog.ezyang.com/2013/05/category-theory-for-loop-optimizations/
