toread.html

<div id="outline-container-22-16" class="outline-3">
<h3 id="sec-22-16">search algo astar  <a href="http://clj-me.cgrand.net/2010/09/04/a-in-clojure/">http://clj-me.cgrand.net/2010/09/04/a-in-clojure/</a> <a href="https://github.com/aria42/mochi/blob/master/src/mochi/search.clj">https://github.com/aria42/mochi/blob/master/src/mochi/search.clj</a></h3>
<div class="outline-text-3" id="text-22-16">

</div>

</div>

<div id="outline-container-22-17" class="outline-3">
<h3 id="sec-22-17"><a href="http://awelonblue.wordpress.com/2013/01/24/exponential-decay-of-history-improved/">http://awelonblue.wordpress.com/2013/01/24/exponential-decay-of-history-improved/</a> @cgrand implementation <a href="https://gist.github.com/cgrand/4722914">https://gist.github.com/cgrand/4722914</a></h3>
<div class="outline-text-3" id="text-22-17">

<p>Exponential decay of history is a pattern that competes with ring-buffers, least-recently-used heuristics,
and other techniques that represent historical information in a limited space.
</p></div>

</div>

<div id="outline-container-22-18" class="outline-3">
<h3 id="sec-22-18">data mining top 10 algos <a href="http://www.cs.uvm.edu/~icdm/algorithms/10Algorithms-08.pdf">http://www.cs.uvm.edu/~icdm/algorithms/10Algorithms-08.pdf</a></h3>
<div class="outline-text-3" id="text-22-18">

</div>

</div>

<div id="outline-container-22-19" class="outline-3">
<h3 id="sec-22-19">spam filtering algo <a href="http://airccse.org/journal/jcsit/0211ijcsit12.pdf">http://airccse.org/journal/jcsit/0211ijcsit12.pdf</a></h3>
<div class="outline-text-3" id="text-22-19">

</div>

</div>

<div id="outline-container-22-20" class="outline-3">
<h3 id="sec-22-20">multi bandit algo  <a href="http://www.chrisstucchio.com/blog/2012/bandit_algorithms_vs_ab.html">http://www.chrisstucchio.com/blog/2012/bandit_algorithms_vs_ab.html</a></h3>
<div class="outline-text-3" id="text-22-20">

<p><a href="http://fr.wikipedia.org/wiki/Test_A/B">http://fr.wikipedia.org/wiki/Test_A/B</a>  <a href="http://oobaloo.co.uk/multi-armed-bandit-optimisation-in-clojure">http://oobaloo.co.uk/multi-armed-bandit-optimisation-in-clojure</a>
John Myles White talk vimeo.com/54970619
<a href="http://www.feynmanlectures.info/exercises/Feynmans_restaurant_problem.html">http://www.feynmanlectures.info/exercises/Feynmans_restaurant_problem.html</a>
</p></div>
</div>

</div>

<div id="outline-container-23" class="outline-2">
<h2 id="sec-23">Math</h2>
<div class="outline-text-2" id="text-23">


</div>

<div id="outline-container-23-1" class="outline-3">
<h3 id="sec-23-1">Probability (Theory) Tutorials by Noel Vaillant <a href="http://www.probability.net/">http://www.probability.net/</a></h3>
<div class="outline-text-3" id="text-23-1">

</div>

</div>

<div id="outline-container-23-2" class="outline-3">
<h3 id="sec-23-2">Classical Mechanics: A Computational Approach by Jack Wisdom Gerald Jay Sussman  <a href="http://groups.csail.mit.edu/mac/users/gjs/6946/">http://groups.csail.mit.edu/mac/users/gjs/6946/</a></h3>
<div class="outline-text-3" id="text-23-2">

</div>

</div>

<div id="outline-container-23-3" class="outline-3">
<h3 id="sec-23-3">Counting selections with replacement ((n k)) <a href="http://www.johndcook.com/select_with_replacement.html">http://www.johndcook.com/select_with_replacement.html</a></h3>
<div class="outline-text-3" id="text-23-3">

</div>

</div>

<div id="outline-container-23-4" class="outline-3">
<h3 id="sec-23-4">The theorems of Frobenius and Suzuki on finite groups by Terence Tao <a href="http://terrytao.wordpress.com/2013/04/12/the-theorems-of-frobenius-and-suzuki-on-finite-groups/">http://terrytao.wordpress.com/2013/04/12/the-theorems-of-frobenius-and-suzuki-on-finite-groups/</a></h3>
<div class="outline-text-3" id="text-23-4">

</div>

</div>

<div id="outline-container-23-5" class="outline-3">
<h3 id="sec-23-5">The Probabilistic Method : How many lights can you turn on? <a href="http://www.johndcook.com/blog/2013/06/04/how-many-lights-can-you-turn-on/">http://www.johndcook.com/blog/2013/06/04/how-many-lights-can-you-turn-on/</a></h3>
<div class="outline-text-3" id="text-23-5">

</div>

</div>

<div id="outline-container-23-6" class="outline-3">
<h3 id="sec-23-6">Blog I wasnt prepared to work <a href="http://symbo1ics.com/blog/?p=1803">http://symbo1ics.com/blog/?p=1803</a></h3>
<div class="outline-text-3" id="text-23-6">

</div>

</div>

<div id="outline-container-23-7" class="outline-3">
<h3 id="sec-23-7">Bezier curves and Picasso <a href="http://jeremykun.com/2013/05/11/bezier-curves-and-picasso/">http://jeremykun.com/2013/05/11/bezier-curves-and-picasso/</a></h3>
<div class="outline-text-3" id="text-23-7">

</div>

</div>

<div id="outline-container-23-8" class="outline-3">
<h3 id="sec-23-8">Week in Number Theory <a href="http://blogs.ams.org/blogonmathblogs/2013/05/16/week-in-number-theory/">http://blogs.ams.org/blogonmathblogs/2013/05/16/week-in-number-theory/</a></h3>
<div class="outline-text-3" id="text-23-8">

</div>

</div>

<div id="outline-container-23-9" class="outline-3">
<h3 id="sec-23-9">Goldback variations <a href="http://blogs.scientificamerican.com/roots-of-unity/2013/05/15/goldbach-variations/">http://blogs.scientificamerican.com/roots-of-unity/2013/05/15/goldbach-variations/</a></h3>
<div class="outline-text-3" id="text-23-9">

</div>

</div>

<div id="outline-container-23-10" class="outline-3">
<h3 id="sec-23-10">Math Primer for programmers <a href="http://jeremykun.com/primers/">http://jeremykun.com/primers/</a></h3>
<div class="outline-text-3" id="text-23-10">

</div>

</div>

<div id="outline-container-23-11" class="outline-3">
<h3 id="sec-23-11">Math with Bad Drawings : blog <a href="http://mathwithbaddrawings.com/">http://mathwithbaddrawings.com/</a></h3>
<div class="outline-text-3" id="text-23-11">

</div>

</div>

<div id="outline-container-23-12" class="outline-3">
<h3 id="sec-23-12">Graph Partitioning and Expanders <a href="http://venture-lab.stanford.edu/expanders">http://venture-lab.stanford.edu/expanders</a></h3>
<div class="outline-text-3" id="text-23-12">

<p>algorithms for graph partitioning and clustering, constructions of expander graphs, and analysis of random walks
</p></div>

</div>

<div id="outline-container-23-13" class="outline-3">
<h3 id="sec-23-13">blog Norman Wildberger <a href="http://njwildberger.wordpress.com">http://njwildberger.wordpress.com</a></h3>
<div class="outline-text-3" id="text-23-13">

</div>

</div>

<div id="outline-container-23-14" class="outline-3">
<h3 id="sec-23-14">Type Theory <a href="http://golem.ph.utexas.edu/category/2013/01/from_set_theory_to_type_theory.html">http://golem.ph.utexas.edu/category/2013/01/from_set_theory_to_type_theory.html</a></h3>
<div class="outline-text-3" id="text-23-14">

</div>

</div>

<div id="outline-container-23-15" class="outline-3">
<h3 id="sec-23-15">The Life and Times of the Central Limit Theorem (History of Mathematics) William J. Adams</h3>
<div class="outline-text-3" id="text-23-15">

</div>

</div>

<div id="outline-container-23-16" class="outline-3">
<h3 id="sec-23-16">topology optimisation <a href="http://jordanburgess.com/post/41386795824/topology-optimisation">http://jordanburgess.com/post/41386795824/topology-optimisation</a></h3>
<div class="outline-text-3" id="text-23-16">

</div>

</div>

<div id="outline-container-23-17" class="outline-3">
<h3 id="sec-23-17">linear algebra <a href="http://ocw.mit.edu/courses/mathematics/18-06-linear-algebra-spring-2010/video-lectures/">http://ocw.mit.edu/courses/mathematics/18-06-linear-algebra-spring-2010/video-lectures/</a></h3>
<div class="outline-text-3" id="text-23-17">

</div>

</div>

<div id="outline-container-23-18" class="outline-3">
<h3 id="sec-23-18">bayes rule <a href="http://oscarbonilla.com/2009/05/visualizing-bayes-theorem/">http://oscarbonilla.com/2009/05/visualizing-bayes-theorem/</a></h3>
<div class="outline-text-3" id="text-23-18">

</div>

</div>

<div id="outline-container-23-19" class="outline-3">
<h3 id="sec-23-19">Vedic maths <a href="http://www.hinduism.co.za/vedic.htm">http://www.hinduism.co.za/vedic.htm</a> <a href="http://www.vedicmaths.org/Home Page.asp">http://www.vedicmaths.org/Home%20Page.asp</a></h3>
<div class="outline-text-3" id="text-23-19">

<p><a href="http://www.vedicmaths.org/Bookstores/Manual 1.pdf">http://www.vedicmaths.org/Bookstores/Manual%201.pdf</a>
</p></div>

</div>

<div id="outline-container-23-20" class="outline-3">
<h3 id="sec-23-20">divine proportion <a href="http://web.maths.unsw.edu.au/~norman/">http://web.maths.unsw.edu.au/~norman/</a></h3>
<div class="outline-text-3" id="text-23-20">

<p>The new form of trigonometry developed here is called rational trigonometry, to
distinguish it from classical trigonometry, the latter involving cos θ, sin θ and the many
trigonometric relations currently taught to students. An essential point of rational
trigonometry is that quadrance and spread, not distance and angle, are the right
concepts for metrical geometry (i.e. a geometry in which measurement
is involved).
</p></div>
</div>

</div>

<div id="outline-container-24" class="outline-2">
<h2 id="sec-24">AI</h2>
<div class="outline-text-2" id="text-24">


</div>

<div id="outline-container-24-1" class="outline-3">
<h3 id="sec-24-1">Hacking Robot <a href="http://www.instructables.com/id/Hacking-Your-iRobot/">http://www.instructables.com/id/Hacking-Your-iRobot/</a></h3>
<div class="outline-text-3" id="text-24-1">

</div>

</div>

<div id="outline-container-24-2" class="outline-3">
<h3 id="sec-24-2">Robopedia <a href="http://www.robotappstore.com/Robopedia/">http://www.robotappstore.com/Robopedia/</a></h3>
<div class="outline-text-3" id="text-24-2">

</div>

</div>

<div id="outline-container-24-3" class="outline-3">
<h3 id="sec-24-3">OSCON 2013: Carin Meier "The Joy of Flying Robots with Clojure" <a href="http://www.youtube.com/watch?v=Ty9QDqV-_Ak">http://www.youtube.com/watch?v=Ty9QDqV-_Ak</a> with roomba, drone <a href="https://github.com/gigasquid/clj-drone">https://github.com/gigasquid/clj-drone</a></h3>
<div class="outline-text-3" id="text-24-3">

<p><a href="https://github.com/gigasquid/roomba-drone-friends">https://github.com/gigasquid/roomba-drone-friends</a>
</p></div>
</div>

</div>

<div id="outline-container-25" class="outline-2">
<h2 id="sec-25">UI</h2>
<div class="outline-text-2" id="text-25">


</div>

<div id="outline-container-25-1" class="outline-3">
<h3 id="sec-25-1"><a href="http://www.uie.com/brainsparks/">http://www.uie.com/brainsparks/</a> <a href="http://www.esri.com/events/devsummit/agenda/keynote">http://www.esri.com/events/devsummit/agenda/keynote</a></h3>
<div class="outline-text-3" id="text-25-1">

</div>

</div>

<div id="outline-container-25-2" class="outline-3">
<h3 id="sec-25-2">APIs: The Future Is Now <a href="http://www.uie.com/articles/api_future/">http://www.uie.com/articles/api_future/</a></h3>
<div class="outline-text-3" id="text-25-2">

</div>
</div>

</div>

<div id="outline-container-26" class="outline-2">
<h2 id="sec-26">Category theory in practice</h2>
<div class="outline-text-2" id="text-26">


</div>

<div id="outline-container-26-1" class="outline-3">
<h3 id="sec-26-1">category theoretic approach to optimizing MapReduce-like pipelines <a href="http://blog.ezyang.com/2013/05/category-theory-for-loop-optimizations/">http://blog.ezyang.com/2013/05/category-theory-for-loop-optimizations/</a></h3>
<div class="outline-text-3" id="text-26-1">

</div>

</div>
