toread.org
** You Could Have Invented Monads! (And Maybe You Already Have.) http://blog.sigfpe.com/2006/08/you-could-have-invented-monads-and.html?m=1
** jim duey article on functors https://github.com/jduey/Functors http://www.clojure.net/2013/01/19/Functors
**  monad http://www.clojure.net/2012/06/03/Monad-Protocols
** monad in python http://www.infoq.com/presentations/Monads-Code http://www.dustingetz.com/2012/10/07/monads-in-python-identity-maybe-error
** cat & glory http://yogsototh.github.io/Category-Theory-Presentation/#slide-2
** monads in picture http://adit.io/posts/2013-04-17-functors,_applicatives,_and_monads_in_pictures.html
* Distributed System
** Distributed Systems Archaeology: Works Cited by Michael R. Bernste http://michaelrbernste.in/2013/11/06/distributed-systems-archaeology-works-cited.html
* Messaging
** Call me maybe: Kafka http://aphyr.com/posts/293-call-me-maybe-kafka
** Retrospective on SEDA (July 2010) http://matt-welsh.blogspot.ru/2010/07/retrospective-on-seda.html
** Scaling rabbitMQ @ soundcloud http://www.erlang-factory.com/conference/ErlangUserConference2013/speakers/SebastianOhm
** Parallel approaches in next-generation sequencing analysis pipelines http://bcbio.wordpress.com/2011/09/10/parallel-approaches-in-next-generation-sequencing-analysis-pipelines/
** event sourcing for functional programmers http://danielwestheide.com/talks/flatmap2013/slides/index.html#/ 
** RabbitMQ on the cloud AWS http://www.cloudamqp.com/
** Rabbit farms is a standalone service for publish RabbitMQ messages https://github.com/erlang-china/rabbit_farms
** Rabbitmq vs. kafka http://www.quora.com/RabbitMQ/RabbitMQ-vs-Kafka-which-one-for-durable-messaging-with-good-query-features
   - but clearly large amounts of persistent messages sitting in the broker was not the main design case for AMQP in general."
   - (It's contrasted with Kafka, which is "designed for holding and distributing large volumes of messages"
   -  longer-lived work queues are really more of a Hadoop thing, not an in-memory queue thing

Use Kafka if you have a fire hose of events (100k+/sec) you need delivered in partitioned order 'at least once' with a mix of online and batch consumers,
you want to be able to re-read messages,
you can deal with current limitations around node-level HA (or can use trunk code),
and/or you don't mind supporting incubator-level software yourself via forums/IRC.

Use RabbitMQ if you have messages (20k+/sec) that need to be routed in complex ways to consumers,
you want per-message delivery guarantees,
you don't care about ordered delivery,
you need HA at the cluster-node level now, and/or you need 24x7 paid support in addition to forums/IRC.

** kafka + HDFS at uswitchs http://oobaloo.co.uk/kafka-for-uswitchs-event-pipeline
** kafka papers https://cwiki.apache.org/confluence/display/KAFKA/Kafka+papers+and+presentations
** rabbitmq partition http://next.rabbitmq.com/partitions.html
** Benchmarking http://x-aeon.com/wp/2013/04/10/a-quick-message-queue-benchmark-activemq-rabbitmq-hornetq-qpid-apollo/
** MQTT Mosquito broker http://jpmens.net/2013/02/25/lots-of-messages-mqtt-pub-sub-and-the-mosquitto-broker/
** Choose your messaging protocol http://blogs.vmware.com/vfabric/2013/02/choosing-your-messaging-protocol-amqp-mqtt-or-stomp.html
** rabbitmq use case http://blogs.vmware.com/vfabric/2013/01/messaging-architecture-using-rabbitmq-at-the-worlds-8th-largest-retailer.html
** rabbitmq simulator http://blogs.vmware.com/vfabric/2013/03/introducing-the-rabbitmq-simulator-video-open-source-bits.html
https://github.com/RabbitMQSimulator/RabbitMQSimulator
http://vimeo.com/51363470
** An Express + Socket.io based chat app that uses Redis as session store & RabbitMQ for PubSub https://github.com/rajaraodv/rabbitpubsub
** AMQP http://kellabyte.com/2012/10/20/clarifying-amqp/
