toread.html

<div id="outline-container-26-2" class="outline-3">
<h3 id="sec-26-2">You Could Have Invented Monads! (And Maybe You Already Have.) <a href="http://blog.sigfpe.com/2006/08/you-could-have-invented-monads-and.html?m=1">http://blog.sigfpe.com/2006/08/you-could-have-invented-monads-and.html?m=1</a></h3>
<div class="outline-text-3" id="text-26-2">

</div>

</div>

<div id="outline-container-26-3" class="outline-3">
<h3 id="sec-26-3">jim duey article on functors <a href="https://github.com/jduey/Functors">https://github.com/jduey/Functors</a> <a href="http://www.clojure.net/2013/01/19/Functors">http://www.clojure.net/2013/01/19/Functors</a></h3>
<div class="outline-text-3" id="text-26-3">

</div>

</div>

<div id="outline-container-26-4" class="outline-3">
<h3 id="sec-26-4">monad <a href="http://www.clojure.net/2012/06/03/Monad-Protocols">http://www.clojure.net/2012/06/03/Monad-Protocols</a></h3>
<div class="outline-text-3" id="text-26-4">

</div>

</div>

<div id="outline-container-26-5" class="outline-3">
<h3 id="sec-26-5">monad in python <a href="http://www.infoq.com/presentations/Monads-Code">http://www.infoq.com/presentations/Monads-Code</a> <a href="http://www.dustingetz.com/2012/10/07/monads-in-python-identity-maybe-error">http://www.dustingetz.com/2012/10/07/monads-in-python-identity-maybe-error</a></h3>
<div class="outline-text-3" id="text-26-5">

</div>

</div>

<div id="outline-container-26-6" class="outline-3">
<h3 id="sec-26-6">cat &amp; glory <a href="http://yogsototh.github.io/Category-Theory-Presentation/#slide-2">http://yogsototh.github.io/Category-Theory-Presentation/#slide-2</a></h3>
<div class="outline-text-3" id="text-26-6">

</div>

</div>

<div id="outline-container-26-7" class="outline-3">
<h3 id="sec-26-7">monads in picture <a href="http://adit.io/posts/2013-04-17-functors,_applicatives,_and_monads_in_pictures.html">http://adit.io/posts/2013-04-17-functors,_applicatives,_and_monads_in_pictures.html</a></h3>
<div class="outline-text-3" id="text-26-7">

</div>
</div>

</div>

<div id="outline-container-27" class="outline-2">
<h2 id="sec-27">Messaging</h2>
<div class="outline-text-2" id="text-27">


</div>

<div id="outline-container-27-1" class="outline-3">
<h3 id="sec-27-1">Call me maybe: Kafka <a href="http://aphyr.com/posts/293-call-me-maybe-kafka">http://aphyr.com/posts/293-call-me-maybe-kafka</a></h3>
<div class="outline-text-3" id="text-27-1">

</div>

</div>

<div id="outline-container-27-2" class="outline-3">
<h3 id="sec-27-2">Retrospective on SEDA (July 2010) <a href="http://matt-welsh.blogspot.ru/2010/07/retrospective-on-seda.html">http://matt-welsh.blogspot.ru/2010/07/retrospective-on-seda.html</a></h3>
<div class="outline-text-3" id="text-27-2">

</div>

</div>

<div id="outline-container-27-3" class="outline-3">
<h3 id="sec-27-3">Scaling rabbitMQ @ soundcloud <a href="http://www.erlang-factory.com/conference/ErlangUserConference2013/speakers/SebastianOhm">http://www.erlang-factory.com/conference/ErlangUserConference2013/speakers/SebastianOhm</a></h3>
<div class="outline-text-3" id="text-27-3">

</div>

</div>

<div id="outline-container-27-4" class="outline-3">
<h3 id="sec-27-4">Parallel approaches in next-generation sequencing analysis pipelines <a href="http://bcbio.wordpress.com/2011/09/10/parallel-approaches-in-next-generation-sequencing-analysis-pipelines/">http://bcbio.wordpress.com/2011/09/10/parallel-approaches-in-next-generation-sequencing-analysis-pipelines/</a></h3>
<div class="outline-text-3" id="text-27-4">

</div>

</div>

<div id="outline-container-27-5" class="outline-3">
<h3 id="sec-27-5">event sourcing for functional programmers <a href="http://danielwestheide.com/talks/flatmap2013/slides/index.html#/">http://danielwestheide.com/talks/flatmap2013/slides/index.html#/</a></h3>
<div class="outline-text-3" id="text-27-5">

</div>

</div>

<div id="outline-container-27-6" class="outline-3">
<h3 id="sec-27-6">RabbitMQ on the cloud AWS <a href="http://www.cloudamqp.com/">http://www.cloudamqp.com/</a></h3>
<div class="outline-text-3" id="text-27-6">

</div>

</div>

<div id="outline-container-27-7" class="outline-3">
<h3 id="sec-27-7">Rabbit farms is a standalone service for publish RabbitMQ messages <a href="https://github.com/erlang-china/rabbit_farms">https://github.com/erlang-china/rabbit_farms</a></h3>
<div class="outline-text-3" id="text-27-7">

</div>

</div>

<div id="outline-container-27-8" class="outline-3">
<h3 id="sec-27-8">Rabbitmq vs. kafka <a href="http://www.quora.com/RabbitMQ/RabbitMQ-vs-Kafka-which-one-for-durable-messaging-with-good-query-features">http://www.quora.com/RabbitMQ/RabbitMQ-vs-Kafka-which-one-for-durable-messaging-with-good-query-features</a></h3>
<div class="outline-text-3" id="text-27-8">

<ul>
<li>but clearly large amounts of persistent messages sitting in the broker was not the main design case for AMQP in general."
</li>
<li>(It's contrasted with Kafka, which is "designed for holding and distributing large volumes of messages"
</li>
<li>longer-lived work queues are really more of a Hadoop thing, not an in-memory queue thing
</li>
</ul>


<p>
Use Kafka if you have a fire hose of events (100k+/sec) you need delivered in partitioned order 'at least once' with a mix of online and batch consumers,
you want to be able to re-read messages,
you can deal with current limitations around node-level HA (or can use trunk code),
and/or you don't mind supporting incubator-level software yourself via forums/IRC.
</p>
<p>
Use RabbitMQ if you have messages (20k+/sec) that need to be routed in complex ways to consumers,
you want per-message delivery guarantees,
you don't care about ordered delivery,
you need HA at the cluster-node level now, and/or you need 24x7 paid support in addition to forums/IRC.
</p>
</div>

</div>

<div id="outline-container-27-9" class="outline-3">
<h3 id="sec-27-9">kafka + HDFS at uswitchs <a href="http://oobaloo.co.uk/kafka-for-uswitchs-event-pipeline">http://oobaloo.co.uk/kafka-for-uswitchs-event-pipeline</a></h3>
<div class="outline-text-3" id="text-27-9">

</div>

</div>

<div id="outline-container-27-10" class="outline-3">
<h3 id="sec-27-10">kafka papers <a href="https://cwiki.apache.org/confluence/display/KAFKA/Kafka+papers+and+presentations">https://cwiki.apache.org/confluence/display/KAFKA/Kafka+papers+and+presentations</a></h3>
<div class="outline-text-3" id="text-27-10">

</div>

</div>

<div id="outline-container-27-11" class="outline-3">
<h3 id="sec-27-11">rabbitmq partition <a href="http://next.rabbitmq.com/partitions.html">http://next.rabbitmq.com/partitions.html</a></h3>
<div class="outline-text-3" id="text-27-11">

</div>

</div>

<div id="outline-container-27-12" class="outline-3">
<h3 id="sec-27-12">Benchmarking <a href="http://x-aeon.com/wp/2013/04/10/a-quick-message-queue-benchmark-activemq-rabbitmq-hornetq-qpid-apollo/">http://x-aeon.com/wp/2013/04/10/a-quick-message-queue-benchmark-activemq-rabbitmq-hornetq-qpid-apollo/</a></h3>
<div class="outline-text-3" id="text-27-12">

</div>

</div>

<div id="outline-container-27-13" class="outline-3">
<h3 id="sec-27-13">MQTT Mosquito broker <a href="http://jpmens.net/2013/02/25/lots-of-messages-mqtt-pub-sub-and-the-mosquitto-broker/">http://jpmens.net/2013/02/25/lots-of-messages-mqtt-pub-sub-and-the-mosquitto-broker/</a></h3>
<div class="outline-text-3" id="text-27-13">

</div>

</div>

<div id="outline-container-27-14" class="outline-3">
<h3 id="sec-27-14">Choose your messaging protocol <a href="http://blogs.vmware.com/vfabric/2013/02/choosing-your-messaging-protocol-amqp-mqtt-or-stomp.html">http://blogs.vmware.com/vfabric/2013/02/choosing-your-messaging-protocol-amqp-mqtt-or-stomp.html</a></h3>
<div class="outline-text-3" id="text-27-14">

</div>

</div>

<div id="outline-container-27-15" class="outline-3">
<h3 id="sec-27-15">rabbitmq use case <a href="http://blogs.vmware.com/vfabric/2013/01/messaging-architecture-using-rabbitmq-at-the-worlds-8th-largest-retailer.html">http://blogs.vmware.com/vfabric/2013/01/messaging-architecture-using-rabbitmq-at-the-worlds-8th-largest-retailer.html</a></h3>
<div class="outline-text-3" id="text-27-15">

</div>

</div>

<div id="outline-container-27-16" class="outline-3">
<h3 id="sec-27-16">rabbitmq simulator <a href="http://blogs.vmware.com/vfabric/2013/03/introducing-the-rabbitmq-simulator-video-open-source-bits.html">http://blogs.vmware.com/vfabric/2013/03/introducing-the-rabbitmq-simulator-video-open-source-bits.html</a></h3>
<div class="outline-text-3" id="text-27-16">

<p><a href="https://github.com/RabbitMQSimulator/RabbitMQSimulator">https://github.com/RabbitMQSimulator/RabbitMQSimulator</a>
<a href="http://vimeo.com/51363470">http://vimeo.com/51363470</a>
</p></div>

</div>

<div id="outline-container-27-17" class="outline-3">
<h3 id="sec-27-17">An Express + Socket.io based chat app that uses Redis as session store &amp; RabbitMQ for PubSub <a href="https://github.com/rajaraodv/rabbitpubsub">https://github.com/rajaraodv/rabbitpubsub</a></h3>
<div class="outline-text-3" id="text-27-17">

</div>

</div>

<div id="outline-container-27-18" class="outline-3">
<h3 id="sec-27-18">AMQP <a href="http://kellabyte.com/2012/10/20/clarifying-amqp/">http://kellabyte.com/2012/10/20/clarifying-amqp/</a></h3>
<div class="outline-text-3" id="text-27-18">

</div>

</div>
