toread.org
** AMQP resources
AMQP resources:

  Servers:
    RabbitMQ (Rabbit Technologies, Erlang/OTP, MPL) - http://rabbitmq.com
    ZeroMQ   (iMatix/FastMQ/Intel, C++, GPL3)       - http://www.zeromq.org
    OpenAMQ  (iMatix, C, GPL2)                      - http://openamq.org
    ActiveMQ (Apache Foundation, Java, apache2)     - http://activemq.apache.org

  Steve Vinoski explains AMQP in his column, Towards Integration
    http://steve.vinoski.net/pdf/IEEE-Advanced_Message_Queuing_Protocol.pdf

  John O'Hara on the history of AMQP
    http://www.acmqueue.org/modules.php?name=Content&pa=showpage&pid=485

  Dmitriy's presentation on RabbitMQ/AMQP
    http://somic-org.homelinux.org/blog/2008/07/31/slides-for-my-amqprabbitmq-talk/

  ZeroMQ's analysis of the messaging technology market
    http://www.zeromq.org/whitepapers:market-analysis

  Pieter Hintjens's background to AMQP
    http://www.openamq.org/doc:amqp-background

  Barry Pederson's py-amqplib
    http://barryp.org/software/py-amqplib/

  Ben Hood on writing an AMQP client
    http://hopper.squarespace.com/blog/2008/6/21/build-your-own-amqp-client.html

  Dmitriy Samovskiy introduces Ruby + QPid + RabbitMQ
    http://somic-org.homelinux.org/blog/2008/06/24/ruby-amqp-rabbitmq-example/

  Ben Hood's as3-amqp
    http://github.com/0x6e6562/as3-amqp
    http://hopper.squarespace.com/blog/2008/7/4/server-side-as3.html
    http://hopper.squarespace.com/blog/2008/3/24/as3-amqp-client-first-cut.html

  RabbitMQ's protocol code generator
    http://hg.rabbitmq.com/rabbitmq-codegen/

  Erlang Exchange presentation on the implementation of RabbitMQ
    http://skillsmatter.com/podcast/erlang/presenting-rabbitmq-an-erlang-based-implementatio-nof-amqp
    http://www.lshift.net/blog/2008/07/01/slides-from-our-erlang-exchange-talk

  Jonathan Conway's series on RabbitMQ and using it with Ruby/Merb
    http://jaikoo.com/2008/3/20/daemonize-rabbitmq
    http://jaikoo.com/2008/3/14/oh-hai-rabbitmq
    http://jaikoo.com/2008/2/29/friday-round-up-2008-02-29
    http://jaikoo.com/2007/9/4/didn-t-you-get-the-memo

  Open Enterprise's series on messaging middleware and AMQP
    http://www1.interopsystems.com/analysis/can-amqp-break-ibms-mom-monopoly-part-1.html
    http://www1.interopsystems.com/analysis/can-amqp-break-ibms-mom-monopoly-part-2.html
    http://www1.interopsystems.com/analysis/can-amqp-break-ibms-mom-monopoly-part-3.html

Messaging and distributed systems resources:

  A Critique of the Remote Procedure Call Paradigm
    http://www.cs.vu.nl/~ast/publications/euteco-1988.pdf

  A Note on Distributed Computing
    http://research.sun.com/techrep/1994/smli_tr-94-29.pdf

  Convenience Over Correctness
    http://steve.vinoski.net/pdf/IEEE-Convenience_Over_Correctness.pdf

  Metaprotocol Taxonomy and Communications Patterns
    http://hessian.caucho.com/doc/metaprotocol-taxonomy.xtp

  Joe Armstrong on Erlang messaging vs RPC
    http://armstrongonsoftware.blogspot.com/2008/05/road-we-didnt-go-down.html

  SEDA: scalable internet services using message queues
  http://www.eecs.harvard.edu/~mdw/papers/seda-sosp01.pdf)
** A Node.js app that shows the power for RabbitMQ's Work-queue https://github.com/rajaraodv/rabbitworkers
** Node-js rabbitmq http://www.erlang-factory.com/conference/Munich2013/speakers/AlvaroVidela
* Erlang
** A Week with Elixir http://joearms.github.io/2013/05/31/a-week-with-elixir.html
** scheme on erlang VM http://the-concurrent-schemer.github.io/scm-doc/
** green callbacks http://joearms.github.com/2013/04/02/Red-and-Green-Callbacks.html
** elixir intro http://devintorr.es/blog/2013/01/22/the-excitement-of-elixir/
** erlang GPU CUDA http://gpuscience.com/cs/erlang-and-cuda-concurrent-and-fast/
* Java
** http://nealford.com/memeagora/2013/01/22/why_everyone_eventually_hates_maven.html
* Data NLP
** Natural Language Toolkit for python  http://nltk.org/
** gensim http://radimrehurek.com/gensim/tutorial.html
** The World's Best Grammar Checker http://www.grammarly.com/
* Open Data
** Open data et tourisme : un potentiel qui reste à transformer http://www.lagazettedescommunes.com/195963/open-data-et-tourisme-un-potentiel-qui-reste-a-transformer/
** Common Crawl : 6 billion web documents https://commoncrawl.atlassian.net/wiki/display/CRWL/About+the+Data+Set
** Our aim is to track every government financial transaction across the world  http://openspending.org/
** Open Knowledge Foundation Labs http://okfnlabs.org/  http://blog.okfn.org/2013/07/09/introducing-open-knowledge-foundation-labs/
** Open Data in Italy http://www.istat.it/en/ http://www.dati.piemonte.it/
** Digital Public Library of America http://dp.la
