toread.html

<div id="outline-container-27-19" class="outline-3">
<h3 id="sec-27-19">AMQP resources</h3>
<div class="outline-text-3" id="text-27-19">

<p>AMQP resources:
</p>
<p>
  Servers:
    RabbitMQ (Rabbit Technologies, Erlang/OTP, MPL) - <a href="http://rabbitmq.com">http://rabbitmq.com</a>
    ZeroMQ   (iMatix/FastMQ/Intel, C++, GPL3)       - <a href="http://www.zeromq.org">http://www.zeromq.org</a>
    OpenAMQ  (iMatix, C, GPL2)                      - <a href="http://openamq.org">http://openamq.org</a>
    ActiveMQ (Apache Foundation, Java, apache2)     - <a href="http://activemq.apache.org">http://activemq.apache.org</a>
</p>
<p>
  Steve Vinoski explains AMQP in his column, Towards Integration
    <a href="http://steve.vinoski.net/pdf/IEEE-Advanced_Message_Queuing_Protocol.pdf">http://steve.vinoski.net/pdf/IEEE-Advanced_Message_Queuing_Protocol.pdf</a>
</p>
<p>
  John O'Hara on the history of AMQP
    <a href="http://www.acmqueue.org/modules.php?name=Content&amp;pa=showpage&amp;pid=485">http://www.acmqueue.org/modules.php?name=Content&amp;pa=showpage&amp;pid=485</a>
</p>
<p>
  Dmitriy's presentation on RabbitMQ/AMQP
    <a href="http://somic-org.homelinux.org/blog/2008/07/31/slides-for-my-amqprabbitmq-talk/">http://somic-org.homelinux.org/blog/2008/07/31/slides-for-my-amqprabbitmq-talk/</a>
</p>
<p>
  ZeroMQ's analysis of the messaging technology market
    <a href="http://www.zeromq.org/whitepapers:market-analysis">http://www.zeromq.org/whitepapers:market-analysis</a>
</p>
<p>
  Pieter Hintjens's background to AMQP
    <a href="http://www.openamq.org/doc:amqp-background">http://www.openamq.org/doc:amqp-background</a>
</p>
<p>
  Barry Pederson's py-amqplib
    <a href="http://barryp.org/software/py-amqplib/">http://barryp.org/software/py-amqplib/</a>
</p>
<p>
  Ben Hood on writing an AMQP client
    <a href="http://hopper.squarespace.com/blog/2008/6/21/build-your-own-amqp-client.html">http://hopper.squarespace.com/blog/2008/6/21/build-your-own-amqp-client.html</a>
</p>
<p>
  Dmitriy Samovskiy introduces Ruby + QPid + RabbitMQ
    <a href="http://somic-org.homelinux.org/blog/2008/06/24/ruby-amqp-rabbitmq-example/">http://somic-org.homelinux.org/blog/2008/06/24/ruby-amqp-rabbitmq-example/</a>
</p>
<p>
  Ben Hood's as3-amqp
    <a href="http://github.com/0x6e6562/as3-amqp">http://github.com/0x6e6562/as3-amqp</a>
    <a href="http://hopper.squarespace.com/blog/2008/7/4/server-side-as3.html">http://hopper.squarespace.com/blog/2008/7/4/server-side-as3.html</a>
    <a href="http://hopper.squarespace.com/blog/2008/3/24/as3-amqp-client-first-cut.html">http://hopper.squarespace.com/blog/2008/3/24/as3-amqp-client-first-cut.html</a>
</p>
<p>
  RabbitMQ's protocol code generator
    <a href="http://hg.rabbitmq.com/rabbitmq-codegen/">http://hg.rabbitmq.com/rabbitmq-codegen/</a>
</p>
<p>
  Erlang Exchange presentation on the implementation of RabbitMQ
    <a href="http://skillsmatter.com/podcast/erlang/presenting-rabbitmq-an-erlang-based-implementatio-nof-amqp">http://skillsmatter.com/podcast/erlang/presenting-rabbitmq-an-erlang-based-implementatio-nof-amqp</a>
    <a href="http://www.lshift.net/blog/2008/07/01/slides-from-our-erlang-exchange-talk">http://www.lshift.net/blog/2008/07/01/slides-from-our-erlang-exchange-talk</a>
</p>
<p>
  Jonathan Conway's series on RabbitMQ and using it with Ruby/Merb
    <a href="http://jaikoo.com/2008/3/20/daemonize-rabbitmq">http://jaikoo.com/2008/3/20/daemonize-rabbitmq</a>
    <a href="http://jaikoo.com/2008/3/14/oh-hai-rabbitmq">http://jaikoo.com/2008/3/14/oh-hai-rabbitmq</a>
    <a href="http://jaikoo.com/2008/2/29/friday-round-up-2008-02-29">http://jaikoo.com/2008/2/29/friday-round-up-2008-02-29</a>
    <a href="http://jaikoo.com/2007/9/4/didn-t-you-get-the-memo">http://jaikoo.com/2007/9/4/didn-t-you-get-the-memo</a>
</p>
<p>
  Open Enterprise's series on messaging middleware and AMQP
    <a href="http://www1.interopsystems.com/analysis/can-amqp-break-ibms-mom-monopoly-part-1.html">http://www1.interopsystems.com/analysis/can-amqp-break-ibms-mom-monopoly-part-1.html</a>
    <a href="http://www1.interopsystems.com/analysis/can-amqp-break-ibms-mom-monopoly-part-2.html">http://www1.interopsystems.com/analysis/can-amqp-break-ibms-mom-monopoly-part-2.html</a>
    <a href="http://www1.interopsystems.com/analysis/can-amqp-break-ibms-mom-monopoly-part-3.html">http://www1.interopsystems.com/analysis/can-amqp-break-ibms-mom-monopoly-part-3.html</a>
</p>
<p>
Messaging and distributed systems resources:
</p>
<p>
  A Critique of the Remote Procedure Call Paradigm
    <a href="http://www.cs.vu.nl/~ast/publications/euteco-1988.pdf">http://www.cs.vu.nl/~ast/publications/euteco-1988.pdf</a>
</p>
<p>
  A Note on Distributed Computing
    <a href="http://research.sun.com/techrep/1994/smli_tr-94-29.pdf">http://research.sun.com/techrep/1994/smli_tr-94-29.pdf</a>
</p>
<p>
  Convenience Over Correctness
    <a href="http://steve.vinoski.net/pdf/IEEE-Convenience_Over_Correctness.pdf">http://steve.vinoski.net/pdf/IEEE-Convenience_Over_Correctness.pdf</a>
</p>
<p>
  Metaprotocol Taxonomy and Communications Patterns
    <a href="http://hessian.caucho.com/doc/metaprotocol-taxonomy.xtp">http://hessian.caucho.com/doc/metaprotocol-taxonomy.xtp</a>
</p>
<p>
  Joe Armstrong on Erlang messaging vs RPC
    <a href="http://armstrongonsoftware.blogspot.com/2008/05/road-we-didnt-go-down.html">http://armstrongonsoftware.blogspot.com/2008/05/road-we-didnt-go-down.html</a>
</p>
<p>
  SEDA: scalable internet services using message queues
  <a href="http://www.eecs.harvard.edu/~mdw/papers/seda-sosp01.pdf">http://www.eecs.harvard.edu/~mdw/papers/seda-sosp01.pdf</a>)
</p></div>

</div>

<div id="outline-container-27-20" class="outline-3">
<h3 id="sec-27-20">A Node.js app that shows the power for RabbitMQ's Work-queue <a href="https://github.com/rajaraodv/rabbitworkers">https://github.com/rajaraodv/rabbitworkers</a></h3>
<div class="outline-text-3" id="text-27-20">

</div>

</div>

<div id="outline-container-27-21" class="outline-3">
<h3 id="sec-27-21">Node-js rabbitmq <a href="http://www.erlang-factory.com/conference/Munich2013/speakers/AlvaroVidela">http://www.erlang-factory.com/conference/Munich2013/speakers/AlvaroVidela</a></h3>
<div class="outline-text-3" id="text-27-21">

</div>
</div>

</div>

<div id="outline-container-28" class="outline-2">
<h2 id="sec-28">Erlang</h2>
<div class="outline-text-2" id="text-28">


</div>

<div id="outline-container-28-1" class="outline-3">
<h3 id="sec-28-1">A Week with Elixir <a href="http://joearms.github.io/2013/05/31/a-week-with-elixir.html">http://joearms.github.io/2013/05/31/a-week-with-elixir.html</a></h3>
<div class="outline-text-3" id="text-28-1">

</div>

</div>

<div id="outline-container-28-2" class="outline-3">
<h3 id="sec-28-2">scheme on erlang VM <a href="http://the-concurrent-schemer.github.io/scm-doc/">http://the-concurrent-schemer.github.io/scm-doc/</a></h3>
<div class="outline-text-3" id="text-28-2">

</div>

</div>

<div id="outline-container-28-3" class="outline-3">
<h3 id="sec-28-3">green callbacks <a href="http://joearms.github.com/2013/04/02/Red-and-Green-Callbacks.html">http://joearms.github.com/2013/04/02/Red-and-Green-Callbacks.html</a></h3>
<div class="outline-text-3" id="text-28-3">

</div>

</div>

<div id="outline-container-28-4" class="outline-3">
<h3 id="sec-28-4">elixir intro <a href="http://devintorr.es/blog/2013/01/22/the-excitement-of-elixir/">http://devintorr.es/blog/2013/01/22/the-excitement-of-elixir/</a></h3>
<div class="outline-text-3" id="text-28-4">

</div>

</div>

<div id="outline-container-28-5" class="outline-3">
<h3 id="sec-28-5">erlang GPU CUDA <a href="http://gpuscience.com/cs/erlang-and-cuda-concurrent-and-fast/">http://gpuscience.com/cs/erlang-and-cuda-concurrent-and-fast/</a></h3>
<div class="outline-text-3" id="text-28-5">

</div>
</div>

</div>

<div id="outline-container-29" class="outline-2">
<h2 id="sec-29">Java</h2>
<div class="outline-text-2" id="text-29">


</div>

<div id="outline-container-29-1" class="outline-3">
<h3 id="sec-29-1"><a href="http://nealford.com/memeagora/2013/01/22/why_everyone_eventually_hates_maven.html">http://nealford.com/memeagora/2013/01/22/why_everyone_eventually_hates_maven.html</a></h3>
<div class="outline-text-3" id="text-29-1">

</div>
</div>

</div>

<div id="outline-container-30" class="outline-2">
<h2 id="sec-30">Data NLP</h2>
<div class="outline-text-2" id="text-30">


</div>

<div id="outline-container-30-1" class="outline-3">
<h3 id="sec-30-1">Natural Language Toolkit for python  <a href="http://nltk.org/">http://nltk.org/</a></h3>
<div class="outline-text-3" id="text-30-1">

</div>

</div>

<div id="outline-container-30-2" class="outline-3">
<h3 id="sec-30-2">gensim <a href="http://radimrehurek.com/gensim/tutorial.html">http://radimrehurek.com/gensim/tutorial.html</a></h3>
<div class="outline-text-3" id="text-30-2">

</div>

</div>

<div id="outline-container-30-3" class="outline-3">
<h3 id="sec-30-3">The World's Best Grammar Checker <a href="http://www.grammarly.com/">http://www.grammarly.com/</a></h3>
<div class="outline-text-3" id="text-30-3">

</div>
</div>

</div>

<div id="outline-container-31" class="outline-2">
<h2 id="sec-31">Open Data</h2>
<div class="outline-text-2" id="text-31">


</div>

<div id="outline-container-31-1" class="outline-3">
<h3 id="sec-31-1">Open data et tourisme : un potentiel qui reste à transformer <a href="http://www.lagazettedescommunes.com/195963/open-data-et-tourisme-un-potentiel-qui-reste-a-transformer/">http://www.lagazettedescommunes.com/195963/open-data-et-tourisme-un-potentiel-qui-reste-a-transformer/</a></h3>
<div class="outline-text-3" id="text-31-1">

</div>

</div>

<div id="outline-container-31-2" class="outline-3">
<h3 id="sec-31-2">Common Crawl : 6 billion web documents <a href="https://commoncrawl.atlassian.net/wiki/display/CRWL/About+the+Data+Set">https://commoncrawl.atlassian.net/wiki/display/CRWL/About+the+Data+Set</a></h3>
<div class="outline-text-3" id="text-31-2">

</div>

</div>

<div id="outline-container-31-3" class="outline-3">
<h3 id="sec-31-3">Our aim is to track every government financial transaction across the world  <a href="http://openspending.org/">http://openspending.org/</a></h3>
<div class="outline-text-3" id="text-31-3">

</div>

</div>

<div id="outline-container-31-4" class="outline-3">
<h3 id="sec-31-4">Open Knowledge Foundation Labs <a href="http://okfnlabs.org/">http://okfnlabs.org/</a>  <a href="http://blog.okfn.org/2013/07/09/introducing-open-knowledge-foundation-labs/">http://blog.okfn.org/2013/07/09/introducing-open-knowledge-foundation-labs/</a></h3>
<div class="outline-text-3" id="text-31-4">

</div>

</div>

<div id="outline-container-31-5" class="outline-3">
<h3 id="sec-31-5">Open Data in Italy <a href="http://www.istat.it/en/">http://www.istat.it/en/</a> <a href="http://www.dati.piemonte.it/">http://www.dati.piemonte.it/</a></h3>
<div class="outline-text-3" id="text-31-5">

</div>

</div>

<div id="outline-container-31-6" class="outline-3">
<h3 id="sec-31-6">Digital Public Library of America <a href="http://dp.la">http://dp.la</a></h3>
<div class="outline-text-3" id="text-31-6">

</div>

</div>
