toread.org
** Europe : think culture http://europeana.eu/
** opendata blog (in french) http://donneesouvertes.info/2013/05/02/donnee-brute-ou-donnee-contextualisee/
** opendata + visualization : http://opendata.hauts-de-seine.net/jeu-de-donnees/cadastre-vert-les-arbres#ressources
http://data.nantes.fr/donnees/detail/offres-de-services-des-parkings-publics-de-la-ville-de-nantes-1/?visualization=2
** FORMA Forest Monitoring for Action project in cascalog https://github.com/reddmetrics/forma-clj
** GDELT Global Data on Events, Location and Tone : data for historians http://eventdata.psu.edu/data.dir/GDELT.html
** GDELT usage http://nbviewer.ipython.org/urls/raw.github.com/dmasad/GDELT_Intro/master/Getting_Started_with_GDELT.ipynb
** Thoughts on GDELT http://johnbeieler.org/blog/2013/04/12/gdelt/ http://badhessian.org/2013/04/gdelt-and-social-movements/
Data tells you whether to use A or B. Science tells you what A and B should be in the first place.
** Politis Data : Militarized Interstate Disputes http://www.correlatesofwar.org/COW2%20Data/MIDs/MID310.html
** Aaron Swartz https://aaronsw.jottit.com/howtoget http://www.aaronsw.com/
** open data CH money ideas http://make.opendata.ch/forum/discussion/69/financebudgetmoney-apps-inspirations
** swiss tax viz proposal  http://make.opendata.ch/forum/discussion/72/project-idea-vis-4-tax-freedom-day#Item_1
   http://www.estv2.admin.ch/d/dokumentation/zahlen_fakten/tax_freedom_day/2011/index.htm
* Data
** financial, economic and social datasets http://www.quandl.com/
** The Free Wiki World Map http://www.openstreetmap.org/
** The MNIST database of handwritten digits http://yann.lecun.com/exdb/mnist/ 
** The Harvard Dataverse Network social science research data http://dvn.iq.harvard.edu/dvn/
** dataset contains contains 1,362,109 reviews of Amazon products http://www.mblondel.org/data/
http://www.mblondel.org/data/amazon7.pkl.tar.bz2
try:
    import joblib
except ImportError:
    from sklearn.externals import joblib

data = joblib.load("amazon7.pkl")
X = data["X"]
y = data["y"]
print X.shape
print y.shape
print data["categories"]
** Data Mining Community's Top Resource kdnuggets http://www.kdnuggets.com/2013/05/added-to-kdnuggets-in-april.html
** Forget big data, small data is the real revolution http://m.guardian.co.uk/news/datablog/2013/apr/25/forget-big-data-small-data-revolution
** Data Science of the Facebook World http://blog.stephenwolfram.com/2013/04/data-science-of-the-facebook-world/
** datasets http://www.kdnuggets.com/datasets/ http://archive.ics.uci.edu/ml/
** the industry's online resource for big data practitioners http://www.datasciencecentral.com/
** machine learning for NBA http://neuroecology.wordpress.com/2013/03/18/neuroscience-is-useful-nba-edition/
** http://gigaom.com/2013/03/22/structuredata-2013-recap/
** 5-part video series: Exploring the @IBMbigdata #BigData Accelerator for Machine Data #Analytics http://www.youtube.com/watch?v=qnCtMKpYt3E
** data analytics stories blog http://www.analyticstory.com/kovas-boguta/
** linked data RDF book http://www.manning.com/dwood/
** LDB: The BigData In-Memory database built with Erlang, C and LISP http://www.erlang-factory.com/conference/SFBay2013/speakers/JohnVlachoyiannis
** Fogus references about events and history ariadne
*** [Out of the Tarpit](http://lambda-the-ultimate.org/node/1446) by Marks and Moseley
*** [CQRS](http://martinfowler.com/bliki/CQRS.html), [event sourcing](http://martinfowler.com/eaaDev/EventSourcing.html), [MemoryImage](http://martinfowler.com/bliki/MemoryImage.html) and [the LMAX architecture](http://martinfowler.com/articles/lmax.html) by Martin Fowler
*** [Fundamental concepts of plugin infrastructures](http://eli.thegreenplace.net/2012/08/07/fundamental-concepts-of-plugin-infrastructures/) by Eli Bendersky
*** [Jess in Action](http://www.jessrules.com/jesswiki/view?JessInAction) by Ernest Friedman-Hill
*** [Why not events](http://awelonblue.wordpress.com/2012/07/01/why-not-events/) and [Exponential decay of history](http://awelonblue.wordpress.com/2012/08/20/exponential-decay-of-history/) by David Barbour
