toread.html

<div id="outline-container-31-7" class="outline-3">
<h3 id="sec-31-7">Europe : think culture <a href="http://europeana.eu/">http://europeana.eu/</a></h3>
<div class="outline-text-3" id="text-31-7">

</div>

</div>

<div id="outline-container-31-8" class="outline-3">
<h3 id="sec-31-8">opendata blog (in french) <a href="http://donneesouvertes.info/2013/05/02/donnee-brute-ou-donnee-contextualisee/">http://donneesouvertes.info/2013/05/02/donnee-brute-ou-donnee-contextualisee/</a></h3>
<div class="outline-text-3" id="text-31-8">

</div>

</div>

<div id="outline-container-31-9" class="outline-3">
<h3 id="sec-31-9">opendata + visualization : <a href="http://opendata.hauts-de-seine.net/jeu-de-donnees/cadastre-vert-les-arbres#ressources">http://opendata.hauts-de-seine.net/jeu-de-donnees/cadastre-vert-les-arbres#ressources</a></h3>
<div class="outline-text-3" id="text-31-9">

<p><a href="http://data.nantes.fr/donnees/detail/offres-de-services-des-parkings-publics-de-la-ville-de-nantes-1/?visualization=2">http://data.nantes.fr/donnees/detail/offres-de-services-des-parkings-publics-de-la-ville-de-nantes-1/?visualization=2</a>
</p></div>

</div>

<div id="outline-container-31-10" class="outline-3">
<h3 id="sec-31-10">FORMA Forest Monitoring for Action project in cascalog <a href="https://github.com/reddmetrics/forma-clj">https://github.com/reddmetrics/forma-clj</a></h3>
<div class="outline-text-3" id="text-31-10">

</div>

</div>

<div id="outline-container-31-11" class="outline-3">
<h3 id="sec-31-11">GDELT Global Data on Events, Location and Tone : data for historians <a href="http://eventdata.psu.edu/data.dir/GDELT.html">http://eventdata.psu.edu/data.dir/GDELT.html</a></h3>
<div class="outline-text-3" id="text-31-11">

</div>

</div>

<div id="outline-container-31-12" class="outline-3">
<h3 id="sec-31-12">GDELT usage <a href="http://nbviewer.ipython.org/urls/raw.github.com/dmasad/GDELT_Intro/master/Getting_Started_with_GDELT.ipynb">http://nbviewer.ipython.org/urls/raw.github.com/dmasad/GDELT_Intro/master/Getting_Started_with_GDELT.ipynb</a></h3>
<div class="outline-text-3" id="text-31-12">

</div>

</div>

<div id="outline-container-31-13" class="outline-3">
<h3 id="sec-31-13">Thoughts on GDELT <a href="http://johnbeieler.org/blog/2013/04/12/gdelt/">http://johnbeieler.org/blog/2013/04/12/gdelt/</a> <a href="http://badhessian.org/2013/04/gdelt-and-social-movements/">http://badhessian.org/2013/04/gdelt-and-social-movements/</a></h3>
<div class="outline-text-3" id="text-31-13">

<p>Data tells you whether to use A or B. Science tells you what A and B should be in the first place.
</p></div>

</div>

<div id="outline-container-31-14" class="outline-3">
<h3 id="sec-31-14">Politis Data : Militarized Interstate Disputes <a href="http://www.correlatesofwar.org/COW2 Data/MIDs/MID310.html">http://www.correlatesofwar.org/COW2%20Data/MIDs/MID310.html</a></h3>
<div class="outline-text-3" id="text-31-14">

</div>

</div>

<div id="outline-container-31-15" class="outline-3">
<h3 id="sec-31-15">Aaron Swartz <a href="https://aaronsw.jottit.com/howtoget">https://aaronsw.jottit.com/howtoget</a> <a href="http://www.aaronsw.com/">http://www.aaronsw.com/</a></h3>
<div class="outline-text-3" id="text-31-15">

</div>

</div>

<div id="outline-container-31-16" class="outline-3">
<h3 id="sec-31-16">open data CH money ideas <a href="http://make.opendata.ch/forum/discussion/69/financebudgetmoney-apps-inspirations">http://make.opendata.ch/forum/discussion/69/financebudgetmoney-apps-inspirations</a></h3>
<div class="outline-text-3" id="text-31-16">

</div>

</div>

<div id="outline-container-31-17" class="outline-3">
<h3 id="sec-31-17">swiss tax viz proposal  <a href="http://make.opendata.ch/forum/discussion/72/project-idea-vis-4-tax-freedom-day#Item_1">http://make.opendata.ch/forum/discussion/72/project-idea-vis-4-tax-freedom-day#Item_1</a></h3>
<div class="outline-text-3" id="text-31-17">

<p>   <a href="http://www.estv2.admin.ch/d/dokumentation/zahlen_fakten/tax_freedom_day/2011/index.htm">http://www.estv2.admin.ch/d/dokumentation/zahlen_fakten/tax_freedom_day/2011/index.htm</a>
</p></div>
</div>

</div>

<div id="outline-container-32" class="outline-2">
<h2 id="sec-32">Data</h2>
<div class="outline-text-2" id="text-32">


</div>

<div id="outline-container-32-1" class="outline-3">
<h3 id="sec-32-1">financial, economic and social datasets <a href="http://www.quandl.com/">http://www.quandl.com/</a></h3>
<div class="outline-text-3" id="text-32-1">

</div>

</div>

<div id="outline-container-32-2" class="outline-3">
<h3 id="sec-32-2">The Free Wiki World Map <a href="http://www.openstreetmap.org/">http://www.openstreetmap.org/</a></h3>
<div class="outline-text-3" id="text-32-2">

</div>

</div>

<div id="outline-container-32-3" class="outline-3">
<h3 id="sec-32-3">The MNIST database of handwritten digits <a href="http://yann.lecun.com/exdb/mnist/">http://yann.lecun.com/exdb/mnist/</a></h3>
<div class="outline-text-3" id="text-32-3">

</div>

</div>

<div id="outline-container-32-4" class="outline-3">
<h3 id="sec-32-4">The Harvard Dataverse Network social science research data <a href="http://dvn.iq.harvard.edu/dvn/">http://dvn.iq.harvard.edu/dvn/</a></h3>
<div class="outline-text-3" id="text-32-4">

</div>

</div>

<div id="outline-container-32-5" class="outline-3">
<h3 id="sec-32-5">dataset contains contains 1,362,109 reviews of Amazon products <a href="http://www.mblondel.org/data/">http://www.mblondel.org/data/</a></h3>
<div class="outline-text-3" id="text-32-5">

<p><a href="http://www.mblondel.org/data/amazon7.pkl.tar.bz2">http://www.mblondel.org/data/amazon7.pkl.tar.bz2</a>
try:
    import joblib
except ImportError:
    from sklearn.externals import joblib
</p>
<p>
data = joblib.load("amazon7.pkl")
X = data["X"]
y = data["y"]
print X.shape
print y.shape
print data["categories"]
</p></div>

</div>

<div id="outline-container-32-6" class="outline-3">
<h3 id="sec-32-6">Data Mining Community's Top Resource kdnuggets <a href="http://www.kdnuggets.com/2013/05/added-to-kdnuggets-in-april.html">http://www.kdnuggets.com/2013/05/added-to-kdnuggets-in-april.html</a></h3>
<div class="outline-text-3" id="text-32-6">

</div>

</div>

<div id="outline-container-32-7" class="outline-3">
<h3 id="sec-32-7">Forget big data, small data is the real revolution <a href="http://m.guardian.co.uk/news/datablog/2013/apr/25/forget-big-data-small-data-revolution">http://m.guardian.co.uk/news/datablog/2013/apr/25/forget-big-data-small-data-revolution</a></h3>
<div class="outline-text-3" id="text-32-7">

</div>

</div>

<div id="outline-container-32-8" class="outline-3">
<h3 id="sec-32-8">Data Science of the Facebook World <a href="http://blog.stephenwolfram.com/2013/04/data-science-of-the-facebook-world/">http://blog.stephenwolfram.com/2013/04/data-science-of-the-facebook-world/</a></h3>
<div class="outline-text-3" id="text-32-8">

</div>

</div>

<div id="outline-container-32-9" class="outline-3">
<h3 id="sec-32-9">datasets <a href="http://www.kdnuggets.com/datasets/">http://www.kdnuggets.com/datasets/</a> <a href="http://archive.ics.uci.edu/ml/">http://archive.ics.uci.edu/ml/</a></h3>
<div class="outline-text-3" id="text-32-9">

</div>

</div>

<div id="outline-container-32-10" class="outline-3">
<h3 id="sec-32-10">the industry's online resource for big data practitioners <a href="http://www.datasciencecentral.com/">http://www.datasciencecentral.com/</a></h3>
<div class="outline-text-3" id="text-32-10">

</div>

</div>

<div id="outline-container-32-11" class="outline-3">
<h3 id="sec-32-11">machine learning for NBA <a href="http://neuroecology.wordpress.com/2013/03/18/neuroscience-is-useful-nba-edition/">http://neuroecology.wordpress.com/2013/03/18/neuroscience-is-useful-nba-edition/</a></h3>
<div class="outline-text-3" id="text-32-11">

</div>

</div>

<div id="outline-container-32-12" class="outline-3">
<h3 id="sec-32-12"><a href="http://gigaom.com/2013/03/22/structuredata-2013-recap/">http://gigaom.com/2013/03/22/structuredata-2013-recap/</a></h3>
<div class="outline-text-3" id="text-32-12">

</div>

</div>

<div id="outline-container-32-13" class="outline-3">
<h3 id="sec-32-13">5-part video series: Exploring the @IBMbigdata #BigData Accelerator for Machine Data #Analytics <a href="http://www.youtube.com/watch?v=qnCtMKpYt3E">http://www.youtube.com/watch?v=qnCtMKpYt3E</a></h3>
<div class="outline-text-3" id="text-32-13">

</div>

</div>

<div id="outline-container-32-14" class="outline-3">
<h3 id="sec-32-14">data analytics stories blog <a href="http://www.analyticstory.com/kovas-boguta/">http://www.analyticstory.com/kovas-boguta/</a></h3>
<div class="outline-text-3" id="text-32-14">

</div>

</div>

<div id="outline-container-32-15" class="outline-3">
<h3 id="sec-32-15">linked data RDF book <a href="http://www.manning.com/dwood/">http://www.manning.com/dwood/</a></h3>
<div class="outline-text-3" id="text-32-15">

</div>

</div>

<div id="outline-container-32-16" class="outline-3">
<h3 id="sec-32-16">LDB: The BigData In-Memory database built with Erlang, C and LISP <a href="http://www.erlang-factory.com/conference/SFBay2013/speakers/JohnVlachoyiannis">http://www.erlang-factory.com/conference/SFBay2013/speakers/JohnVlachoyiannis</a></h3>
<div class="outline-text-3" id="text-32-16">

</div>

</div>

<div id="outline-container-32-17" class="outline-3">
<h3 id="sec-32-17">Fogus references about events and history ariadne</h3>
<div class="outline-text-3" id="text-32-17">


</div>

<div id="outline-container-32-17-1" class="outline-4">
<h4 id="sec-32-17-1">[Out of the Tarpit](<a href="http://lambda-the-ultimate.org/node/1446">http://lambda-the-ultimate.org/node/1446</a>) by Marks and Moseley</h4>
<div class="outline-text-4" id="text-32-17-1">

</div>

</div>

<div id="outline-container-32-17-2" class="outline-4">
<h4 id="sec-32-17-2">[CQRS](<a href="http://martinfowler.com/bliki/CQRS.html">http://martinfowler.com/bliki/CQRS.html</a>), [event sourcing](<a href="http://martinfowler.com/eaaDev/EventSourcing.html">http://martinfowler.com/eaaDev/EventSourcing.html</a>), [MemoryImage](<a href="http://martinfowler.com/bliki/MemoryImage.html">http://martinfowler.com/bliki/MemoryImage.html</a>) and [the LMAX architecture](<a href="http://martinfowler.com/articles/lmax.html">http://martinfowler.com/articles/lmax.html</a>) by Martin Fowler</h4>
<div class="outline-text-4" id="text-32-17-2">

</div>

</div>

<div id="outline-container-32-17-3" class="outline-4">
<h4 id="sec-32-17-3">[Fundamental concepts of plugin infrastructures](<a href="http://eli.thegreenplace.net/2012/08/07/fundamental-concepts-of-plugin-infrastructures/">http://eli.thegreenplace.net/2012/08/07/fundamental-concepts-of-plugin-infrastructures/</a>) by Eli Bendersky</h4>
<div class="outline-text-4" id="text-32-17-3">

</div>

</div>

<div id="outline-container-32-17-4" class="outline-4">
<h4 id="sec-32-17-4">[Jess in Action](<a href="http://www.jessrules.com/jesswiki/view?JessInAction">http://www.jessrules.com/jesswiki/view?JessInAction</a>) by Ernest Friedman-Hill</h4>
<div class="outline-text-4" id="text-32-17-4">

</div>

</div>

<div id="outline-container-32-17-5" class="outline-4">
<h4 id="sec-32-17-5">[Why not events](<a href="http://awelonblue.wordpress.com/2012/07/01/why-not-events/">http://awelonblue.wordpress.com/2012/07/01/why-not-events/</a>) and [Exponential decay of history](<a href="http://awelonblue.wordpress.com/2012/08/20/exponential-decay-of-history/">http://awelonblue.wordpress.com/2012/08/20/exponential-decay-of-history/</a>) by David Barbour</h4>
<div class="outline-text-4" id="text-32-17-5">

</div>

</div>
