toread.org
*** [Dedalus: Datalog in Time and Space](http://www.eecs.berkeley.edu/Pubs/TechRpts/2009/EECS-2009-173.html)
** storm http://www.michael-noll.com/blog/2012/10/16/understanding-the-parallelism-of-a-storm-topology/
** hadoop tuto http://www.michael-noll.com/tutorials/running-hadoop-on-ubuntu-linux-single-node-cluster/
** storm starter https://github.com/nathanmarz/storm-starter
** commoncrawler http://mashable.com/2013/01/24/common-crawl-google/ http://commoncrawl.org/announcing-the-winners-of-the-code-contest/
** drake from factual https://github.com/Factual/drake http://blog.factual.com/introducing-drake-a-kind-of-make-for-data
** innovative data companies http://www.zdnet.com/are-these-the-worlds-most-innovative-big-data-companies-7000011135/
Operations-improver Splunk
Tech-trend tracker Quid
Data scientist tournament host Kaggle
Credit rating revolutionary ZestFinance
Electronic medical record streamliner Apixio
Business intelligence visualizer Datameer
Marketing modeler BlueKai
Enterprise social media simplifier Gnip
Brick-and-mortar customer analyzer RetailNext
Compliance catalyst Recommind
** strata data session http://strataconf.com/strata2013/public/schedule/topic/909
** Supersonic is intended to be used as a back-end for various data warehousing projects https://code.google.com/p/supersonic/
Supersonic is an ultra-fast, column oriented query engine library written in C++.
It provides a set of data transformation primitives which make heavy use of cache-aware algorithms,
SIMD instructions and vectorised execution, allowing it to exploit the capabilities and resources of modern, hyper pipelined CPUs.
It is designed to work in a single process.
** financial dataset http://www.quandl.com
** search dataset http://www.zanran.com/q/  Open data @CTIC
** data mining news http://paper.li/data_nerd/1306264508
** linkedin data system http://gigaom.com/2013/03/03/how-and-why-linkedin-is-becoming-an-engineering-powerhouse/
 Kafka, another open source tool that Kreps called “the big data equivalent of a message broker.”
http://engineering.linkedin.com/data-replication/open-sourcing-databus-linkedins-low-latency-change-data-capture-system
opensource project http://data.linkedin.com/opensource/bob
* Data Analysis
** UK Diabetes with cascalog http://openhealthdata.cdehub.org/  https://groups.google.com/forum/#!topic/cascalog-user/8BvYufJpMpI
** Transportation optimization starts with math --> understanding human behavior. http://nautil.us/issue/3/in-transit/unhappy-truckers-and-other-algorithmic-problems
** cloudera-ml solution https://github.com/cloudera/ml/tree/master/examples/kdd99 to a network intrusion detector http://kdd.ics.uci.edu/databases/kddcup99/kddcup99.html
** Analysis on Github data http://www.fastcolabs.com/3008621/tracking/github-reveals-a-formula-for-your-hacker-persona
** A Statistical Analysis of Nerf Blasters and Darts By Shawn O'Neil http://shawntoneil.com/index.php/pages/nerftest1
** videos from datagotham conference http://www.datagotham.com/videos/
** Twitter data analysis  http://irevolution.net/2013/07/10/crisis-hashtags-dashboard/
**  http://nycbigapps.com/
** Zeitfenster  http://nycbigapps.com/project/111/Zeitfenster-New-York-Time-Travel-App
** Netflix Use Case :recommandation system http://techblog.netflix.com/2012/04/netflix-recommendations-beyond-5-stars.html 
http://techblog.netflix.com/2012/06/netflix-recommendations-beyond-5-stars.html
** http://datadrivenjournalism.net/featured_projects/is_it_really_worth_it_the_map_of_italian_journalists_facing_threats
** The Dangers of Overfitting or How to Drop 50 spots in 1 minute http://blog.kaggle.com/2012/07/06/the-dangers-of-overfitting-psychopathy-post-mortem/
** implementation for a Restricted Boltzmann Machine and a Deep Belief Network http://tjake.github.io/blog/2013/02/18/resurgence-in-artificial-intelligence/
https://github.com/tjake/rbm-dbn-mnist
** ML at Khan academy http://derandomized.com/post/51729670543/khan-academy-machine-learning-measurable-learning
http://david-hu.com/2011/11/02/how-khan-academy-is-using-machine-learning-to-assess-student-mastery.html
** Mobile Phone Data Proves Humans Are Predictable During Chaos http://www.fastcolabs.com/3009706/mobile-phone-data-proves-humans-are-predictable-during-chaos
** http://www.kaggle.com/c/challenges-in-representation-learning-the-black-box-learning-challenge
