toread.html

<div id="outline-container-32-17-6" class="outline-4">
<h4 id="sec-32-17-6">[Dedalus: Datalog in Time and Space](<a href="http://www.eecs.berkeley.edu/Pubs/TechRpts/2009/EECS-2009-173.html">http://www.eecs.berkeley.edu/Pubs/TechRpts/2009/EECS-2009-173.html</a>))])])])])])])])])])]</h4>
<div class="outline-text-4" id="text-32-17-6">

</div>
</div>

</div>

<div id="outline-container-32-18" class="outline-3">
<h3 id="sec-32-18">storm <a href="http://www.michael-noll.com/blog/2012/10/16/understanding-the-parallelism-of-a-storm-topology/">http://www.michael-noll.com/blog/2012/10/16/understanding-the-parallelism-of-a-storm-topology/</a></h3>
<div class="outline-text-3" id="text-32-18">

</div>

</div>

<div id="outline-container-32-19" class="outline-3">
<h3 id="sec-32-19">hadoop tuto <a href="http://www.michael-noll.com/tutorials/running-hadoop-on-ubuntu-linux-single-node-cluster/">http://www.michael-noll.com/tutorials/running-hadoop-on-ubuntu-linux-single-node-cluster/</a></h3>
<div class="outline-text-3" id="text-32-19">

</div>

</div>

<div id="outline-container-32-20" class="outline-3">
<h3 id="sec-32-20">storm starter <a href="https://github.com/nathanmarz/storm-starter">https://github.com/nathanmarz/storm-starter</a></h3>
<div class="outline-text-3" id="text-32-20">

</div>

</div>

<div id="outline-container-32-21" class="outline-3">
<h3 id="sec-32-21">commoncrawler <a href="http://mashable.com/2013/01/24/common-crawl-google/">http://mashable.com/2013/01/24/common-crawl-google/</a> <a href="http://commoncrawl.org/announcing-the-winners-of-the-code-contest/">http://commoncrawl.org/announcing-the-winners-of-the-code-contest/</a></h3>
<div class="outline-text-3" id="text-32-21">

</div>

</div>

<div id="outline-container-32-22" class="outline-3">
<h3 id="sec-32-22">drake from factual <a href="https://github.com/Factual/drake">https://github.com/Factual/drake</a> <a href="http://blog.factual.com/introducing-drake-a-kind-of-make-for-data">http://blog.factual.com/introducing-drake-a-kind-of-make-for-data</a></h3>
<div class="outline-text-3" id="text-32-22">

</div>

</div>

<div id="outline-container-32-23" class="outline-3">
<h3 id="sec-32-23">innovative data companies <a href="http://www.zdnet.com/are-these-the-worlds-most-innovative-big-data-companies-7000011135/">http://www.zdnet.com/are-these-the-worlds-most-innovative-big-data-companies-7000011135/</a></h3>
<div class="outline-text-3" id="text-32-23">

<p>Operations-improver Splunk
Tech-trend tracker Quid
Data scientist tournament host Kaggle
Credit rating revolutionary ZestFinance
Electronic medical record streamliner Apixio
Business intelligence visualizer Datameer
Marketing modeler BlueKai
Enterprise social media simplifier Gnip
Brick-and-mortar customer analyzer RetailNext
Compliance catalyst Recommind
</p></div>

</div>

<div id="outline-container-32-24" class="outline-3">
<h3 id="sec-32-24">strata data session <a href="http://strataconf.com/strata2013/public/schedule/topic/909">http://strataconf.com/strata2013/public/schedule/topic/909</a></h3>
<div class="outline-text-3" id="text-32-24">

</div>

</div>

<div id="outline-container-32-25" class="outline-3">
<h3 id="sec-32-25">Supersonic is intended to be used as a back-end for various data warehousing projects <a href="https://code.google.com/p/supersonic/">https://code.google.com/p/supersonic/</a></h3>
<div class="outline-text-3" id="text-32-25">

<p>Supersonic is an ultra-fast, column oriented query engine library written in C++.
It provides a set of data transformation primitives which make heavy use of cache-aware algorithms,
SIMD instructions and vectorised execution, allowing it to exploit the capabilities and resources of modern, hyper pipelined CPUs.
It is designed to work in a single process.
</p></div>

</div>

<div id="outline-container-32-26" class="outline-3">
<h3 id="sec-32-26">financial dataset <a href="http://www.quandl.com">http://www.quandl.com</a></h3>
<div class="outline-text-3" id="text-32-26">

</div>

</div>

<div id="outline-container-32-27" class="outline-3">
<h3 id="sec-32-27">search dataset <a href="http://www.zanran.com/q/">http://www.zanran.com/q/</a>  Open data @CTIC</h3>
<div class="outline-text-3" id="text-32-27">

</div>

</div>

<div id="outline-container-32-28" class="outline-3">
<h3 id="sec-32-28">data mining news <a href="http://paper.li/data_nerd/1306264508">http://paper.li/data_nerd/1306264508</a></h3>
<div class="outline-text-3" id="text-32-28">

</div>

</div>

<div id="outline-container-32-29" class="outline-3">
<h3 id="sec-32-29">linkedin data system <a href="http://gigaom.com/2013/03/03/how-and-why-linkedin-is-becoming-an-engineering-powerhouse/">http://gigaom.com/2013/03/03/how-and-why-linkedin-is-becoming-an-engineering-powerhouse/</a></h3>
<div class="outline-text-3" id="text-32-29">

<p> Kafka, another open source tool that Kreps called “the big data equivalent of a message broker.”
<a href="http://engineering.linkedin.com/data-replication/open-sourcing-databus-linkedins-low-latency-change-data-capture-system">http://engineering.linkedin.com/data-replication/open-sourcing-databus-linkedins-low-latency-change-data-capture-system</a>
opensource project <a href="http://data.linkedin.com/opensource/bob">http://data.linkedin.com/opensource/bob</a>
</p></div>
</div>

</div>

<div id="outline-container-33" class="outline-2">
<h2 id="sec-33">Data Analysis</h2>
<div class="outline-text-2" id="text-33">


</div>

<div id="outline-container-33-1" class="outline-3">
<h3 id="sec-33-1">UK Diabetes with cascalog <a href="http://openhealthdata.cdehub.org/">http://openhealthdata.cdehub.org/</a>  <a href="https://groups.google.com/forum/#!topic/cascalog-user/8BvYufJpMpI">https://groups.google.com/forum/#!topic/cascalog-user/8BvYufJpMpI</a></h3>
<div class="outline-text-3" id="text-33-1">

</div>

</div>

<div id="outline-container-33-2" class="outline-3">
<h3 id="sec-33-2">Transportation optimization starts with math &ndash;&gt; understanding human behavior. <a href="http://nautil.us/issue/3/in-transit/unhappy-truckers-and-other-algorithmic-problems">http://nautil.us/issue/3/in-transit/unhappy-truckers-and-other-algorithmic-problems</a></h3>
<div class="outline-text-3" id="text-33-2">

</div>

</div>

<div id="outline-container-33-3" class="outline-3">
<h3 id="sec-33-3">cloudera-ml solution <a href="https://github.com/cloudera/ml/tree/master/examples/kdd99">https://github.com/cloudera/ml/tree/master/examples/kdd99</a> to a network intrusion detector <a href="http://kdd.ics.uci.edu/databases/kddcup99/kddcup99.html">http://kdd.ics.uci.edu/databases/kddcup99/kddcup99.html</a></h3>
<div class="outline-text-3" id="text-33-3">

</div>

</div>

<div id="outline-container-33-4" class="outline-3">
<h3 id="sec-33-4">Analysis on Github data <a href="http://www.fastcolabs.com/3008621/tracking/github-reveals-a-formula-for-your-hacker-persona">http://www.fastcolabs.com/3008621/tracking/github-reveals-a-formula-for-your-hacker-persona</a></h3>
<div class="outline-text-3" id="text-33-4">

</div>

</div>

<div id="outline-container-33-5" class="outline-3">
<h3 id="sec-33-5">A Statistical Analysis of Nerf Blasters and Darts By Shawn O'Neil <a href="http://shawntoneil.com/index.php/pages/nerftest1">http://shawntoneil.com/index.php/pages/nerftest1</a></h3>
<div class="outline-text-3" id="text-33-5">

</div>

</div>

<div id="outline-container-33-6" class="outline-3">
<h3 id="sec-33-6">videos from datagotham conference <a href="http://www.datagotham.com/videos/">http://www.datagotham.com/videos/</a></h3>
<div class="outline-text-3" id="text-33-6">

</div>

</div>

<div id="outline-container-33-7" class="outline-3">
<h3 id="sec-33-7">Twitter data analysis  <a href="http://irevolution.net/2013/07/10/crisis-hashtags-dashboard/">http://irevolution.net/2013/07/10/crisis-hashtags-dashboard/</a></h3>
<div class="outline-text-3" id="text-33-7">

</div>

</div>

<div id="outline-container-33-8" class="outline-3">
<h3 id="sec-33-8"><a href="http://nycbigapps.com/">http://nycbigapps.com/</a></h3>
<div class="outline-text-3" id="text-33-8">

</div>

</div>

<div id="outline-container-33-9" class="outline-3">
<h3 id="sec-33-9">Zeitfenster  <a href="http://nycbigapps.com/project/111/Zeitfenster-New-York-Time-Travel-App">http://nycbigapps.com/project/111/Zeitfenster-New-York-Time-Travel-App</a></h3>
<div class="outline-text-3" id="text-33-9">

</div>

</div>

<div id="outline-container-33-10" class="outline-3">
<h3 id="sec-33-10">Netflix Use Case :recommandation system <a href="http://techblog.netflix.com/2012/04/netflix-recommendations-beyond-5-stars.html">http://techblog.netflix.com/2012/04/netflix-recommendations-beyond-5-stars.html</a></h3>
<div class="outline-text-3" id="text-33-10">

<p><a href="http://techblog.netflix.com/2012/06/netflix-recommendations-beyond-5-stars.html">http://techblog.netflix.com/2012/06/netflix-recommendations-beyond-5-stars.html</a>
</p></div>

</div>

<div id="outline-container-33-11" class="outline-3">
<h3 id="sec-33-11"><a href="http://datadrivenjournalism.net/featured_projects/is_it_really_worth_it_the_map_of_italian_journalists_facing_threats">http://datadrivenjournalism.net/featured_projects/is_it_really_worth_it_the_map_of_italian_journalists_facing_threats</a></h3>
<div class="outline-text-3" id="text-33-11">

</div>

</div>

<div id="outline-container-33-12" class="outline-3">
<h3 id="sec-33-12">The Dangers of Overfitting or How to Drop 50 spots in 1 minute <a href="http://blog.kaggle.com/2012/07/06/the-dangers-of-overfitting-psychopathy-post-mortem/">http://blog.kaggle.com/2012/07/06/the-dangers-of-overfitting-psychopathy-post-mortem/</a></h3>
<div class="outline-text-3" id="text-33-12">

</div>

</div>

<div id="outline-container-33-13" class="outline-3">
<h3 id="sec-33-13">implementation for a Restricted Boltzmann Machine and a Deep Belief Network <a href="http://tjake.github.io/blog/2013/02/18/resurgence-in-artificial-intelligence/">http://tjake.github.io/blog/2013/02/18/resurgence-in-artificial-intelligence/</a></h3>
<div class="outline-text-3" id="text-33-13">

<p><a href="https://github.com/tjake/rbm-dbn-mnist">https://github.com/tjake/rbm-dbn-mnist</a>
</p></div>

</div>

<div id="outline-container-33-14" class="outline-3">
<h3 id="sec-33-14">ML at Khan academy <a href="http://derandomized.com/post/51729670543/khan-academy-machine-learning-measurable-learning">http://derandomized.com/post/51729670543/khan-academy-machine-learning-measurable-learning</a></h3>
<div class="outline-text-3" id="text-33-14">

<p><a href="http://david-hu.com/2011/11/02/how-khan-academy-is-using-machine-learning-to-assess-student-mastery.html">http://david-hu.com/2011/11/02/how-khan-academy-is-using-machine-learning-to-assess-student-mastery.html</a>
</p></div>

</div>

<div id="outline-container-33-15" class="outline-3">
<h3 id="sec-33-15">Mobile Phone Data Proves Humans Are Predictable During Chaos <a href="http://www.fastcolabs.com/3009706/mobile-phone-data-proves-humans-are-predictable-during-chaos">http://www.fastcolabs.com/3009706/mobile-phone-data-proves-humans-are-predictable-during-chaos</a></h3>
<div class="outline-text-3" id="text-33-15">

</div>

</div>

<div id="outline-container-33-16" class="outline-3">
<h3 id="sec-33-16"><a href="http://www.kaggle.com/c/challenges-in-representation-learning-the-black-box-learning-challenge">http://www.kaggle.com/c/challenges-in-representation-learning-the-black-box-learning-challenge</a></h3>
<div class="outline-text-3" id="text-33-16">

</div>

</div>
