toread.org
** inclass challenge https://inclass.kaggle.com/
** Hadoop assignement on azure http://homes.cs.washington.edu/~billhowe/bigdatacloud/lecture3/assignment3.html
* Data API
** Using OpenRefine http://openrefine.org/ to Clean Multiple Documents in the Same Way http://schoolofdata.org/2013/07/26/using-openrefine-to-clean-multiple-documents-in-the-same-way/
** Machine Learning API : mashape http://blog.mashape.com/post/48074869493/list-of-40-machine-learning-apis
** NLP in APIs http://blog.mashape.com/post/48946187179/15-natural-language-processing-apis
* Data Computing
** Play Framework Grid Deployment with Mesos http://typesafe.com/blog/play-framework-grid-deployment-with-mesos
** GO BEYOND "DEBUG": WIRE TAP YOUR APP FOR KNOWLEDGE WITH HADOOP by leg Zhurakousky http://oredev.org/2013/wed-fri-conference/go-beyond-debug-wire-tap-your-app-for-knowledge-with-hadoop
** jsi http://jeroenjanssens.com/2013/09/19/seven-command-line-tools-for-data-science.html
** How to write a crawler by Emanuele Minotto http://www.emanueleminotto.it/how-to-write-a-crawler
** Auto-Scaling with Apache Helix and Apache YARN http://engineering.linkedin.com/cluster-management/auto-scaling-apache-helix-and-apache-yarn
** Quick tour of hive pigh data scientists tools via hortonworks http://hortonworks.com/get-started/analyze/
** Evolutionary Computing with Push http://faculty.hampshire.edu/lspector/push.html
** Amazon EMR / S3
*** http://www.datasciencecentral.com/profiles/blogs/s3-as-input-or-output-for-hadoop-mr-jobs
*** Usage of elasticmapreduce script http://sujee.net/tech/articles/hadoop/amazon-emr-beyond-basics/
*** s3cmd : command line S3 client http://s3tools.org/s3cmd
** ETL tools
   - AMPLab -- Mesos, plus BDAS Berkeley Data Analytics Stack 
   - Cascading/Cascalog/Scalding, not limited to Hadoop since other topologies are possibles; 
   - Twitter -- Summingbird, Storm, etc.; 
   - Facebook -- Presto; 
   - Anaconda/IPython/Pandas; 
   - Actian/ParAccel/Knime, 
** Mesos framework for long running services https://github.com/mesosphere/marathon
** Hive
*** HOWTO use Hive to SQLize your own Tweets Part II http://hortonworks.com/blog/howto-use-hive-to-sqlize-your-own-tweets-part-two-loading-hive-sql-queries/
*** Hive Cheat-sheet http://hortonworks.com/blog/hive-cheat-sheet-for-sql-users/
** Why all this interest in Spark? by Denny Lee http://dennyglee.com/2013/08/19/why-all-this-interest-in-spark/
** MINI BATCH K-MEANS  http://algorithmicthoughts.wordpress.com/2013/07/26/machine-learning-mini-batch-k-means/
** Difference between Crunch and Cascading http://www.quora.com/Apache-Hadoop/What-are-the-differences-between-Crunch-and-Cascading
** Python library for dealing with messy tabular data in several formats, guessing types and detecting headers. https://messytables.readthedocs.org/en/latest/
** Stream summarizer and cardinality estimator in java https://github.com/clearspring/stream-lib 
** R basic tutorials http://www.youtube.com/watch?v=iffR3fWv4xw&list=PLOU2XLYxmsIK9qQfztXeybpHvru-TrqAP
** hRaven collects run time data and statistics from MapReduce jobs in an easily queryable format https://github.com/twitter/hraven
**  Open Platform for Visual Analytics http://www.datapad.io/
** cascading Paco Nathan http://hadoopsummit.org/san-jose-blog/speaker-interview-paco-nathan/
"That workflow abstraction is important. For example, PMML has
excellent features for ensembles and other complex patterns
encountered in the more competitive areas of industry."
** Introduction to Data Processing with Python http://opentechschool.github.io/python-data-intro/
** Apache Hadoop YARN, NameNode HA, HDFS Federation http://de.slideshare.net/AdamKawa/apache-hadoop-yarn-namenode-ha-hdfs-federation
** Building a Classification Framework with Hive and Python http://www.impermium.com/blog/building-a-classification-network-with-hive-python/
** how twitter uses nosql : FlockDB pig http://readwrite.com/2011/01/02/how-twitter-uses-nosql
** DEAP is a novel evolutionary computation framework for rapid prototyping and testing of ideas. https://code.google.com/p/deap/
** Big Data Cloud Classes by Bill Howe http://homes.cs.washington.edu/~billhowe/bigdatacloud/
** mrjob : Run MapReduce jobs on Hadoop or Amazon Web Service https://github.com/Yelp/mrjob
** A set of tutorial codes about matrix methods in Hadoop with mrjob https://github.com/dgleich/matrix-hadoop-tutorial
