toread.html

<div id="outline-container-33-17" class="outline-3">
<h3 id="sec-33-17">inclass challenge <a href="https://inclass.kaggle.com/">https://inclass.kaggle.com/</a></h3>
<div class="outline-text-3" id="text-33-17">

</div>

</div>

<div id="outline-container-33-18" class="outline-3">
<h3 id="sec-33-18">Hadoop assignement on azure <a href="http://homes.cs.washington.edu/~billhowe/bigdatacloud/lecture3/assignment3.html">http://homes.cs.washington.edu/~billhowe/bigdatacloud/lecture3/assignment3.html</a></h3>
<div class="outline-text-3" id="text-33-18">

</div>
</div>

</div>

<div id="outline-container-34" class="outline-2">
<h2 id="sec-34">Data API</h2>
<div class="outline-text-2" id="text-34">


</div>

<div id="outline-container-34-1" class="outline-3">
<h3 id="sec-34-1">Using OpenRefine <a href="http://openrefine.org/">http://openrefine.org/</a> to Clean Multiple Documents in the Same Way <a href="http://schoolofdata.org/2013/07/26/using-openrefine-to-clean-multiple-documents-in-the-same-way/">http://schoolofdata.org/2013/07/26/using-openrefine-to-clean-multiple-documents-in-the-same-way/</a></h3>
<div class="outline-text-3" id="text-34-1">

</div>

</div>

<div id="outline-container-34-2" class="outline-3">
<h3 id="sec-34-2">Machine Learning API : mashape <a href="http://blog.mashape.com/post/48074869493/list-of-40-machine-learning-apis">http://blog.mashape.com/post/48074869493/list-of-40-machine-learning-apis</a></h3>
<div class="outline-text-3" id="text-34-2">

</div>

</div>

<div id="outline-container-34-3" class="outline-3">
<h3 id="sec-34-3">NLP in APIs <a href="http://blog.mashape.com/post/48946187179/15-natural-language-processing-apis">http://blog.mashape.com/post/48946187179/15-natural-language-processing-apis</a></h3>
<div class="outline-text-3" id="text-34-3">

</div>
</div>

</div>

<div id="outline-container-35" class="outline-2">
<h2 id="sec-35">Data Computing</h2>
<div class="outline-text-2" id="text-35">


</div>

<div id="outline-container-35-1" class="outline-3">
<h3 id="sec-35-1">How to write a crawler by Emanuele Minotto <a href="http://www.emanueleminotto.it/how-to-write-a-crawler">http://www.emanueleminotto.it/how-to-write-a-crawler</a></h3>
<div class="outline-text-3" id="text-35-1">

</div>

</div>

<div id="outline-container-35-2" class="outline-3">
<h3 id="sec-35-2">Auto-Scaling with Apache Helix and Apache YARN <a href="http://engineering.linkedin.com/cluster-management/auto-scaling-apache-helix-and-apache-yarn">http://engineering.linkedin.com/cluster-management/auto-scaling-apache-helix-and-apache-yarn</a></h3>
<div class="outline-text-3" id="text-35-2">

</div>

</div>

<div id="outline-container-35-3" class="outline-3">
<h3 id="sec-35-3">Quick tour of hive pigh data scientists tools via hortonworks <a href="http://hortonworks.com/get-started/analyze/">http://hortonworks.com/get-started/analyze/</a></h3>
<div class="outline-text-3" id="text-35-3">

</div>

</div>

<div id="outline-container-35-4" class="outline-3">
<h3 id="sec-35-4">Evolutionary Computing with Push <a href="http://faculty.hampshire.edu/lspector/push.html">http://faculty.hampshire.edu/lspector/push.html</a></h3>
<div class="outline-text-3" id="text-35-4">

</div>

</div>

<div id="outline-container-35-5" class="outline-3">
<h3 id="sec-35-5">Amazon EMR / S3</h3>
<div class="outline-text-3" id="text-35-5">


</div>

<div id="outline-container-35-5-1" class="outline-4">
<h4 id="sec-35-5-1"><a href="http://www.datasciencecentral.com/profiles/blogs/s3-as-input-or-output-for-hadoop-mr-jobs">http://www.datasciencecentral.com/profiles/blogs/s3-as-input-or-output-for-hadoop-mr-jobs</a></h4>
<div class="outline-text-4" id="text-35-5-1">

</div>

</div>

<div id="outline-container-35-5-2" class="outline-4">
<h4 id="sec-35-5-2">Usage of elasticmapreduce script <a href="http://sujee.net/tech/articles/hadoop/amazon-emr-beyond-basics/">http://sujee.net/tech/articles/hadoop/amazon-emr-beyond-basics/</a></h4>
<div class="outline-text-4" id="text-35-5-2">

</div>

</div>

<div id="outline-container-35-5-3" class="outline-4">
<h4 id="sec-35-5-3">s3cmd : command line S3 client <a href="http://s3tools.org/s3cmd">http://s3tools.org/s3cmd</a></h4>
<div class="outline-text-4" id="text-35-5-3">

</div>
</div>

</div>

<div id="outline-container-35-6" class="outline-3">
<h3 id="sec-35-6">ETL tools</h3>
<div class="outline-text-3" id="text-35-6">

<ul>
<li>AMPLab &ndash; Mesos, plus BDAS Berkeley Data Analytics Stack 
</li>
<li>Cascading/Cascalog/Scalding, not limited to Hadoop since other topologies are possibles; 
</li>
<li>Twitter &ndash; Summingbird, Storm, etc.; 
</li>
<li>Facebook &ndash; Presto; 
</li>
<li>Anaconda/IPython/Pandas; 
</li>
<li>Actian/ParAccel/Knime, 
</li>
</ul>

</div>

</div>

<div id="outline-container-35-7" class="outline-3">
<h3 id="sec-35-7">Mesos framework for long running services <a href="https://github.com/mesosphere/marathon">https://github.com/mesosphere/marathon</a></h3>
<div class="outline-text-3" id="text-35-7">

</div>

</div>

<div id="outline-container-35-8" class="outline-3">
<h3 id="sec-35-8">Hive</h3>
<div class="outline-text-3" id="text-35-8">


</div>

<div id="outline-container-35-8-1" class="outline-4">
<h4 id="sec-35-8-1">HOWTO use Hive to SQLize your own Tweets Part II <a href="http://hortonworks.com/blog/howto-use-hive-to-sqlize-your-own-tweets-part-two-loading-hive-sql-queries/">http://hortonworks.com/blog/howto-use-hive-to-sqlize-your-own-tweets-part-two-loading-hive-sql-queries/</a></h4>
<div class="outline-text-4" id="text-35-8-1">

</div>

</div>

<div id="outline-container-35-8-2" class="outline-4">
<h4 id="sec-35-8-2">Hive Cheat-sheet <a href="http://hortonworks.com/blog/hive-cheat-sheet-for-sql-users/">http://hortonworks.com/blog/hive-cheat-sheet-for-sql-users/</a></h4>
<div class="outline-text-4" id="text-35-8-2">

</div>
</div>

</div>

<div id="outline-container-35-9" class="outline-3">
<h3 id="sec-35-9">Why all this interest in Spark? by Denny Lee <a href="http://dennyglee.com/2013/08/19/why-all-this-interest-in-spark/">http://dennyglee.com/2013/08/19/why-all-this-interest-in-spark/</a></h3>
<div class="outline-text-3" id="text-35-9">

</div>

</div>

<div id="outline-container-35-10" class="outline-3">
<h3 id="sec-35-10">MINI BATCH K-MEANS  <a href="http://algorithmicthoughts.wordpress.com/2013/07/26/machine-learning-mini-batch-k-means/">http://algorithmicthoughts.wordpress.com/2013/07/26/machine-learning-mini-batch-k-means/</a></h3>
<div class="outline-text-3" id="text-35-10">

</div>

</div>

<div id="outline-container-35-11" class="outline-3">
<h3 id="sec-35-11">Difference between Crunch and Cascading <a href="http://www.quora.com/Apache-Hadoop/What-are-the-differences-between-Crunch-and-Cascading">http://www.quora.com/Apache-Hadoop/What-are-the-differences-between-Crunch-and-Cascading</a></h3>
<div class="outline-text-3" id="text-35-11">

</div>

</div>

<div id="outline-container-35-12" class="outline-3">
<h3 id="sec-35-12">Python library for dealing with messy tabular data in several formats, guessing types and detecting headers. <a href="https://messytables.readthedocs.org/en/latest/">https://messytables.readthedocs.org/en/latest/</a></h3>
<div class="outline-text-3" id="text-35-12">

</div>

</div>

<div id="outline-container-35-13" class="outline-3">
<h3 id="sec-35-13">Stream summarizer and cardinality estimator in java <a href="https://github.com/clearspring/stream-lib">https://github.com/clearspring/stream-lib</a></h3>
<div class="outline-text-3" id="text-35-13">

</div>

</div>

<div id="outline-container-35-14" class="outline-3">
<h3 id="sec-35-14">R basic tutorials <a href="http://www.youtube.com/watch?v=iffR3fWv4xw&amp;list=PLOU2XLYxmsIK9qQfztXeybpHvru-TrqAP">http://www.youtube.com/watch?v=iffR3fWv4xw&amp;list=PLOU2XLYxmsIK9qQfztXeybpHvru-TrqAP</a></h3>
<div class="outline-text-3" id="text-35-14">

</div>

</div>

<div id="outline-container-35-15" class="outline-3">
<h3 id="sec-35-15">hRaven collects run time data and statistics from MapReduce jobs in an easily queryable format <a href="https://github.com/twitter/hraven">https://github.com/twitter/hraven</a></h3>
<div class="outline-text-3" id="text-35-15">

</div>

</div>

<div id="outline-container-35-16" class="outline-3">
<h3 id="sec-35-16">Open Platform for Visual Analytics <a href="http://www.datapad.io/">http://www.datapad.io/</a></h3>
<div class="outline-text-3" id="text-35-16">

</div>

</div>

<div id="outline-container-35-17" class="outline-3">
<h3 id="sec-35-17">cascading Paco Nathan <a href="http://hadoopsummit.org/san-jose-blog/speaker-interview-paco-nathan/">http://hadoopsummit.org/san-jose-blog/speaker-interview-paco-nathan/</a></h3>
<div class="outline-text-3" id="text-35-17">

<p>"That workflow abstraction is important. For example, PMML has
excellent features for ensembles and other complex patterns
encountered in the more competitive areas of industry."
</p></div>

</div>

<div id="outline-container-35-18" class="outline-3">
<h3 id="sec-35-18">Introduction to Data Processing with Python <a href="http://opentechschool.github.io/python-data-intro/">http://opentechschool.github.io/python-data-intro/</a></h3>
<div class="outline-text-3" id="text-35-18">

</div>

</div>

<div id="outline-container-35-19" class="outline-3">
<h3 id="sec-35-19">Apache Hadoop YARN, NameNode HA, HDFS Federation <a href="http://de.slideshare.net/AdamKawa/apache-hadoop-yarn-namenode-ha-hdfs-federation">http://de.slideshare.net/AdamKawa/apache-hadoop-yarn-namenode-ha-hdfs-federation</a></h3>
<div class="outline-text-3" id="text-35-19">

</div>

</div>

<div id="outline-container-35-20" class="outline-3">
<h3 id="sec-35-20">Building a Classification Framework with Hive and Python <a href="http://www.impermium.com/blog/building-a-classification-network-with-hive-python/">http://www.impermium.com/blog/building-a-classification-network-with-hive-python/</a></h3>
<div class="outline-text-3" id="text-35-20">

</div>

</div>

<div id="outline-container-35-21" class="outline-3">
<h3 id="sec-35-21">how twitter uses nosql : FlockDB pig <a href="http://readwrite.com/2011/01/02/how-twitter-uses-nosql">http://readwrite.com/2011/01/02/how-twitter-uses-nosql</a></h3>
<div class="outline-text-3" id="text-35-21">

</div>

</div>

<div id="outline-container-35-22" class="outline-3">
<h3 id="sec-35-22">DEAP is a novel evolutionary computation framework for rapid prototyping and testing of ideas. <a href="https://code.google.com/p/deap/">https://code.google.com/p/deap/</a></h3>
<div class="outline-text-3" id="text-35-22">

</div>

</div>

<div id="outline-container-35-23" class="outline-3">
<h3 id="sec-35-23">Big Data Cloud Classes by Bill Howe <a href="http://homes.cs.washington.edu/~billhowe/bigdatacloud/">http://homes.cs.washington.edu/~billhowe/bigdatacloud/</a></h3>
<div class="outline-text-3" id="text-35-23">

</div>

</div>

<div id="outline-container-35-24" class="outline-3">
<h3 id="sec-35-24">mrjob : Run MapReduce jobs on Hadoop or Amazon Web Service <a href="https://github.com/Yelp/mrjob">https://github.com/Yelp/mrjob</a></h3>
<div class="outline-text-3" id="text-35-24">

</div>

</div>

<div id="outline-container-35-25" class="outline-3">
<h3 id="sec-35-25">A set of tutorial codes about matrix methods in Hadoop with mrjob <a href="https://github.com/dgleich/matrix-hadoop-tutorial">https://github.com/dgleich/matrix-hadoop-tutorial</a></h3>
<div class="outline-text-3" id="text-35-25">

</div>

</div>
