toread.org
** Implementation of some deep learning algorithms (python C) build on top of cudamat https://github.com/nitishsrivastava/deepnet
** Trident-ML is a realtime online machine learning library built on top storm https://github.com/pmerienne/trident-ml
** map-reduce algorithms explained slides http://de.slideshare.net/amundtveit/mapreduce-algorithms
** Machine Learning with Storm + Redis @ skillsmatter http://skillsmatter.com/podcast/java-jee/machine-learning-with-storm-redis/
https://github.com/yods/storm-ml-play http://skillsmatter.com/event/java-jee/machine-learning-with-storm-redis https://github.com/MastodonC/r4f-data
** Heka, a tool for high performance data gathering, analysis, monitoring, and reporting http://blog.mozilla.org/services/2013/04/30/introducing-heka
Main component hekad http://hekad.readthedocs.org/en/latest/
** Hacking Redis series http://www.starkiller.net/hacking-redis/
** Hacking Redis (data structure server): Adding Interval Sets http://www.starkiller.net/2013/05/03/hacking-redis-adding-interval-sets
** R integration in strom https://github.com/quintona/storm-r
** SAMOA Scalable Advanced Massive Online Analysis based on storm + S4 http://samoa-project.net/ 
http://melmeric.files.wordpress.com/2013/04/samoa-a-platform-for-mining-big-data-streams.pdf
** Hadoop ecosystem overview http://www.analyticbridge.com/profiles/blogs/hadoop-herd-when-to-use-what?buffer_share=b5608
** Big Data Architecture http://adamfowlerml.wordpress.com/2013/04/29/thoughts-on-nosql-big-data-architecture/
** Manual Octave http://math.jacobs-university.de/oliver/teaching/iub/resources/octave/octave-intro/octave-intro.html
** Top 20 R packages http://datascientistinsights.com/2013/02/25/20-r-packages-that-should-impact-every-data-scientist/
** Hadoop intro http://www.drdobbs.com/database/hadoop-the-lay-of-the-land/240150854
** Hadoop flume usage http://blog.guident.com/2013/05/streaming-twitter-into-the-hortonworks-data-platform-1-2/
** Hadoop virtualization http://nosql.mypopescu.com/post/49258558385/hadoop-virtualization
** Recommandation with Mahout http://blog.comsysto.com/2013/03/04/building-an-online-recommendation-engine-with-mongodb-and-mahout/
http://blog.comsysto.com/2013/04/03/background-of-collaborative-filtering-with-mahout/
** Modeling ML algorithms with Hadoop http://de.slideshare.net/hadoop/modeling-with-hadoop-kdd2011
** Machine Learning with scikit-learn (python) http://datasciencelondon.org/machine-learning-python-scikit-learn-ipython-dsldn-data-science-london-kaggle/
https://github.com/amueller/sklearn_tutorial/blob/master/ml_with_sklearn_notebook.ipynb
http://nbviewer.ipython.org/5115540/Model%20Selection%20for%20the%20Nystroem%20Method.ipynb
** HP research : Presto Distributed R for big data http://www.hpl.hp.com/research/documentation.htm
** Data Analysis with the Unix Shell http://blog.comsysto.com/2013/04/25/data-analysis-with-the-unix-shell/
** Serengeti to enable the rapid deployment of Hadoop clusters on a virtual platform. http://serengeti.cloudfoundry.com/
** Hadoop ecosystem explained http://smartdatacollective.com/mtariq/120791/hadoop-toolbox-when-use-what
** Impala presentation similar to drill http://gigaom.com/2013/04/30/with-impala-now-ga-clouderas-ceo-sizes-up-the-sql-on-hadoop-market/
** Large Scale Math with Hadoop MapReduce @hortonworks http://de.slideshare.net/hortonworks/large-scale-math-with-hadoop-mapreduce
** Twitter search use case : storm + kafka +  Mechanical Turk http://engineering.twitter.com/2013/01/improving-twitter-search-with-real-time.html
** Big data definition @Hortonworks : http://hortonworks.com/blog/big-data-defined-part-deux-value-definition/ http://hortonworks.com/blog/big-data-defined/
** Hadoop and the Data Warehouse: When to Use Which http://hortonworks.com/blog/hadoop-and-the-data-warehouse-when-to-use-which/
** Hadoop @revelytix white papers http://www.revelytix.com/?q=content/revelytix-white-papers
** Index Sorting with Lucene http://shaierera.blogspot.com/2013/04/index-sorting-with-lucene.html
** Apache Hadoop NextGen MapReduce (YARN) http://hadoop.apache.org/docs/current/hadoop-yarn/hadoop-yarn-site/YARN.html
