toread.html

<div id="outline-container-35-26" class="outline-3">
<h3 id="sec-35-26">Implementation of some deep learning algorithms (python C) build on top of cudamat <a href="https://github.com/nitishsrivastava/deepnet">https://github.com/nitishsrivastava/deepnet</a></h3>
<div class="outline-text-3" id="text-35-26">

</div>

</div>

<div id="outline-container-35-27" class="outline-3">
<h3 id="sec-35-27">Trident-ML is a realtime online machine learning library built on top storm <a href="https://github.com/pmerienne/trident-ml">https://github.com/pmerienne/trident-ml</a></h3>
<div class="outline-text-3" id="text-35-27">

</div>

</div>

<div id="outline-container-35-28" class="outline-3">
<h3 id="sec-35-28">map-reduce algorithms explained slides <a href="http://de.slideshare.net/amundtveit/mapreduce-algorithms">http://de.slideshare.net/amundtveit/mapreduce-algorithms</a></h3>
<div class="outline-text-3" id="text-35-28">

</div>

</div>

<div id="outline-container-35-29" class="outline-3">
<h3 id="sec-35-29">Machine Learning with Storm + Redis @ skillsmatter <a href="http://skillsmatter.com/podcast/java-jee/machine-learning-with-storm-redis/">http://skillsmatter.com/podcast/java-jee/machine-learning-with-storm-redis/</a></h3>
<div class="outline-text-3" id="text-35-29">

<p><a href="https://github.com/yods/storm-ml-play">https://github.com/yods/storm-ml-play</a> <a href="http://skillsmatter.com/event/java-jee/machine-learning-with-storm-redis">http://skillsmatter.com/event/java-jee/machine-learning-with-storm-redis</a> <a href="https://github.com/MastodonC/r4f-data">https://github.com/MastodonC/r4f-data</a>
</p></div>

</div>

<div id="outline-container-35-30" class="outline-3">
<h3 id="sec-35-30">Heka, a tool for high performance data gathering, analysis, monitoring, and reporting <a href="http://blog.mozilla.org/services/2013/04/30/introducing-heka">http://blog.mozilla.org/services/2013/04/30/introducing-heka</a></h3>
<div class="outline-text-3" id="text-35-30">

<p>Main component hekad <a href="http://hekad.readthedocs.org/en/latest/">http://hekad.readthedocs.org/en/latest/</a>
</p></div>

</div>

<div id="outline-container-35-31" class="outline-3">
<h3 id="sec-35-31">Hacking Redis series <a href="http://www.starkiller.net/hacking-redis/">http://www.starkiller.net/hacking-redis/</a></h3>
<div class="outline-text-3" id="text-35-31">

</div>

</div>

<div id="outline-container-35-32" class="outline-3">
<h3 id="sec-35-32">Hacking Redis (data structure server): Adding Interval Sets <a href="http://www.starkiller.net/2013/05/03/hacking-redis-adding-interval-sets">http://www.starkiller.net/2013/05/03/hacking-redis-adding-interval-sets</a></h3>
<div class="outline-text-3" id="text-35-32">

</div>

</div>

<div id="outline-container-35-33" class="outline-3">
<h3 id="sec-35-33">R integration in strom <a href="https://github.com/quintona/storm-r">https://github.com/quintona/storm-r</a></h3>
<div class="outline-text-3" id="text-35-33">

</div>

</div>

<div id="outline-container-35-34" class="outline-3">
<h3 id="sec-35-34">SAMOA Scalable Advanced Massive Online Analysis based on storm + S4 <a href="http://samoa-project.net/">http://samoa-project.net/</a></h3>
<div class="outline-text-3" id="text-35-34">

<p><a href="http://melmeric.files.wordpress.com/2013/04/samoa-a-platform-for-mining-big-data-streams.pdf">http://melmeric.files.wordpress.com/2013/04/samoa-a-platform-for-mining-big-data-streams.pdf</a>
</p></div>

</div>

<div id="outline-container-35-35" class="outline-3">
<h3 id="sec-35-35">Hadoop ecosystem overview <a href="http://www.analyticbridge.com/profiles/blogs/hadoop-herd-when-to-use-what?buffer_share=b5608">http://www.analyticbridge.com/profiles/blogs/hadoop-herd-when-to-use-what?buffer_share=b5608</a></h3>
<div class="outline-text-3" id="text-35-35">

</div>

</div>

<div id="outline-container-35-36" class="outline-3">
<h3 id="sec-35-36">Big Data Architecture <a href="http://adamfowlerml.wordpress.com/2013/04/29/thoughts-on-nosql-big-data-architecture/">http://adamfowlerml.wordpress.com/2013/04/29/thoughts-on-nosql-big-data-architecture/</a></h3>
<div class="outline-text-3" id="text-35-36">

</div>

</div>

<div id="outline-container-35-37" class="outline-3">
<h3 id="sec-35-37">Manual Octave <a href="http://math.jacobs-university.de/oliver/teaching/iub/resources/octave/octave-intro/octave-intro.html">http://math.jacobs-university.de/oliver/teaching/iub/resources/octave/octave-intro/octave-intro.html</a></h3>
<div class="outline-text-3" id="text-35-37">

</div>

</div>

<div id="outline-container-35-38" class="outline-3">
<h3 id="sec-35-38">Top 20 R packages <a href="http://datascientistinsights.com/2013/02/25/20-r-packages-that-should-impact-every-data-scientist/">http://datascientistinsights.com/2013/02/25/20-r-packages-that-should-impact-every-data-scientist/</a></h3>
<div class="outline-text-3" id="text-35-38">

</div>

</div>

<div id="outline-container-35-39" class="outline-3">
<h3 id="sec-35-39">Hadoop intro <a href="http://www.drdobbs.com/database/hadoop-the-lay-of-the-land/240150854">http://www.drdobbs.com/database/hadoop-the-lay-of-the-land/240150854</a></h3>
<div class="outline-text-3" id="text-35-39">

</div>

</div>

<div id="outline-container-35-40" class="outline-3">
<h3 id="sec-35-40">Hadoop flume usage <a href="http://blog.guident.com/2013/05/streaming-twitter-into-the-hortonworks-data-platform-1-2/">http://blog.guident.com/2013/05/streaming-twitter-into-the-hortonworks-data-platform-1-2/</a></h3>
<div class="outline-text-3" id="text-35-40">

</div>

</div>

<div id="outline-container-35-41" class="outline-3">
<h3 id="sec-35-41">Hadoop virtualization <a href="http://nosql.mypopescu.com/post/49258558385/hadoop-virtualization">http://nosql.mypopescu.com/post/49258558385/hadoop-virtualization</a></h3>
<div class="outline-text-3" id="text-35-41">

</div>

</div>

<div id="outline-container-35-42" class="outline-3">
<h3 id="sec-35-42">Recommandation with Mahout <a href="http://blog.comsysto.com/2013/03/04/building-an-online-recommendation-engine-with-mongodb-and-mahout/">http://blog.comsysto.com/2013/03/04/building-an-online-recommendation-engine-with-mongodb-and-mahout/</a></h3>
<div class="outline-text-3" id="text-35-42">

<p><a href="http://blog.comsysto.com/2013/04/03/background-of-collaborative-filtering-with-mahout/">http://blog.comsysto.com/2013/04/03/background-of-collaborative-filtering-with-mahout/</a>
</p></div>

</div>

<div id="outline-container-35-43" class="outline-3">
<h3 id="sec-35-43">Modeling ML algorithms with Hadoop <a href="http://de.slideshare.net/hadoop/modeling-with-hadoop-kdd2011">http://de.slideshare.net/hadoop/modeling-with-hadoop-kdd2011</a></h3>
<div class="outline-text-3" id="text-35-43">

</div>

</div>

<div id="outline-container-35-44" class="outline-3">
<h3 id="sec-35-44">Machine Learning with scikit-learn (python) <a href="http://datasciencelondon.org/machine-learning-python-scikit-learn-ipython-dsldn-data-science-london-kaggle/">http://datasciencelondon.org/machine-learning-python-scikit-learn-ipython-dsldn-data-science-london-kaggle/</a></h3>
<div class="outline-text-3" id="text-35-44">

<p><a href="https://github.com/amueller/sklearn_tutorial/blob/master/ml_with_sklearn_notebook.ipynb">https://github.com/amueller/sklearn_tutorial/blob/master/ml_with_sklearn_notebook.ipynb</a>
<a href="http://nbviewer.ipython.org/5115540/Model Selection for the Nystroem Method.ipynb">http://nbviewer.ipython.org/5115540/Model%20Selection%20for%20the%20Nystroem%20Method.ipynb</a>
</p></div>

</div>

<div id="outline-container-35-45" class="outline-3">
<h3 id="sec-35-45">HP research : Presto Distributed R for big data <a href="http://www.hpl.hp.com/research/documentation.htm">http://www.hpl.hp.com/research/documentation.htm</a></h3>
<div class="outline-text-3" id="text-35-45">

</div>

</div>

<div id="outline-container-35-46" class="outline-3">
<h3 id="sec-35-46">Data Analysis with the Unix Shell <a href="http://blog.comsysto.com/2013/04/25/data-analysis-with-the-unix-shell/">http://blog.comsysto.com/2013/04/25/data-analysis-with-the-unix-shell/</a></h3>
<div class="outline-text-3" id="text-35-46">

</div>

</div>

<div id="outline-container-35-47" class="outline-3">
<h3 id="sec-35-47">Serengeti to enable the rapid deployment of Hadoop clusters on a virtual platform. <a href="http://serengeti.cloudfoundry.com/">http://serengeti.cloudfoundry.com/</a></h3>
<div class="outline-text-3" id="text-35-47">

</div>

</div>

<div id="outline-container-35-48" class="outline-3">
<h3 id="sec-35-48">Hadoop ecosystem explained <a href="http://smartdatacollective.com/mtariq/120791/hadoop-toolbox-when-use-what">http://smartdatacollective.com/mtariq/120791/hadoop-toolbox-when-use-what</a></h3>
<div class="outline-text-3" id="text-35-48">

</div>

</div>

<div id="outline-container-35-49" class="outline-3">
<h3 id="sec-35-49">Impala presentation similar to drill <a href="http://gigaom.com/2013/04/30/with-impala-now-ga-clouderas-ceo-sizes-up-the-sql-on-hadoop-market/">http://gigaom.com/2013/04/30/with-impala-now-ga-clouderas-ceo-sizes-up-the-sql-on-hadoop-market/</a></h3>
<div class="outline-text-3" id="text-35-49">

</div>

</div>

<div id="outline-container-35-50" class="outline-3">
<h3 id="sec-35-50">Large Scale Math with Hadoop MapReduce @hortonworks <a href="http://de.slideshare.net/hortonworks/large-scale-math-with-hadoop-mapreduce">http://de.slideshare.net/hortonworks/large-scale-math-with-hadoop-mapreduce</a></h3>
<div class="outline-text-3" id="text-35-50">

</div>

</div>

<div id="outline-container-35-51" class="outline-3">
<h3 id="sec-35-51">Twitter search use case : storm + kafka +  Mechanical Turk <a href="http://engineering.twitter.com/2013/01/improving-twitter-search-with-real-time.html">http://engineering.twitter.com/2013/01/improving-twitter-search-with-real-time.html</a></h3>
<div class="outline-text-3" id="text-35-51">

</div>

</div>

<div id="outline-container-35-52" class="outline-3">
<h3 id="sec-35-52">Big data definition @Hortonworks : <a href="http://hortonworks.com/blog/big-data-defined-part-deux-value-definition/">http://hortonworks.com/blog/big-data-defined-part-deux-value-definition/</a> <a href="http://hortonworks.com/blog/big-data-defined/">http://hortonworks.com/blog/big-data-defined/</a></h3>
<div class="outline-text-3" id="text-35-52">

</div>

</div>

<div id="outline-container-35-53" class="outline-3">
<h3 id="sec-35-53">Hadoop and the Data Warehouse: When to Use Which <a href="http://hortonworks.com/blog/hadoop-and-the-data-warehouse-when-to-use-which/">http://hortonworks.com/blog/hadoop-and-the-data-warehouse-when-to-use-which/</a></h3>
<div class="outline-text-3" id="text-35-53">

</div>

</div>

<div id="outline-container-35-54" class="outline-3">
<h3 id="sec-35-54">Hadoop @revelytix white papers <a href="http://www.revelytix.com/?q=content/revelytix-white-papers">http://www.revelytix.com/?q=content/revelytix-white-papers</a></h3>
<div class="outline-text-3" id="text-35-54">

</div>

</div>

<div id="outline-container-35-55" class="outline-3">
<h3 id="sec-35-55">Index Sorting with Lucene <a href="http://shaierera.blogspot.com/2013/04/index-sorting-with-lucene.html">http://shaierera.blogspot.com/2013/04/index-sorting-with-lucene.html</a></h3>
<div class="outline-text-3" id="text-35-55">

</div>

</div>

<div id="outline-container-35-56" class="outline-3">
<h3 id="sec-35-56">Apache Hadoop NextGen MapReduce (YARN) <a href="http://hadoop.apache.org/docs/current/hadoop-yarn/hadoop-yarn-site/YARN.html">http://hadoop.apache.org/docs/current/hadoop-yarn/hadoop-yarn-site/YARN.html</a></h3>
<div class="outline-text-3" id="text-35-56">

</div>

</div>
