toread.org
** Doug Cutting interview http://blog.cloudera.com/blog/2013/04/meet-the-project-founder-doug-cutting-first-in-a-series/
** Hadoop prefect for OpenStack : http://hortonworks.com/blog/hadoop-perect-app-for-openstack/
** Data locality : Hadoop rant http://blogs.splunk.com/2013/04/24/hadoop-rant/
** Hadoop YARN + Storm @yahoo http://developer.yahoo.com/blogs/ydn/storm-hadoop-convergence-big-data-low-latency-processing-54503.html
** linkedin archtecture : kafka , hadoop , voldemort , nodejs http://engineering.linkedin.com/mobile/linkedin-mobile-introducing-personalized-navigation
** Hadoop interview QA http://www.pappupass.com/class/index.php/hadoop/hadoop-interview-questions
** Hadoop mapReduce in python http://www.michael-noll.com/tutorials/writing-an-hadoop-mapreduce-program-in-python/index.html
** DB architecture http://nosql.mypopescu.com/post/48612962822/typical-big-data-architecture
** Shark real-time http://telruptive.com/2012/08/15/hadoop-for-real-time-spark-shark-spark-streaming-bagel-etc-will-be-2012s-new-buzzwords/
** Hadoop made simple with jydoop http://benjamin.smedbergs.us/blog/2013-04-09/introducing-jydoop-fast-and-sane-map-reduce/
** Parquet columnar storage http://blog.cloudera.com/blog/2013/03/introducing-parquet-columnar-storage-for-apache-hadoop/
**  http://blog.cloudera.com/blog/2013/03/cloudera_ml_data_science_tools/
**  Free Hadoop book: http://www.hadoopilluminated.com/
** Saddle is a data manipulation library for Scala  http://saddle.github.com/doc/index.html
** nathan Marz views on data systems http://www.odbms.org/blog/2013/04/on-innovation-interview-with-nathan-marz/

* Data Science
** Text Feature Extraction (td-idf) part-2 by Christian S. Perone http://pyevolve.sourceforge.net/wordpress/?p=1747
** Estimating User Lifetimes : pyMCMC by Cam Davidson-Pilon @cmrn_dp  http://blog.yhathq.com/posts/estimating-user-lifetimes-with-pymc.html
** Towards Linked Statistical Data Analysis http://csarven.ca/linked-statistical-data-analysis
** Can someone explain Kernel Trick intuitively? http://www.reddit.com/r/MachineLearning/comments/1joh9v/can_someone_explain_kernel_trick_intuitively/
** alternating direction method of multipliers is well suited to distributed convex optimization http://www.stanford.edu/~boyd/papers/admm_distr_stats.html
** 3 Big Data Tech Talks You Can’t Miss by Christos Faloutsos Deepak Agarwal Jay Kreps http://engineering.linkedin.com/event/video-3-big-data-tech-talks-you-can%E2%80%99t-miss
** Block Coordinate Descent Algorithms for Large-scale Sparse Multiclass Classification by Mathieu Blondel http://www.mblondel.org/code/mlj2013/ 
** Machine Learning in python : blog http://www.mblondel.org/
** The World’s Top 7 Data Scientists before there was Data Science http://conductrics.com/the-worlds-7-top-data-scientists-before-there-was-datascience/
** The Multi-Armed Bandit Problem with examples and visualization http://camdp.com/blogs/multi-armed-bandits
** NLP
***  NAACL 2013 http://naacl2013.naacl.org/ videos http://techtalks.tv/events/312/573/
*** NLP for machine learning Starta 2013 http://strata.oreilly.com/2013/03/natural-language-annotation-for-machine-learning.html
** Recommendation System
*** myrrix succesor of mahout ? http://myrrix.com/quick-start/
java -Dmodel.features=100 -Dmodel.als.lambda=2 -Xmx512m -jar myrrix-serving-1.0.1.jar --port 8080
*** How Hacker News ranking algorithm works in Paul raham lisp http://amix.dk/blog/post/19574
*** Deconstructing Recommender Systems : Amazon and Netflix use cases http://spectrum.ieee.org/computing/software/deconstructing-recommender-systems
*** LensKit is an open source toolkit . http://lenskit.grouplens.org/ https://bitbucket.org/grouplens/lenskit/wiki/Home
** Deep Learning
*** Rocher Socher tutorial on Deep Learning http://www.socher.org/index.php/DeepLearningTutorial/DeepLearningTutorial
*** Deep Learning Comes of Age by Gary Anthes http://cacm.acm.org/magazines/2013/6/164601-deep-learning-comes-of-age/fulltext
