toread.html

<div id="outline-container-35-57" class="outline-3">
<h3 id="sec-35-57">Doug Cutting interview <a href="http://blog.cloudera.com/blog/2013/04/meet-the-project-founder-doug-cutting-first-in-a-series/">http://blog.cloudera.com/blog/2013/04/meet-the-project-founder-doug-cutting-first-in-a-series/</a></h3>
<div class="outline-text-3" id="text-35-57">

</div>

</div>

<div id="outline-container-35-58" class="outline-3">
<h3 id="sec-35-58">Hadoop prefect for OpenStack : <a href="http://hortonworks.com/blog/hadoop-perect-app-for-openstack/">http://hortonworks.com/blog/hadoop-perect-app-for-openstack/</a></h3>
<div class="outline-text-3" id="text-35-58">

</div>

</div>

<div id="outline-container-35-59" class="outline-3">
<h3 id="sec-35-59">Data locality : Hadoop rant <a href="http://blogs.splunk.com/2013/04/24/hadoop-rant/">http://blogs.splunk.com/2013/04/24/hadoop-rant/</a></h3>
<div class="outline-text-3" id="text-35-59">

</div>

</div>

<div id="outline-container-35-60" class="outline-3">
<h3 id="sec-35-60">Hadoop YARN + Storm @yahoo <a href="http://developer.yahoo.com/blogs/ydn/storm-hadoop-convergence-big-data-low-latency-processing-54503.html">http://developer.yahoo.com/blogs/ydn/storm-hadoop-convergence-big-data-low-latency-processing-54503.html</a></h3>
<div class="outline-text-3" id="text-35-60">

</div>

</div>

<div id="outline-container-35-61" class="outline-3">
<h3 id="sec-35-61">linkedin archtecture : kafka , hadoop , voldemort , nodejs <a href="http://engineering.linkedin.com/mobile/linkedin-mobile-introducing-personalized-navigation">http://engineering.linkedin.com/mobile/linkedin-mobile-introducing-personalized-navigation</a></h3>
<div class="outline-text-3" id="text-35-61">

</div>

</div>

<div id="outline-container-35-62" class="outline-3">
<h3 id="sec-35-62">Hadoop interview QA <a href="http://www.pappupass.com/class/index.php/hadoop/hadoop-interview-questions">http://www.pappupass.com/class/index.php/hadoop/hadoop-interview-questions</a></h3>
<div class="outline-text-3" id="text-35-62">

</div>

</div>

<div id="outline-container-35-63" class="outline-3">
<h3 id="sec-35-63">Hadoop mapReduce in python <a href="http://www.michael-noll.com/tutorials/writing-an-hadoop-mapreduce-program-in-python/index.html">http://www.michael-noll.com/tutorials/writing-an-hadoop-mapreduce-program-in-python/index.html</a></h3>
<div class="outline-text-3" id="text-35-63">

</div>

</div>

<div id="outline-container-35-64" class="outline-3">
<h3 id="sec-35-64">DB architecture <a href="http://nosql.mypopescu.com/post/48612962822/typical-big-data-architecture">http://nosql.mypopescu.com/post/48612962822/typical-big-data-architecture</a></h3>
<div class="outline-text-3" id="text-35-64">

</div>

</div>

<div id="outline-container-35-65" class="outline-3">
<h3 id="sec-35-65">Shark real-time <a href="http://telruptive.com/2012/08/15/hadoop-for-real-time-spark-shark-spark-streaming-bagel-etc-will-be-2012s-new-buzzwords/">http://telruptive.com/2012/08/15/hadoop-for-real-time-spark-shark-spark-streaming-bagel-etc-will-be-2012s-new-buzzwords/</a></h3>
<div class="outline-text-3" id="text-35-65">

</div>

</div>

<div id="outline-container-35-66" class="outline-3">
<h3 id="sec-35-66">Hadoop made simple with jydoop <a href="http://benjamin.smedbergs.us/blog/2013-04-09/introducing-jydoop-fast-and-sane-map-reduce/">http://benjamin.smedbergs.us/blog/2013-04-09/introducing-jydoop-fast-and-sane-map-reduce/</a></h3>
<div class="outline-text-3" id="text-35-66">

</div>

</div>

<div id="outline-container-35-67" class="outline-3">
<h3 id="sec-35-67">Parquet columnar storage <a href="http://blog.cloudera.com/blog/2013/03/introducing-parquet-columnar-storage-for-apache-hadoop/">http://blog.cloudera.com/blog/2013/03/introducing-parquet-columnar-storage-for-apache-hadoop/</a></h3>
<div class="outline-text-3" id="text-35-67">

</div>

</div>

<div id="outline-container-35-68" class="outline-3">
<h3 id="sec-35-68"><a href="http://blog.cloudera.com/blog/2013/03/cloudera_ml_data_science_tools/">http://blog.cloudera.com/blog/2013/03/cloudera_ml_data_science_tools/</a></h3>
<div class="outline-text-3" id="text-35-68">

</div>

</div>

<div id="outline-container-35-69" class="outline-3">
<h3 id="sec-35-69">Free Hadoop book: <a href="http://www.hadoopilluminated.com/">http://www.hadoopilluminated.com/</a></h3>
<div class="outline-text-3" id="text-35-69">

</div>

</div>

<div id="outline-container-35-70" class="outline-3">
<h3 id="sec-35-70">Saddle is a data manipulation library for Scala  <a href="http://saddle.github.com/doc/index.html">http://saddle.github.com/doc/index.html</a></h3>
<div class="outline-text-3" id="text-35-70">

</div>

</div>

<div id="outline-container-35-71" class="outline-3">
<h3 id="sec-35-71">nathan Marz views on data systems <a href="http://www.odbms.org/blog/2013/04/on-innovation-interview-with-nathan-marz/">http://www.odbms.org/blog/2013/04/on-innovation-interview-with-nathan-marz/</a></h3>
<div class="outline-text-3" id="text-35-71">


</div>
</div>

</div>

<div id="outline-container-36" class="outline-2">
<h2 id="sec-36">Data Science</h2>
<div class="outline-text-2" id="text-36">


</div>

<div id="outline-container-36-1" class="outline-3">
<h3 id="sec-36-1">Text Feature Extraction (td-idf) part-2 by Christian S. Perone <a href="http://pyevolve.sourceforge.net/wordpress/?p=1747">http://pyevolve.sourceforge.net/wordpress/?p=1747</a></h3>
<div class="outline-text-3" id="text-36-1">

</div>

</div>

<div id="outline-container-36-2" class="outline-3">
<h3 id="sec-36-2">Estimating User Lifetimes : pyMCMC by Cam Davidson-Pilon @cmrn<sub>dp</sub>  <a href="http://blog.yhathq.com/posts/estimating-user-lifetimes-with-pymc.html">http://blog.yhathq.com/posts/estimating-user-lifetimes-with-pymc.html</a></h3>
<div class="outline-text-3" id="text-36-2">

</div>

</div>

<div id="outline-container-36-3" class="outline-3">
<h3 id="sec-36-3">Towards Linked Statistical Data Analysis <a href="http://csarven.ca/linked-statistical-data-analysis">http://csarven.ca/linked-statistical-data-analysis</a></h3>
<div class="outline-text-3" id="text-36-3">

</div>

</div>

<div id="outline-container-36-4" class="outline-3">
<h3 id="sec-36-4">Can someone explain Kernel Trick intuitively? <a href="http://www.reddit.com/r/MachineLearning/comments/1joh9v/can_someone_explain_kernel_trick_intuitively/">http://www.reddit.com/r/MachineLearning/comments/1joh9v/can_someone_explain_kernel_trick_intuitively/</a></h3>
<div class="outline-text-3" id="text-36-4">

</div>

</div>

<div id="outline-container-36-5" class="outline-3">
<h3 id="sec-36-5">alternating direction method of multipliers is well suited to distributed convex optimization <a href="http://www.stanford.edu/~boyd/papers/admm_distr_stats.html">http://www.stanford.edu/~boyd/papers/admm_distr_stats.html</a></h3>
<div class="outline-text-3" id="text-36-5">

</div>

</div>

<div id="outline-container-36-6" class="outline-3">
<h3 id="sec-36-6">3 Big Data Tech Talks You Can’t Miss by Christos Faloutsos Deepak Agarwal Jay Kreps <a href="http://engineering.linkedin.com/event/video-3-big-data-tech-talks-you-can’t-miss">http://engineering.linkedin.com/event/video-3-big-data-tech-talks-you-can%E2%80%99t-miss</a></h3>
<div class="outline-text-3" id="text-36-6">

</div>

</div>

<div id="outline-container-36-7" class="outline-3">
<h3 id="sec-36-7">Block Coordinate Descent Algorithms for Large-scale Sparse Multiclass Classification by Mathieu Blondel <a href="http://www.mblondel.org/code/mlj2013/">http://www.mblondel.org/code/mlj2013/</a></h3>
<div class="outline-text-3" id="text-36-7">

</div>

</div>

<div id="outline-container-36-8" class="outline-3">
<h3 id="sec-36-8">Machine Learning in python : blog <a href="http://www.mblondel.org/">http://www.mblondel.org/</a></h3>
<div class="outline-text-3" id="text-36-8">

</div>

</div>

<div id="outline-container-36-9" class="outline-3">
<h3 id="sec-36-9">The World’s Top 7 Data Scientists before there was Data Science <a href="http://conductrics.com/the-worlds-7-top-data-scientists-before-there-was-datascience/">http://conductrics.com/the-worlds-7-top-data-scientists-before-there-was-datascience/</a></h3>
<div class="outline-text-3" id="text-36-9">

</div>

</div>

<div id="outline-container-36-10" class="outline-3">
<h3 id="sec-36-10">The Multi-Armed Bandit Problem with examples and visualization <a href="http://camdp.com/blogs/multi-armed-bandits">http://camdp.com/blogs/multi-armed-bandits</a></h3>
<div class="outline-text-3" id="text-36-10">

</div>

</div>

<div id="outline-container-36-11" class="outline-3">
<h3 id="sec-36-11">NLP</h3>
<div class="outline-text-3" id="text-36-11">


</div>

<div id="outline-container-36-11-1" class="outline-4">
<h4 id="sec-36-11-1">NAACL 2013 <a href="http://naacl2013.naacl.org/">http://naacl2013.naacl.org/</a> videos <a href="http://techtalks.tv/events/312/573/">http://techtalks.tv/events/312/573/</a></h4>
<div class="outline-text-4" id="text-36-11-1">

</div>

</div>

<div id="outline-container-36-11-2" class="outline-4">
<h4 id="sec-36-11-2">NLP for machine learning Starta 2013 <a href="http://strata.oreilly.com/2013/03/natural-language-annotation-for-machine-learning.html">http://strata.oreilly.com/2013/03/natural-language-annotation-for-machine-learning.html</a></h4>
<div class="outline-text-4" id="text-36-11-2">

</div>
</div>

</div>

<div id="outline-container-36-12" class="outline-3">
<h3 id="sec-36-12">Recommendation System</h3>
<div class="outline-text-3" id="text-36-12">


</div>

<div id="outline-container-36-12-1" class="outline-4">
<h4 id="sec-36-12-1">myrrix succesor of mahout ? <a href="http://myrrix.com/quick-start/">http://myrrix.com/quick-start/</a></h4>
<div class="outline-text-4" id="text-36-12-1">

<p>java -Dmodel.features=100 -Dmodel.als.lambda=2 -Xmx512m -jar myrrix-serving-1.0.1.jar &ndash;port 8080
</p></div>

</div>

<div id="outline-container-36-12-2" class="outline-4">
<h4 id="sec-36-12-2">How Hacker News ranking algorithm works in Paul raham lisp <a href="http://amix.dk/blog/post/19574">http://amix.dk/blog/post/19574</a></h4>
<div class="outline-text-4" id="text-36-12-2">

</div>

</div>

<div id="outline-container-36-12-3" class="outline-4">
<h4 id="sec-36-12-3">Deconstructing Recommender Systems : Amazon and Netflix use cases <a href="http://spectrum.ieee.org/computing/software/deconstructing-recommender-systems">http://spectrum.ieee.org/computing/software/deconstructing-recommender-systems</a></h4>
<div class="outline-text-4" id="text-36-12-3">

</div>

</div>

<div id="outline-container-36-12-4" class="outline-4">
<h4 id="sec-36-12-4">LensKit is an open source toolkit . <a href="http://lenskit.grouplens.org/">http://lenskit.grouplens.org/</a> <a href="https://bitbucket.org/grouplens/lenskit/wiki/Home">https://bitbucket.org/grouplens/lenskit/wiki/Home</a></h4>
<div class="outline-text-4" id="text-36-12-4">

</div>
</div>

</div>

<div id="outline-container-36-13" class="outline-3">
<h3 id="sec-36-13">Deep Learning</h3>
<div class="outline-text-3" id="text-36-13">


</div>

<div id="outline-container-36-13-1" class="outline-4">
<h4 id="sec-36-13-1">Rocher Socher tutorial on Deep Learning <a href="http://www.socher.org/index.php/DeepLearningTutorial/DeepLearningTutorial">http://www.socher.org/index.php/DeepLearningTutorial/DeepLearningTutorial</a></h4>
<div class="outline-text-4" id="text-36-13-1">

</div>

</div>

<div id="outline-container-36-13-2" class="outline-4">
<h4 id="sec-36-13-2">Deep Learning Comes of Age by Gary Anthes <a href="http://cacm.acm.org/magazines/2013/6/164601-deep-learning-comes-of-age/fulltext">http://cacm.acm.org/magazines/2013/6/164601-deep-learning-comes-of-age/fulltext</a></h4>
<div class="outline-text-4" id="text-36-13-2">

</div>

</div>
