toread.org
*** Recent Developments in Deep Learning http://www.youtube.com/watch?v=VdIURAu1-aU
*** Deep Neural Networks for Speech and Image Processing http://www.youtube.com/watch?v=DYu9D1M5rII
*** Deep Learning tutorial http://deeplearning.net/tutorial/
*** Google deep learning http://www.youtube.com/watch?v=JBtfRiGEAFI
** Graph / Network
*** Apache Giraph : scalable iterative graph processing system  open-source counterpart to Pregel  http://giraph.apache.org/
** distance metric
*** Sorensen http://en.wikipedia.org/wiki/S%C3%B8rensen_similarity_index 
*** string metric : Levenshtein  http://en.wikipedia.org/wiki/Damerau%E2%80%93Levenshtein_distance   
Hamming http://en.wikipedia.org/wiki/Hamming_distance
*** Jacard Tanimoto http://en.wikipedia.org/wiki/Jaccard_index
*** Pearson / correlation  http://en.wikipedia.org/wiki/Correlation
** Probabilistic Data Structures for Web Analytics and Data Mining http://highlyscalable.wordpress.com/2012/05/01/probabilistic-structures-web-analytics-data-mining/
loglog counting , 
Frequency Estimation: Count-Min Sketch, 
Heavy Hitters: Stream-Summary
Range Query: Array of Count-Min Sketches
Membership Query: Bloom Filter
** causality : causal calculus http://www.michaelnielsen.org/ddi/if-correlation-doesnt-imply-causation-then-what-does/ 
 http://en.wikipedia.org/wiki/Randomized_controlled_trial http://www.amazon.com/Causality-Reasoning-Inference-Judea-Pearl/dp/0521773628
** Why every statistician should know about cross-validation http://robjhyndman.com/hyndsight/crossvalidation/
** Distance Metric Learning  https://sites.google.com/site/yiqunhu/Home/distance-metric-learning http://www.cs.cmu.edu/~liuy/distlearn.htm
http://en.wikipedia.org/wiki/Large_Margin_Nearest_Neighbor http://en.wikipedia.org/wiki/Neighbourhood_components_analysis
** Machine learning at lambdajam https://github.com/strangeloop/lambdajam2013/tree/master/jams/learning https://twitter.com/search?q=%23lambdajam&src=hash
kNN classifier to recognize digits
** http://en.wikipedia.org/wiki/Discriminative_model vs http://en.wikipedia.org/wiki/Generative_model
** Best way to analyze data  http://simplystatistics.org/2013/06/27/what-is-the-best-way-to-analyze-data/ 
http://simplystatistics.org/2012/08/27/a-deterministic-statistical-machine/
** Truthy is a research project that helps you understand how communication spreads on Twitter http://truthy.indiana.edu/
** AI web-site about agent, neural network, genetic algo http://ai-junkie.com/
** extensive list of SVM tutorials http://svms.org/tutorials/
** clustering with Neural Networks : Kohonen's Self Organizing Feature Maps http://ai-junkie.com/ann/som/som1.html
** machine learning classifier gallery http://home.comcast.net/~tom.fawcett/public_html/ML-gallery/pages/
** Andrew Ng - Machine Learning via Large-scale Brain Simulations http://www.youtube.com/watch?v=5elcmFNRCWk
** masters of machine learning "The Large Scale Learning class"  http://cilvr.cs.nyu.edu/doku.php?id=courses:bigdata:slides:start
introduction: nline linear learning:
Lecture 2
2nd order methods and analysis of convergence:
Demos in Torch BFGS and Limited Storage BFGS:
Lecture 3
Online learning for non-linear/non-convex models:
Boosted decision trees (guest lecture by Tong Zhang)
Example code in R
Lecture 4 Hadoop All-Reduce;
Lecture 5
Torch tutorial; torch basics; machine learning tutorial; video
CUDA tutorial (by Matthew Zeiler); PDF part 1; PDF part 2; video;
video for Torch 7 CUDA demo
Lecture 6 Feature learning, representation learning;
Lecture 7 Feature learning, deep learning;

Lecture 8
Inverted Indicies and predictive indexing, hashing
Project ideas description video
John Langford's projects
Xiang Zhang's projects
Yann LeCun's projects
Lecture 9 The ad problem, advertising placement and such (guest lecturer: Leon
Bottou, Microsoft Research)
Lecture 10 Classic and advanced bandits (John Langford)
Lecture 11
Counterfactual reasoning (Leon Bottou)
Advanced topics (John Langford)
Lecture 12 Active Learning, Indexing (John Langford)
Slides: PDF
Video
Lecture 13 Deep Learning in Text and Speech Recognition
Lecture 14 : Many Classes, Logarithmic-Time Prediction
** Videos of Machine Learning Summit 2013 http://research.microsoft.com/en-us/um/cambridge/events/mls2013/virtual-streaming/virtualmachinelearningsummit.aspx
** Analyze Text Similarity with R: Latent Semantic Analysis and Multidimentional Scaling http://bodongchen.com/blog/?p=301
** Latent Dirichlet Allocation in python http://www.mblondel.org/journal/2010/08/21/latent-dirichlet-allocation-in-python/
** Project: Supervised Classification for Sentiment Analysis http://www.umiacs.umd.edu/~resnik/ling773_sp2009/project/sentiment_project.html
