toread.html

<div id="outline-container-36-13-3" class="outline-4">
<h4 id="sec-36-13-3">Recent Developments in Deep Learning <a href="http://www.youtube.com/watch?v=VdIURAu1-aU">http://www.youtube.com/watch?v=VdIURAu1-aU</a></h4>
<div class="outline-text-4" id="text-36-13-3">

</div>

</div>

<div id="outline-container-36-13-4" class="outline-4">
<h4 id="sec-36-13-4">Deep Neural Networks for Speech and Image Processing <a href="http://www.youtube.com/watch?v=DYu9D1M5rII">http://www.youtube.com/watch?v=DYu9D1M5rII</a></h4>
<div class="outline-text-4" id="text-36-13-4">

</div>

</div>

<div id="outline-container-36-13-5" class="outline-4">
<h4 id="sec-36-13-5">Deep Learning tutorial <a href="http://deeplearning.net/tutorial/">http://deeplearning.net/tutorial/</a></h4>
<div class="outline-text-4" id="text-36-13-5">

</div>

</div>

<div id="outline-container-36-13-6" class="outline-4">
<h4 id="sec-36-13-6">Google deep learning <a href="http://www.youtube.com/watch?v=JBtfRiGEAFI">http://www.youtube.com/watch?v=JBtfRiGEAFI</a></h4>
<div class="outline-text-4" id="text-36-13-6">

</div>
</div>

</div>

<div id="outline-container-36-14" class="outline-3">
<h3 id="sec-36-14">Graph / Network</h3>
<div class="outline-text-3" id="text-36-14">


</div>

<div id="outline-container-36-14-1" class="outline-4">
<h4 id="sec-36-14-1">Apache Giraph : scalable iterative graph processing system  open-source counterpart to Pregel  <a href="http://giraph.apache.org/">http://giraph.apache.org/</a></h4>
<div class="outline-text-4" id="text-36-14-1">

</div>
</div>

</div>

<div id="outline-container-36-15" class="outline-3">
<h3 id="sec-36-15">distance metric</h3>
<div class="outline-text-3" id="text-36-15">


</div>

<div id="outline-container-36-15-1" class="outline-4">
<h4 id="sec-36-15-1">Sorensen <a href="http://en.wikipedia.org/wiki/Sørensen_similarity_index">http://en.wikipedia.org/wiki/S%C3%B8rensen_similarity_index</a></h4>
<div class="outline-text-4" id="text-36-15-1">

</div>

</div>

<div id="outline-container-36-15-2" class="outline-4">
<h4 id="sec-36-15-2">string metric : Levenshtein  <a href="http://en.wikipedia.org/wiki/Damerau–Levenshtein_distance">http://en.wikipedia.org/wiki/Damerau%E2%80%93Levenshtein_distance</a></h4>
<div class="outline-text-4" id="text-36-15-2">

<p>Hamming <a href="http://en.wikipedia.org/wiki/Hamming_distance">http://en.wikipedia.org/wiki/Hamming_distance</a>
</p></div>

</div>

<div id="outline-container-36-15-3" class="outline-4">
<h4 id="sec-36-15-3">Jacard Tanimoto <a href="http://en.wikipedia.org/wiki/Jaccard_index">http://en.wikipedia.org/wiki/Jaccard_index</a></h4>
<div class="outline-text-4" id="text-36-15-3">

</div>

</div>

<div id="outline-container-36-15-4" class="outline-4">
<h4 id="sec-36-15-4">Pearson / correlation  <a href="http://en.wikipedia.org/wiki/Correlation">http://en.wikipedia.org/wiki/Correlation</a></h4>
<div class="outline-text-4" id="text-36-15-4">

</div>
</div>

</div>

<div id="outline-container-36-16" class="outline-3">
<h3 id="sec-36-16">Probabilistic Data Structures for Web Analytics and Data Mining <a href="http://highlyscalable.wordpress.com/2012/05/01/probabilistic-structures-web-analytics-data-mining/">http://highlyscalable.wordpress.com/2012/05/01/probabilistic-structures-web-analytics-data-mining/</a></h3>
<div class="outline-text-3" id="text-36-16">

<p>loglog counting , 
Frequency Estimation: Count-Min Sketch, 
Heavy Hitters: Stream-Summary
Range Query: Array of Count-Min Sketches
Membership Query: Bloom Filter
</p></div>

</div>

<div id="outline-container-36-17" class="outline-3">
<h3 id="sec-36-17">causality : causal calculus <a href="http://www.michaelnielsen.org/ddi/if-correlation-doesnt-imply-causation-then-what-does/">http://www.michaelnielsen.org/ddi/if-correlation-doesnt-imply-causation-then-what-does/</a></h3>
<div class="outline-text-3" id="text-36-17">

<p> <a href="http://en.wikipedia.org/wiki/Randomized_controlled_trial">http://en.wikipedia.org/wiki/Randomized_controlled_trial</a> <a href="http://www.amazon.com/Causality-Reasoning-Inference-Judea-Pearl/dp/0521773628">http://www.amazon.com/Causality-Reasoning-Inference-Judea-Pearl/dp/0521773628</a>
</p></div>

</div>

<div id="outline-container-36-18" class="outline-3">
<h3 id="sec-36-18">Why every statistician should know about cross-validation <a href="http://robjhyndman.com/hyndsight/crossvalidation/">http://robjhyndman.com/hyndsight/crossvalidation/</a></h3>
<div class="outline-text-3" id="text-36-18">

</div>

</div>

<div id="outline-container-36-19" class="outline-3">
<h3 id="sec-36-19">Distance Metric Learning  <a href="https://sites.google.com/site/yiqunhu/Home/distance-metric-learning">https://sites.google.com/site/yiqunhu/Home/distance-metric-learning</a> <a href="http://www.cs.cmu.edu/~liuy/distlearn.htm">http://www.cs.cmu.edu/~liuy/distlearn.htm</a></h3>
<div class="outline-text-3" id="text-36-19">

<p><a href="http://en.wikipedia.org/wiki/Large_Margin_Nearest_Neighbor">http://en.wikipedia.org/wiki/Large_Margin_Nearest_Neighbor</a> <a href="http://en.wikipedia.org/wiki/Neighbourhood_components_analysis">http://en.wikipedia.org/wiki/Neighbourhood_components_analysis</a>
</p></div>

</div>

<div id="outline-container-36-20" class="outline-3">
<h3 id="sec-36-20">Machine learning at lambdajam <a href="https://github.com/strangeloop/lambdajam2013/tree/master/jams/learning">https://github.com/strangeloop/lambdajam2013/tree/master/jams/learning</a> <a href="https://twitter.com/search?q=#lambdajam&amp;src=hash">https://twitter.com/search?q=%23lambdajam&amp;src=hash</a></h3>
<div class="outline-text-3" id="text-36-20">

<p>kNN classifier to recognize digits
</p></div>

</div>

<div id="outline-container-36-21" class="outline-3">
<h3 id="sec-36-21"><a href="http://en.wikipedia.org/wiki/Discriminative_model">http://en.wikipedia.org/wiki/Discriminative_model</a> vs <a href="http://en.wikipedia.org/wiki/Generative_model">http://en.wikipedia.org/wiki/Generative_model</a></h3>
<div class="outline-text-3" id="text-36-21">

</div>

</div>

<div id="outline-container-36-22" class="outline-3">
<h3 id="sec-36-22">Best way to analyze data  <a href="http://simplystatistics.org/2013/06/27/what-is-the-best-way-to-analyze-data/">http://simplystatistics.org/2013/06/27/what-is-the-best-way-to-analyze-data/</a></h3>
<div class="outline-text-3" id="text-36-22">

<p><a href="http://simplystatistics.org/2012/08/27/a-deterministic-statistical-machine/">http://simplystatistics.org/2012/08/27/a-deterministic-statistical-machine/</a>
</p></div>

</div>

<div id="outline-container-36-23" class="outline-3">
<h3 id="sec-36-23">Truthy is a research project that helps you understand how communication spreads on Twitter <a href="http://truthy.indiana.edu/">http://truthy.indiana.edu/</a></h3>
<div class="outline-text-3" id="text-36-23">

</div>

</div>

<div id="outline-container-36-24" class="outline-3">
<h3 id="sec-36-24">AI web-site about agent, neural network, genetic algo <a href="http://ai-junkie.com/">http://ai-junkie.com/</a></h3>
<div class="outline-text-3" id="text-36-24">

</div>

</div>

<div id="outline-container-36-25" class="outline-3">
<h3 id="sec-36-25">extensive list of SVM tutorials <a href="http://svms.org/tutorials/">http://svms.org/tutorials/</a></h3>
<div class="outline-text-3" id="text-36-25">

</div>

</div>

<div id="outline-container-36-26" class="outline-3">
<h3 id="sec-36-26">clustering with Neural Networks : Kohonen's Self Organizing Feature Maps <a href="http://ai-junkie.com/ann/som/som1.html">http://ai-junkie.com/ann/som/som1.html</a></h3>
<div class="outline-text-3" id="text-36-26">

</div>

</div>

<div id="outline-container-36-27" class="outline-3">
<h3 id="sec-36-27">machine learning classifier gallery <a href="http://home.comcast.net/~tom.fawcett/public_html/ML-gallery/pages/">http://home.comcast.net/~tom.fawcett/public_html/ML-gallery/pages/</a></h3>
<div class="outline-text-3" id="text-36-27">

</div>

</div>

<div id="outline-container-36-28" class="outline-3">
<h3 id="sec-36-28">Andrew Ng - Machine Learning via Large-scale Brain Simulations <a href="http://www.youtube.com/watch?v=5elcmFNRCWk">http://www.youtube.com/watch?v=5elcmFNRCWk</a></h3>
<div class="outline-text-3" id="text-36-28">

</div>

</div>

<div id="outline-container-36-29" class="outline-3">
<h3 id="sec-36-29">masters of machine learning "The Large Scale Learning class"  <a href="http://cilvr.cs.nyu.edu/doku.php?id=courses:bigdata:slides:start">http://cilvr.cs.nyu.edu/doku.php?id=courses:bigdata:slides:start</a></h3>
<div class="outline-text-3" id="text-36-29">

<p>introduction: nline linear learning:
Lecture 2
2nd order methods and analysis of convergence:
Demos in Torch BFGS and Limited Storage BFGS:
Lecture 3
Online learning for non-linear/non-convex models:
Boosted decision trees (guest lecture by Tong Zhang)
Example code in R
Lecture 4 Hadoop All-Reduce;
Lecture 5
Torch tutorial; torch basics; machine learning tutorial; video
CUDA tutorial (by Matthew Zeiler); PDF part 1; PDF part 2; video;
video for Torch 7 CUDA demo
Lecture 6 Feature learning, representation learning;
Lecture 7 Feature learning, deep learning;
</p>
<p>
Lecture 8
Inverted Indicies and predictive indexing, hashing
Project ideas description video
John Langford's projects
Xiang Zhang's projects
Yann LeCun's projects
Lecture 9 The ad problem, advertising placement and such (guest lecturer: Leon
Bottou, Microsoft Research)
Lecture 10 Classic and advanced bandits (John Langford)
Lecture 11
Counterfactual reasoning (Leon Bottou)
Advanced topics (John Langford)
Lecture 12 Active Learning, Indexing (John Langford)
Slides: PDF
Video
Lecture 13 Deep Learning in Text and Speech Recognition
Lecture 14 : Many Classes, Logarithmic-Time Prediction
</p></div>

</div>

<div id="outline-container-36-30" class="outline-3">
<h3 id="sec-36-30">Videos of Machine Learning Summit 2013 <a href="http://research.microsoft.com/en-us/um/cambridge/events/mls2013/virtual-streaming/virtualmachinelearningsummit.aspx">http://research.microsoft.com/en-us/um/cambridge/events/mls2013/virtual-streaming/virtualmachinelearningsummit.aspx</a></h3>
<div class="outline-text-3" id="text-36-30">

</div>

</div>

<div id="outline-container-36-31" class="outline-3">
<h3 id="sec-36-31">Analyze Text Similarity with R: Latent Semantic Analysis and Multidimentional Scaling <a href="http://bodongchen.com/blog/?p=301">http://bodongchen.com/blog/?p=301</a></h3>
<div class="outline-text-3" id="text-36-31">

</div>

</div>

<div id="outline-container-36-32" class="outline-3">
<h3 id="sec-36-32">Latent Dirichlet Allocation in python <a href="http://www.mblondel.org/journal/2010/08/21/latent-dirichlet-allocation-in-python/">http://www.mblondel.org/journal/2010/08/21/latent-dirichlet-allocation-in-python/</a></h3>
<div class="outline-text-3" id="text-36-32">

</div>

</div>

<div id="outline-container-36-33" class="outline-3">
<h3 id="sec-36-33">Project: Supervised Classification for Sentiment Analysis <a href="http://www.umiacs.umd.edu/~resnik/ling773_sp2009/project/sentiment_project.html">http://www.umiacs.umd.edu/~resnik/ling773_sp2009/project/sentiment_project.html</a></h3>
<div class="outline-text-3" id="text-36-33">

</div>

</div>
