toread.org
** Random Forrest in Python http://blog.yhathq.com/posts/random-forests-in-python.html
** Web Analytics http://www.analytics20.org/ http://www.kaushik.net/avinash/web-analytics-2-0-avinash-kaushik/
faces http://www.facegroup.com/casestudies/o2-real-time-o2
** Le Macroscope by Joal Rosnay http://fr.wikipedia.org/wiki/Le_Macroscope
** 1-click Random Decision Forests http://blog.bigml.com/2013/04/29/1-click-random-decision-forests
** Real time analytics by Dan McKinley http://mcfunley.com/whom-the-gods-would-destroy-they-first-give-real-time-analytics
** Statistical graphics http://vis.supstat.com/ http://vis.supstat.com/2013/04/bean-machine
** What are the Top 10 Problems in Machine Learning for 2013? http://www.quora.com/Machine-Learning/What-are-the-Top-10-Problems-in-Machine-Learning-for-2013
Churn Prediction , Sentiment Analysis, Truth Veracity ,Recommendations,  online Ads, News Aggregations, Scalability , Content Discovery/Search
Inteligent learning , medicine
** A Very Short History Of Data Science http://www.forbes.com/sites/gilpress/2013/05/28/a-very-short-history-of-data-science/
** Classifying Websites with Neural Networks http://blog.datafiniti.net/?p=34
** Numerical optimizers for Logistic Regression in python : Trust Region better than BFGS http://fa.bianp.net/blog/2013/numerical-optimizers-for-logistic-regression/

** Great introduction of macho
** CART explained with R as laternatives to logistic regression http://statistical-research.com/a-brief-tour-of-the-trees-and-forests/
** Free resources http://ift6266h13.wordpress.com/home/resources/
** Free Data Science books http://www.p-value.info/2012/11/free-datascience-books.html
** Hacker News data analysis http://mayank.lahiri.me/writing/hackernews/index.html
** real experiment using conditional probabilities http://nerds.airbnb.com/location-relevance/
** kNN in racket http://spin.atomicobject.com/2013/05/06/k-nearest-neighbor-racket/#.UYnAIGaYoCs.twitter
** Concordance and Discordance in Logistic Regression http://statour.blogspot.ch/2012/12/concordance-and-discordance-in-logistic.html
** Machine learning in-depth tutorial based on scikit-learn http://scikit-learn.org/dev/user_guide.html
** Matrix decomposition  http://scikit-learn.org/dev/modules/decomposition.html https://sites.google.com/site/igorcarron2/matrixfactorizations
** Naives Bayes for sentiment analysis http://phpir.com/bayesian-opinion-mining
** Support Vector Machine in PHP http://phpir.com/support-vector-machines-in-php
** Deep Unsupervised learning with sparse filtering applied to Kaggle : Black Box http://fastml.com/deep-learning-made-easy/
 https://github.com/jngiam/sparseFiltering
** Job salary prediction at Kaggle resolved with logistic regression http://fastml.com/regression-as-classification/
** Best Open Source Data Mining Software : Weka Orange RapidMiner Knime JHepWork http://www.junauza.com/2010/11/free-data-mining-software.html
** ML counter-examples http://camdp.com/blogs/machine-learning-counterexamples-pt2-post-pca-regr
** From chaos to clusters - statistical modeling without model http://www.analyticbridge.com/profiles/blogs/from-chaos-to-clusters-statistical-modeling-without-models
** Alex Smola slides http://alex.smola.org/slides.html
** Data Mining: Practical Machine Learning Tools and Techniques by Hall Witten Frank http://www.cs.waikato.ac.nz/ml/weka/book.html
** Data science blog @Cmrn_DP http://camdp.com/blogs/
** Neuro Science @coursera  https://coursera.org/compneuro based on :
Theoretical Neuroscience: Computational and Mathematical Modeling of Neural Systems by Peter Dayan and Larry Abbott  http://www.gatsby.ucl.ac.uk/~dayan/book/
** Network science journal http://journals.cambridge.org/action/displayJournal?jid=NWS
** Temporal Networks by Petler Holme http://arxiv.org/abs/1108.1780
** netsci conference : http://tdn2013.wix.com/tdn2013
** socio patterns : http://www.sociopatterns.org/2013/06/sociopatterns-at-netsci/
** Online Learning withStream Mining http://de.scribd.com/doc/137991394/Online-Learning-with-Stream-Mining
