toread.html

<div id="outline-container-36-34" class="outline-3">
<h3 id="sec-36-34">Random Forrest in Python <a href="http://blog.yhathq.com/posts/random-forests-in-python.html">http://blog.yhathq.com/posts/random-forests-in-python.html</a></h3>
<div class="outline-text-3" id="text-36-34">

</div>

</div>

<div id="outline-container-36-35" class="outline-3">
<h3 id="sec-36-35">Web Analytics <a href="http://www.analytics20.org/">http://www.analytics20.org/</a> <a href="http://www.kaushik.net/avinash/web-analytics-2-0-avinash-kaushik/">http://www.kaushik.net/avinash/web-analytics-2-0-avinash-kaushik/</a></h3>
<div class="outline-text-3" id="text-36-35">

<p>faces <a href="http://www.facegroup.com/casestudies/o2-real-time-o2">http://www.facegroup.com/casestudies/o2-real-time-o2</a>
</p></div>

</div>

<div id="outline-container-36-36" class="outline-3">
<h3 id="sec-36-36">Le Macroscope by Joal Rosnay <a href="http://fr.wikipedia.org/wiki/Le_Macroscope">http://fr.wikipedia.org/wiki/Le_Macroscope</a></h3>
<div class="outline-text-3" id="text-36-36">

</div>

</div>

<div id="outline-container-36-37" class="outline-3">
<h3 id="sec-36-37">1-click Random Decision Forests <a href="http://blog.bigml.com/2013/04/29/1-click-random-decision-forests">http://blog.bigml.com/2013/04/29/1-click-random-decision-forests</a></h3>
<div class="outline-text-3" id="text-36-37">

</div>

</div>

<div id="outline-container-36-38" class="outline-3">
<h3 id="sec-36-38">Real time analytics by Dan McKinley <a href="http://mcfunley.com/whom-the-gods-would-destroy-they-first-give-real-time-analytics">http://mcfunley.com/whom-the-gods-would-destroy-they-first-give-real-time-analytics</a></h3>
<div class="outline-text-3" id="text-36-38">

</div>

</div>

<div id="outline-container-36-39" class="outline-3">
<h3 id="sec-36-39">Statistical graphics <a href="http://vis.supstat.com/">http://vis.supstat.com/</a> <a href="http://vis.supstat.com/2013/04/bean-machine">http://vis.supstat.com/2013/04/bean-machine</a></h3>
<div class="outline-text-3" id="text-36-39">

</div>

</div>

<div id="outline-container-36-40" class="outline-3">
<h3 id="sec-36-40">What are the Top 10 Problems in Machine Learning for 2013? <a href="http://www.quora.com/Machine-Learning/What-are-the-Top-10-Problems-in-Machine-Learning-for-2013">http://www.quora.com/Machine-Learning/What-are-the-Top-10-Problems-in-Machine-Learning-for-2013</a></h3>
<div class="outline-text-3" id="text-36-40">

<p>Churn Prediction , Sentiment Analysis, Truth Veracity ,Recommendations,  online Ads, News Aggregations, Scalability , Content Discovery/Search
Inteligent learning , medicine
</p></div>

</div>

<div id="outline-container-36-41" class="outline-3">
<h3 id="sec-36-41">A Very Short History Of Data Science <a href="http://www.forbes.com/sites/gilpress/2013/05/28/a-very-short-history-of-data-science/">http://www.forbes.com/sites/gilpress/2013/05/28/a-very-short-history-of-data-science/</a></h3>
<div class="outline-text-3" id="text-36-41">

</div>

</div>

<div id="outline-container-36-42" class="outline-3">
<h3 id="sec-36-42">Classifying Websites with Neural Networks <a href="http://blog.datafiniti.net/?p=34">http://blog.datafiniti.net/?p=34</a></h3>
<div class="outline-text-3" id="text-36-42">

</div>

</div>

<div id="outline-container-36-43" class="outline-3">
<h3 id="sec-36-43">Numerical optimizers for Logistic Regression in python : Trust Region better than BFGS <a href="http://fa.bianp.net/blog/2013/numerical-optimizers-for-logistic-regression/">http://fa.bianp.net/blog/2013/numerical-optimizers-for-logistic-regression/</a></h3>
<div class="outline-text-3" id="text-36-43">


</div>

</div>

<div id="outline-container-36-44" class="outline-3">
<h3 id="sec-36-44">Great introduction of macho</h3>
<div class="outline-text-3" id="text-36-44">

</div>

</div>

<div id="outline-container-36-45" class="outline-3">
<h3 id="sec-36-45">CART explained with R as laternatives to logistic regression <a href="http://statistical-research.com/a-brief-tour-of-the-trees-and-forests/">http://statistical-research.com/a-brief-tour-of-the-trees-and-forests/</a></h3>
<div class="outline-text-3" id="text-36-45">

</div>

</div>

<div id="outline-container-36-46" class="outline-3">
<h3 id="sec-36-46">Free resources <a href="http://ift6266h13.wordpress.com/home/resources/">http://ift6266h13.wordpress.com/home/resources/</a></h3>
<div class="outline-text-3" id="text-36-46">

</div>

</div>

<div id="outline-container-36-47" class="outline-3">
<h3 id="sec-36-47">Free Data Science books <a href="http://www.p-value.info/2012/11/free-datascience-books.html">http://www.p-value.info/2012/11/free-datascience-books.html</a></h3>
<div class="outline-text-3" id="text-36-47">

</div>

</div>

<div id="outline-container-36-48" class="outline-3">
<h3 id="sec-36-48">Hacker News data analysis <a href="http://mayank.lahiri.me/writing/hackernews/index.html">http://mayank.lahiri.me/writing/hackernews/index.html</a></h3>
<div class="outline-text-3" id="text-36-48">

</div>

</div>

<div id="outline-container-36-49" class="outline-3">
<h3 id="sec-36-49">real experiment using conditional probabilities <a href="http://nerds.airbnb.com/location-relevance/">http://nerds.airbnb.com/location-relevance/</a></h3>
<div class="outline-text-3" id="text-36-49">

</div>

</div>

<div id="outline-container-36-50" class="outline-3">
<h3 id="sec-36-50">kNN in racket <a href="http://spin.atomicobject.com/2013/05/06/k-nearest-neighbor-racket/#.UYnAIGaYoCs.twitter">http://spin.atomicobject.com/2013/05/06/k-nearest-neighbor-racket/#.UYnAIGaYoCs.twitter</a></h3>
<div class="outline-text-3" id="text-36-50">

</div>

</div>

<div id="outline-container-36-51" class="outline-3">
<h3 id="sec-36-51">Concordance and Discordance in Logistic Regression <a href="http://statour.blogspot.ch/2012/12/concordance-and-discordance-in-logistic.html">http://statour.blogspot.ch/2012/12/concordance-and-discordance-in-logistic.html</a></h3>
<div class="outline-text-3" id="text-36-51">

</div>

</div>

<div id="outline-container-36-52" class="outline-3">
<h3 id="sec-36-52">Machine learning in-depth tutorial based on scikit-learn <a href="http://scikit-learn.org/dev/user_guide.html">http://scikit-learn.org/dev/user_guide.html</a></h3>
<div class="outline-text-3" id="text-36-52">

</div>

</div>

<div id="outline-container-36-53" class="outline-3">
<h3 id="sec-36-53">Matrix decomposition  <a href="http://scikit-learn.org/dev/modules/decomposition.html">http://scikit-learn.org/dev/modules/decomposition.html</a> <a href="https://sites.google.com/site/igorcarron2/matrixfactorizations">https://sites.google.com/site/igorcarron2/matrixfactorizations</a></h3>
<div class="outline-text-3" id="text-36-53">

</div>

</div>

<div id="outline-container-36-54" class="outline-3">
<h3 id="sec-36-54">Naives Bayes for sentiment analysis <a href="http://phpir.com/bayesian-opinion-mining">http://phpir.com/bayesian-opinion-mining</a></h3>
<div class="outline-text-3" id="text-36-54">

</div>

</div>

<div id="outline-container-36-55" class="outline-3">
<h3 id="sec-36-55">Support Vector Machine in PHP <a href="http://phpir.com/support-vector-machines-in-php">http://phpir.com/support-vector-machines-in-php</a></h3>
<div class="outline-text-3" id="text-36-55">

</div>

</div>

<div id="outline-container-36-56" class="outline-3">
<h3 id="sec-36-56">Deep Unsupervised learning with sparse filtering applied to Kaggle : Black Box <a href="http://fastml.com/deep-learning-made-easy/">http://fastml.com/deep-learning-made-easy/</a></h3>
<div class="outline-text-3" id="text-36-56">

<p> <a href="https://github.com/jngiam/sparseFiltering">https://github.com/jngiam/sparseFiltering</a>
</p></div>

</div>

<div id="outline-container-36-57" class="outline-3">
<h3 id="sec-36-57">Job salary prediction at Kaggle resolved with logistic regression <a href="http://fastml.com/regression-as-classification/">http://fastml.com/regression-as-classification/</a></h3>
<div class="outline-text-3" id="text-36-57">

</div>

</div>

<div id="outline-container-36-58" class="outline-3">
<h3 id="sec-36-58">Best Open Source Data Mining Software : Weka Orange RapidMiner Knime JHepWork <a href="http://www.junauza.com/2010/11/free-data-mining-software.html">http://www.junauza.com/2010/11/free-data-mining-software.html</a></h3>
<div class="outline-text-3" id="text-36-58">

</div>

</div>

<div id="outline-container-36-59" class="outline-3">
<h3 id="sec-36-59">ML counter-examples <a href="http://camdp.com/blogs/machine-learning-counterexamples-pt2-post-pca-regr">http://camdp.com/blogs/machine-learning-counterexamples-pt2-post-pca-regr</a></h3>
<div class="outline-text-3" id="text-36-59">

</div>

</div>

<div id="outline-container-36-60" class="outline-3">
<h3 id="sec-36-60">From chaos to clusters - statistical modeling without model <a href="http://www.analyticbridge.com/profiles/blogs/from-chaos-to-clusters-statistical-modeling-without-models">http://www.analyticbridge.com/profiles/blogs/from-chaos-to-clusters-statistical-modeling-without-models</a></h3>
<div class="outline-text-3" id="text-36-60">

</div>

</div>

<div id="outline-container-36-61" class="outline-3">
<h3 id="sec-36-61">Alex Smola slides <a href="http://alex.smola.org/slides.html">http://alex.smola.org/slides.html</a></h3>
<div class="outline-text-3" id="text-36-61">

</div>

</div>

<div id="outline-container-36-62" class="outline-3">
<h3 id="sec-36-62">Data Mining: Practical Machine Learning Tools and Techniques by Hall Witten Frank <a href="http://www.cs.waikato.ac.nz/ml/weka/book.html">http://www.cs.waikato.ac.nz/ml/weka/book.html</a></h3>
<div class="outline-text-3" id="text-36-62">

</div>

</div>

<div id="outline-container-36-63" class="outline-3">
<h3 id="sec-36-63">Data science blog @Cmrn<sub>DP</sub> <a href="http://camdp.com/blogs/">http://camdp.com/blogs/</a></h3>
<div class="outline-text-3" id="text-36-63">

</div>

</div>

<div id="outline-container-36-64" class="outline-3">
<h3 id="sec-36-64">Neuro Science @coursera  <a href="https://coursera.org/compneuro">https://coursera.org/compneuro</a> based on :</h3>
<div class="outline-text-3" id="text-36-64">

<p>Theoretical Neuroscience: Computational and Mathematical Modeling of Neural Systems by Peter Dayan and Larry Abbott  <a href="http://www.gatsby.ucl.ac.uk/~dayan/book/">http://www.gatsby.ucl.ac.uk/~dayan/book/</a>
</p></div>

</div>

<div id="outline-container-36-65" class="outline-3">
<h3 id="sec-36-65">Network science journal <a href="http://journals.cambridge.org/action/displayJournal?jid=NWS">http://journals.cambridge.org/action/displayJournal?jid=NWS</a></h3>
<div class="outline-text-3" id="text-36-65">

</div>

</div>

<div id="outline-container-36-66" class="outline-3">
<h3 id="sec-36-66">Temporal Networks by Petler Holme <a href="http://arxiv.org/abs/1108.1780">http://arxiv.org/abs/1108.1780</a></h3>
<div class="outline-text-3" id="text-36-66">

</div>

</div>

<div id="outline-container-36-67" class="outline-3">
<h3 id="sec-36-67">netsci conference : <a href="http://tdn2013.wix.com/tdn2013">http://tdn2013.wix.com/tdn2013</a></h3>
<div class="outline-text-3" id="text-36-67">

</div>

</div>

<div id="outline-container-36-68" class="outline-3">
<h3 id="sec-36-68">socio patterns : <a href="http://www.sociopatterns.org/2013/06/sociopatterns-at-netsci/">http://www.sociopatterns.org/2013/06/sociopatterns-at-netsci/</a></h3>
<div class="outline-text-3" id="text-36-68">

</div>

</div>

<div id="outline-container-36-69" class="outline-3">
<h3 id="sec-36-69">Online Learning withStream Mining <a href="http://de.scribd.com/doc/137991394/Online-Learning-with-Stream-Mining">http://de.scribd.com/doc/137991394/Online-Learning-with-Stream-Mining</a></h3>
<div class="outline-text-3" id="text-36-69">

</div>

</div>
