toread.org
** Scalable Machine Learning by Alex Smola http://alex.smola.org/teaching/berkeley2012/index.html
** Free book : Bayesian Computation with R (Use R) http://www.amazon.com/Bayesian-Computation-Use-ebook/dp/B001E5C56W/ref=tmm_kin_title_popover
** Data Analysis cousera class by Jeff Leek  on youtube http://blog.revolutionanalytics.com/2013/04/coursera-data-analysis-course-videos.html
** gradient descent blog from Daniel Duckworth http://stronglyconvex.com/blog.html
** Yurii Nesterov established the Accelerated Gradient Method http://stronglyconvex.com/blog/accelerated-gradient-descent.html
** Andrew Ng course + assignments http://see.stanford.edu/see/lecturelist.aspx?coll=348ca38a-3a6d-4052-937d-cb017338d7b1
 http://openclassroom.stanford.edu/MainFolder/CoursePage.php?course=MachineLearning
https://class.coursera.org/ml/lecture/preview
** Microsoft Focus in France on Machine Learning http://research.microsoft.com/en-us/news/features/mlsqa-042213.aspx
** causality http://www.causality.inf.ethz.ch/cause-effect.php?page=help
** reservoir sampling http://blog.cloudera.com/blog/2013/04/hadoop-stratified-randosampling-algorithm/
** regression videos http://www.salford-systems.com/videos/tutorials/805-the-evolution-of-regression-modeling-part-1
** berkeley intro data science course : material http://datascienc.es/schedule/
** Abusing hash kernels for wildly unprincipled machine learning https://github.com/jeremydhoon/hashkernel
http://en.wikipedia.org/wiki/Deep_learning#Deep_Learning_in_Artificial_Neural_Networks
 http://jeremydhoon.github.io/2013/03/19/abusing-hash-kernels-for-wildly-unprincipled-machine-learning/
** 30 Most Influential Data Scientists on Twitter http://storify.com/Kalido/most-influential-data-scientists-on-twitter
** Conditional (Partitioned) Probability — A Primer http://jeremykun.com/2013/03/28/conditional-partitioned-probability-a-primer/
** clustering algos http://architects.dzone.com/articles/machine-learning-algorithms
** de Bruijn Graphs for Genome Assembly http://www.homolog.us/Tutorials/index.php?p=1.1
** wise.io http://venturebeat.com/2013/03/19/data-science-nerds-bring-machine-learning-to-the-masses-exclusive/
** Regret Analysis of Stochastic and Nonstochastic Multi-armed Bandit Problems http://www.princeton.edu/~sbubeck/book.html
** Random topics on optimization, probability, and statistics. By Sébastien Bubeck https://blogs.princeton.edu/imabandit/
** Data Science for Social Good http://www.ci.uchicago.edu/datasciencefellowship/
** Slides: The Evolution of Regression [Part 1] from @salfordsystems http://1.salford-systems.com/blog/bid/273493/Video-The-Evolution-of-Regression-Part-1
** data mining book in python http://guidetodatamining.com/
** gensim : topic modelling for humans  http://radimrehurek.com/gensim/wiki.html#latent-dirichlet-allocation
** blog http://aicoder.blogspot.ch/ Neal Richter
** Understanding the Bias-Variance Tradeoff http://scott.fortmann-roe.com/docs/BiasVariance.html
** Accurately Measuring Model Prediction Error http://scott.fortmann-roe.com/docs/MeasuringError.html
** Top-down particle filtering for Bayesian decision trees http://arxiv.org/abs/1303.0561
** spam filtering http://paulgraham.com/spam.html
** graph best data structure http://hortonworks.com/blog/big-graph-data-on-hortonworks-data-platform/
** panorama and useful links http://conductrics.com/data-science-resources/
** MLE logical regression http://www.johnmyleswhite.com/notebook/2012/12/14/what-is-correctness-for-statistical-software/
** Paul Lam cascalog data scientist http://www.quantisan.com/  incanter  for the future
** cascading for impatient http://www.cascading.org/category/impatient/  https://github.com/Quantisan/Impatient/tree/cascalog/)
** last page of http://nosql.mypopescu.com/post/17941632965/lightning-talk-on-cascalog*** last page of http://nosql.mypopescu.com/post/17941632965/lightning-talk-on-cascalog
