toread.html

<div id="outline-container-36-70" class="outline-3">
<h3 id="sec-36-70">Scalable Machine Learning by Alex Smola <a href="http://alex.smola.org/teaching/berkeley2012/index.html">http://alex.smola.org/teaching/berkeley2012/index.html</a></h3>
<div class="outline-text-3" id="text-36-70">

</div>

</div>

<div id="outline-container-36-71" class="outline-3">
<h3 id="sec-36-71">Free book : Bayesian Computation with R (Use R) <a href="http://www.amazon.com/Bayesian-Computation-Use-ebook/dp/B001E5C56W/ref=tmm_kin_title_popover">http://www.amazon.com/Bayesian-Computation-Use-ebook/dp/B001E5C56W/ref=tmm_kin_title_popover</a></h3>
<div class="outline-text-3" id="text-36-71">

</div>

</div>

<div id="outline-container-36-72" class="outline-3">
<h3 id="sec-36-72">Data Analysis cousera class by Jeff Leek  on youtube <a href="http://blog.revolutionanalytics.com/2013/04/coursera-data-analysis-course-videos.html">http://blog.revolutionanalytics.com/2013/04/coursera-data-analysis-course-videos.html</a></h3>
<div class="outline-text-3" id="text-36-72">

</div>

</div>

<div id="outline-container-36-73" class="outline-3">
<h3 id="sec-36-73">gradient descent blog from Daniel Duckworth <a href="http://stronglyconvex.com/blog.html">http://stronglyconvex.com/blog.html</a></h3>
<div class="outline-text-3" id="text-36-73">

</div>

</div>

<div id="outline-container-36-74" class="outline-3">
<h3 id="sec-36-74">Yurii Nesterov established the Accelerated Gradient Method <a href="http://stronglyconvex.com/blog/accelerated-gradient-descent.html">http://stronglyconvex.com/blog/accelerated-gradient-descent.html</a></h3>
<div class="outline-text-3" id="text-36-74">

</div>

</div>

<div id="outline-container-36-75" class="outline-3">
<h3 id="sec-36-75">Andrew Ng course + assignments <a href="http://see.stanford.edu/see/lecturelist.aspx?coll=348ca38a-3a6d-4052-937d-cb017338d7b1">http://see.stanford.edu/see/lecturelist.aspx?coll=348ca38a-3a6d-4052-937d-cb017338d7b1</a></h3>
<div class="outline-text-3" id="text-36-75">

<p> <a href="http://openclassroom.stanford.edu/MainFolder/CoursePage.php?course=MachineLearning">http://openclassroom.stanford.edu/MainFolder/CoursePage.php?course=MachineLearning</a>
<a href="https://class.coursera.org/ml/lecture/preview">https://class.coursera.org/ml/lecture/preview</a>
</p></div>

</div>

<div id="outline-container-36-76" class="outline-3">
<h3 id="sec-36-76">Microsoft Focus in France on Machine Learning <a href="http://research.microsoft.com/en-us/news/features/mlsqa-042213.aspx">http://research.microsoft.com/en-us/news/features/mlsqa-042213.aspx</a></h3>
<div class="outline-text-3" id="text-36-76">

</div>

</div>

<div id="outline-container-36-77" class="outline-3">
<h3 id="sec-36-77">causality <a href="http://www.causality.inf.ethz.ch/cause-effect.php?page=help">http://www.causality.inf.ethz.ch/cause-effect.php?page=help</a></h3>
<div class="outline-text-3" id="text-36-77">

</div>

</div>

<div id="outline-container-36-78" class="outline-3">
<h3 id="sec-36-78">reservoir sampling <a href="http://blog.cloudera.com/blog/2013/04/hadoop-stratified-randosampling-algorithm/">http://blog.cloudera.com/blog/2013/04/hadoop-stratified-randosampling-algorithm/</a></h3>
<div class="outline-text-3" id="text-36-78">

</div>

</div>

<div id="outline-container-36-79" class="outline-3">
<h3 id="sec-36-79">regression videos <a href="http://www.salford-systems.com/videos/tutorials/805-the-evolution-of-regression-modeling-part-1">http://www.salford-systems.com/videos/tutorials/805-the-evolution-of-regression-modeling-part-1</a></h3>
<div class="outline-text-3" id="text-36-79">

</div>

</div>

<div id="outline-container-36-80" class="outline-3">
<h3 id="sec-36-80">berkeley intro data science course : material <a href="http://datascienc.es/schedule/">http://datascienc.es/schedule/</a></h3>
<div class="outline-text-3" id="text-36-80">

</div>

</div>

<div id="outline-container-36-81" class="outline-3">
<h3 id="sec-36-81">Abusing hash kernels for wildly unprincipled machine learning <a href="https://github.com/jeremydhoon/hashkernel">https://github.com/jeremydhoon/hashkernel</a></h3>
<div class="outline-text-3" id="text-36-81">

<p><a href="http://en.wikipedia.org/wiki/Deep_learning#Deep_Learning_in_Artificial_Neural_Networks">http://en.wikipedia.org/wiki/Deep_learning#Deep_Learning_in_Artificial_Neural_Networks</a>
 <a href="http://jeremydhoon.github.io/2013/03/19/abusing-hash-kernels-for-wildly-unprincipled-machine-learning/">http://jeremydhoon.github.io/2013/03/19/abusing-hash-kernels-for-wildly-unprincipled-machine-learning/</a>
</p></div>

</div>

<div id="outline-container-36-82" class="outline-3">
<h3 id="sec-36-82">30 Most Influential Data Scientists on Twitter <a href="http://storify.com/Kalido/most-influential-data-scientists-on-twitter">http://storify.com/Kalido/most-influential-data-scientists-on-twitter</a></h3>
<div class="outline-text-3" id="text-36-82">

</div>

</div>

<div id="outline-container-36-83" class="outline-3">
<h3 id="sec-36-83">Conditional (Partitioned) Probability — A Primer <a href="http://jeremykun.com/2013/03/28/conditional-partitioned-probability-a-primer/">http://jeremykun.com/2013/03/28/conditional-partitioned-probability-a-primer/</a></h3>
<div class="outline-text-3" id="text-36-83">

</div>

</div>

<div id="outline-container-36-84" class="outline-3">
<h3 id="sec-36-84">clustering algos <a href="http://architects.dzone.com/articles/machine-learning-algorithms">http://architects.dzone.com/articles/machine-learning-algorithms</a></h3>
<div class="outline-text-3" id="text-36-84">

</div>

</div>

<div id="outline-container-36-85" class="outline-3">
<h3 id="sec-36-85">de Bruijn Graphs for Genome Assembly <a href="http://www.homolog.us/Tutorials/index.php?p=1.1">http://www.homolog.us/Tutorials/index.php?p=1.1</a></h3>
<div class="outline-text-3" id="text-36-85">

</div>

</div>

<div id="outline-container-36-86" class="outline-3">
<h3 id="sec-36-86">wise.io <a href="http://venturebeat.com/2013/03/19/data-science-nerds-bring-machine-learning-to-the-masses-exclusive/">http://venturebeat.com/2013/03/19/data-science-nerds-bring-machine-learning-to-the-masses-exclusive/</a></h3>
<div class="outline-text-3" id="text-36-86">

</div>

</div>

<div id="outline-container-36-87" class="outline-3">
<h3 id="sec-36-87">Regret Analysis of Stochastic and Nonstochastic Multi-armed Bandit Problems <a href="http://www.princeton.edu/~sbubeck/book.html">http://www.princeton.edu/~sbubeck/book.html</a></h3>
<div class="outline-text-3" id="text-36-87">

</div>

</div>

<div id="outline-container-36-88" class="outline-3">
<h3 id="sec-36-88">Random topics on optimization, probability, and statistics. By Sébastien Bubeck <a href="https://blogs.princeton.edu/imabandit/">https://blogs.princeton.edu/imabandit/</a></h3>
<div class="outline-text-3" id="text-36-88">

</div>

</div>

<div id="outline-container-36-89" class="outline-3">
<h3 id="sec-36-89">Data Science for Social Good <a href="http://www.ci.uchicago.edu/datasciencefellowship/">http://www.ci.uchicago.edu/datasciencefellowship/</a></h3>
<div class="outline-text-3" id="text-36-89">

</div>

</div>

<div id="outline-container-36-90" class="outline-3">
<h3 id="sec-36-90">Slides: The Evolution of Regression [Part 1] from @salfordsystems <a href="http://1.salford-systems.com/blog/bid/273493/Video-The-Evolution-of-Regression-Part-1">http://1.salford-systems.com/blog/bid/273493/Video-The-Evolution-of-Regression-Part-1</a></h3>
<div class="outline-text-3" id="text-36-90">

</div>

</div>

<div id="outline-container-36-91" class="outline-3">
<h3 id="sec-36-91">data mining book in python <a href="http://guidetodatamining.com/">http://guidetodatamining.com/</a></h3>
<div class="outline-text-3" id="text-36-91">

</div>

</div>

<div id="outline-container-36-92" class="outline-3">
<h3 id="sec-36-92">gensim : topic modelling for humans  <a href="http://radimrehurek.com/gensim/wiki.html#latent-dirichlet-allocation">http://radimrehurek.com/gensim/wiki.html#latent-dirichlet-allocation</a></h3>
<div class="outline-text-3" id="text-36-92">

</div>

</div>

<div id="outline-container-36-93" class="outline-3">
<h3 id="sec-36-93">blog <a href="http://aicoder.blogspot.ch/">http://aicoder.blogspot.ch/</a> Neal Richter</h3>
<div class="outline-text-3" id="text-36-93">

</div>

</div>

<div id="outline-container-36-94" class="outline-3">
<h3 id="sec-36-94">Understanding the Bias-Variance Tradeoff <a href="http://scott.fortmann-roe.com/docs/BiasVariance.html">http://scott.fortmann-roe.com/docs/BiasVariance.html</a></h3>
<div class="outline-text-3" id="text-36-94">

</div>

</div>

<div id="outline-container-36-95" class="outline-3">
<h3 id="sec-36-95">Accurately Measuring Model Prediction Error <a href="http://scott.fortmann-roe.com/docs/MeasuringError.html">http://scott.fortmann-roe.com/docs/MeasuringError.html</a></h3>
<div class="outline-text-3" id="text-36-95">

</div>

</div>

<div id="outline-container-36-96" class="outline-3">
<h3 id="sec-36-96">Top-down particle filtering for Bayesian decision trees <a href="http://arxiv.org/abs/1303.0561">http://arxiv.org/abs/1303.0561</a></h3>
<div class="outline-text-3" id="text-36-96">

</div>

</div>

<div id="outline-container-36-97" class="outline-3">
<h3 id="sec-36-97">spam filtering <a href="http://paulgraham.com/spam.html">http://paulgraham.com/spam.html</a></h3>
<div class="outline-text-3" id="text-36-97">

</div>

</div>

<div id="outline-container-36-98" class="outline-3">
<h3 id="sec-36-98">graph best data structure <a href="http://hortonworks.com/blog/big-graph-data-on-hortonworks-data-platform/">http://hortonworks.com/blog/big-graph-data-on-hortonworks-data-platform/</a></h3>
<div class="outline-text-3" id="text-36-98">

</div>

</div>

<div id="outline-container-36-99" class="outline-3">
<h3 id="sec-36-99">panorama and useful links <a href="http://conductrics.com/data-science-resources/">http://conductrics.com/data-science-resources/</a></h3>
<div class="outline-text-3" id="text-36-99">

</div>

</div>

<div id="outline-container-36-100" class="outline-3">
<h3 id="sec-36-100">MLE logical regression <a href="http://www.johnmyleswhite.com/notebook/2012/12/14/what-is-correctness-for-statistical-software/">http://www.johnmyleswhite.com/notebook/2012/12/14/what-is-correctness-for-statistical-software/</a></h3>
<div class="outline-text-3" id="text-36-100">

</div>

</div>

<div id="outline-container-36-101" class="outline-3">
<h3 id="sec-36-101">Paul Lam cascalog data scientist <a href="http://www.quantisan.com/">http://www.quantisan.com/</a>  incanter  for the future</h3>
<div class="outline-text-3" id="text-36-101">

</div>

</div>

<div id="outline-container-36-102" class="outline-3">
<h3 id="sec-36-102">cascading for impatient <a href="http://www.cascading.org/category/impatient/">http://www.cascading.org/category/impatient/</a>  <a href="https://github.com/Quantisan/Impatient/tree/cascalog/">https://github.com/Quantisan/Impatient/tree/cascalog/</a>)</h3>
<div class="outline-text-3" id="text-36-102">

</div>

</div>

<div id="outline-container-36-103" class="outline-3">
<h3 id="sec-36-103">last page of <a href="http://nosql.mypopescu.com/post/17941632965/lightning-talk-on-cascalog">http://nosql.mypopescu.com/post/17941632965/lightning-talk-on-cascalog</a>*** last page of <a href="http://nosql.mypopescu.com/post/17941632965/lightning-talk-on-cascalog">http://nosql.mypopescu.com/post/17941632965/lightning-talk-on-cascalog</a></h3>
<div class="outline-text-3" id="text-36-103">

</div>

</div>
