toread.org
** http://www.infoq.com/interviews/meijer-big-data http://channel9.msdn.com/posts/Expert-to-Expert-Erik-Meijer-and-Rich-Hickey-Clojure-and-Datomic
** good blog http://followthedata.wordpress.com/
** get dataset http://datakind.org/
** data tools as unix tools http://www.cascading.org/multitool/
** http://www.r-bloggers.com/100-most-read-r-posts-for-2012-stats-from-r-bloggers-big-data-visualization-data-manipulation-and-other-languages/
** hadoop with python http://blog.cloudera.com/blog/2013/01/a-guide-to-python-frameworks-for-hadoop/
** lambda archi with impala http://jameskinley.tumblr.com/post/37398560534/the-lambda-architecture-principles-for-architecting
  http://zurichtechtalks.ch/post/37339409724/an-introduction-to-cloudera-impala-sql-on-top-of
  meetup http://www.bigdata-usergroup.ch/item/372881
** kaggle interview http://techcrunch.com/2013/01/10/in-the-studio-kaggles-anthony-goldbloom-is-building-a-new-kind-of-marketplace/
** Andrew Ng deep learning http://techtalks.tv/talks/machine-learning-and-ai-via-brain-simulations/57862/
** programming R http://www.programmingr.com/content/sparql-with-r/
** interview http://metamarkets.com/2013/data-scientist-interview-florian-leibert-of-airbnb/
** Thoughts on Statistics and Machine Learning http://normaldeviate.wordpress.com/
** Machine learning for hackers : several chapters commented http://slendrmeans.wordpress.com/
http://slendrmeans.wordpress.com/2013/02/08/will-it-python-machine-learning-for-hackers-chapter-6-regression-models-with-regularization/
** bayes basic probabilistic modelling language  http://randomcomputation.blogspot.ch/2013/02/primer-probability-as-basic-modelling.html
** machine learning in clojure http://blog.bigml.com/2013/02/11/streaming-histograms-for-clojure-and-java/
** family of mapreduce http://nosql.mypopescu.com/post/43066595175/the-family-of-mapreduce-and-large-scale-data-processing
** Test-Driven Development for Big Data http://www.youtube.com/watch?v=wB5BPM6eNIs&feature=youtu.be
** overview of cascading http://vimeo.com/59610496 (Paco Nathan) scalding http://vimeo.com/59610497 from Chicago Hadoop User Group
** fastml blog http://fastml.com/dimensionality-reduction-for-sparse-binary-data/
* R
** finance use case : Minimal variance asset allocation for Stocks ISA http://www.quantisan.com/minimal-variance-asset-allocation-for-stocks-isa/
** glm gam forrest http://www.r-bloggers.com/a-brief-tour-of-the-trees-and-forests
** http://datascientistinsights.com/2013/02/25/20-r-packages-that-should-impact-every-data-scientist/
** R on hadoop http://blog.cloudera.com/blog/2013/02/how-to-resample-from-a-large-data-set-in-parallel-with-r-on-hadoop/
** R book https://github.com/hadley/devtools/wiki/Functional-programming
** apply articles http://stackoverflow.com/questions/3505701/r-grouping-functions-sapply-vs-lapply-vs-apply-vs-tapply-vs-by-vs-aggrega
http://nsaunders.wordpress.com/2010/08/20/a-brief-introduction-to-apply-in-r/
* database
** MongoDB basics for everyone – Part 5 Using find() and findOne() http://paulscott.co.za/blog/mongodb-basics-for-everyone-part-5-using-find-and-findone/
** Distributed Algorithms in NoSQL Databases  http://highlyscalable.wordpress.com/2012/09/18/distributed-algorithms-in-nosql-databases/
data consistency , data placement, system coordination
** datomic
*** Learn datalog today https://github.com/jonase/learndatalogtoday
*** Component Entities http://blog.datomic.com/2013/06/component-entities.html
** Inside HyperLevelDB : makes LevelDB faster http://hackingdistributed.com/2013/06/17/hyperleveldb/
** NoSQL Distilled to an hour - Martin Fowler http://vimeo.com/66052102 http://martinfowler.com/bliki/PolyglotPersistence.html
** Videos coming http://2013.nosql-matters.org/cgn/abstracts/ 
