toread.html

<div id="outline-container-36-104" class="outline-3">
<h3 id="sec-36-104"><a href="http://www.infoq.com/interviews/meijer-big-data">http://www.infoq.com/interviews/meijer-big-data</a> <a href="http://channel9.msdn.com/posts/Expert-to-Expert-Erik-Meijer-and-Rich-Hickey-Clojure-and-Datomic">http://channel9.msdn.com/posts/Expert-to-Expert-Erik-Meijer-and-Rich-Hickey-Clojure-and-Datomic</a></h3>
<div class="outline-text-3" id="text-36-104">

</div>

</div>

<div id="outline-container-36-105" class="outline-3">
<h3 id="sec-36-105">good blog <a href="http://followthedata.wordpress.com/">http://followthedata.wordpress.com/</a></h3>
<div class="outline-text-3" id="text-36-105">

</div>

</div>

<div id="outline-container-36-106" class="outline-3">
<h3 id="sec-36-106">get dataset <a href="http://datakind.org/">http://datakind.org/</a></h3>
<div class="outline-text-3" id="text-36-106">

</div>

</div>

<div id="outline-container-36-107" class="outline-3">
<h3 id="sec-36-107">data tools as unix tools <a href="http://www.cascading.org/multitool/">http://www.cascading.org/multitool/</a></h3>
<div class="outline-text-3" id="text-36-107">

</div>

</div>

<div id="outline-container-36-108" class="outline-3">
<h3 id="sec-36-108"><a href="http://www.r-bloggers.com/100-most-read-r-posts-for-2012-stats-from-r-bloggers-big-data-visualization-data-manipulation-and-other-languages/">http://www.r-bloggers.com/100-most-read-r-posts-for-2012-stats-from-r-bloggers-big-data-visualization-data-manipulation-and-other-languages/</a></h3>
<div class="outline-text-3" id="text-36-108">

</div>

</div>

<div id="outline-container-36-109" class="outline-3">
<h3 id="sec-36-109">hadoop with python <a href="http://blog.cloudera.com/blog/2013/01/a-guide-to-python-frameworks-for-hadoop/">http://blog.cloudera.com/blog/2013/01/a-guide-to-python-frameworks-for-hadoop/</a></h3>
<div class="outline-text-3" id="text-36-109">

</div>

</div>

<div id="outline-container-36-110" class="outline-3">
<h3 id="sec-36-110">lambda archi with impala <a href="http://jameskinley.tumblr.com/post/37398560534/the-lambda-architecture-principles-for-architecting">http://jameskinley.tumblr.com/post/37398560534/the-lambda-architecture-principles-for-architecting</a></h3>
<div class="outline-text-3" id="text-36-110">

<p>  <a href="http://zurichtechtalks.ch/post/37339409724/an-introduction-to-cloudera-impala-sql-on-top-of">http://zurichtechtalks.ch/post/37339409724/an-introduction-to-cloudera-impala-sql-on-top-of</a>
  meetup <a href="http://www.bigdata-usergroup.ch/item/372881">http://www.bigdata-usergroup.ch/item/372881</a>
</p></div>

</div>

<div id="outline-container-36-111" class="outline-3">
<h3 id="sec-36-111">kaggle interview <a href="http://techcrunch.com/2013/01/10/in-the-studio-kaggles-anthony-goldbloom-is-building-a-new-kind-of-marketplace/">http://techcrunch.com/2013/01/10/in-the-studio-kaggles-anthony-goldbloom-is-building-a-new-kind-of-marketplace/</a></h3>
<div class="outline-text-3" id="text-36-111">

</div>

</div>

<div id="outline-container-36-112" class="outline-3">
<h3 id="sec-36-112">Andrew Ng deep learning <a href="http://techtalks.tv/talks/machine-learning-and-ai-via-brain-simulations/57862/">http://techtalks.tv/talks/machine-learning-and-ai-via-brain-simulations/57862/</a></h3>
<div class="outline-text-3" id="text-36-112">

</div>

</div>

<div id="outline-container-36-113" class="outline-3">
<h3 id="sec-36-113">programming R <a href="http://www.programmingr.com/content/sparql-with-r/">http://www.programmingr.com/content/sparql-with-r/</a></h3>
<div class="outline-text-3" id="text-36-113">

</div>

</div>

<div id="outline-container-36-114" class="outline-3">
<h3 id="sec-36-114">interview <a href="http://metamarkets.com/2013/data-scientist-interview-florian-leibert-of-airbnb/">http://metamarkets.com/2013/data-scientist-interview-florian-leibert-of-airbnb/</a></h3>
<div class="outline-text-3" id="text-36-114">

</div>

</div>

<div id="outline-container-36-115" class="outline-3">
<h3 id="sec-36-115">Thoughts on Statistics and Machine Learning <a href="http://normaldeviate.wordpress.com/">http://normaldeviate.wordpress.com/</a></h3>
<div class="outline-text-3" id="text-36-115">

</div>

</div>

<div id="outline-container-36-116" class="outline-3">
<h3 id="sec-36-116">Machine learning for hackers : several chapters commented <a href="http://slendrmeans.wordpress.com/">http://slendrmeans.wordpress.com/</a></h3>
<div class="outline-text-3" id="text-36-116">

<p><a href="http://slendrmeans.wordpress.com/2013/02/08/will-it-python-machine-learning-for-hackers-chapter-6-regression-models-with-regularization/">http://slendrmeans.wordpress.com/2013/02/08/will-it-python-machine-learning-for-hackers-chapter-6-regression-models-with-regularization/</a>
</p></div>

</div>

<div id="outline-container-36-117" class="outline-3">
<h3 id="sec-36-117">bayes basic probabilistic modelling language  <a href="http://randomcomputation.blogspot.ch/2013/02/primer-probability-as-basic-modelling.html">http://randomcomputation.blogspot.ch/2013/02/primer-probability-as-basic-modelling.html</a></h3>
<div class="outline-text-3" id="text-36-117">

</div>

</div>

<div id="outline-container-36-118" class="outline-3">
<h3 id="sec-36-118">machine learning in clojure <a href="http://blog.bigml.com/2013/02/11/streaming-histograms-for-clojure-and-java/">http://blog.bigml.com/2013/02/11/streaming-histograms-for-clojure-and-java/</a></h3>
<div class="outline-text-3" id="text-36-118">

</div>

</div>

<div id="outline-container-36-119" class="outline-3">
<h3 id="sec-36-119">family of mapreduce <a href="http://nosql.mypopescu.com/post/43066595175/the-family-of-mapreduce-and-large-scale-data-processing">http://nosql.mypopescu.com/post/43066595175/the-family-of-mapreduce-and-large-scale-data-processing</a></h3>
<div class="outline-text-3" id="text-36-119">

</div>

</div>

<div id="outline-container-36-120" class="outline-3">
<h3 id="sec-36-120">Test-Driven Development for Big Data <a href="http://www.youtube.com/watch?v=wB5BPM6eNIs&amp;feature=youtu.be">http://www.youtube.com/watch?v=wB5BPM6eNIs&amp;feature=youtu.be</a></h3>
<div class="outline-text-3" id="text-36-120">

</div>

</div>

<div id="outline-container-36-121" class="outline-3">
<h3 id="sec-36-121">overview of cascading <a href="http://vimeo.com/59610496">http://vimeo.com/59610496</a> (Paco Nathan) scalding <a href="http://vimeo.com/59610497">http://vimeo.com/59610497</a> from Chicago Hadoop User Group</h3>
<div class="outline-text-3" id="text-36-121">

</div>

</div>

<div id="outline-container-36-122" class="outline-3">
<h3 id="sec-36-122">fastml blog <a href="http://fastml.com/dimensionality-reduction-for-sparse-binary-data/">http://fastml.com/dimensionality-reduction-for-sparse-binary-data/</a></h3>
<div class="outline-text-3" id="text-36-122">

</div>
</div>

</div>

<div id="outline-container-37" class="outline-2">
<h2 id="sec-37">R</h2>
<div class="outline-text-2" id="text-37">


</div>

<div id="outline-container-37-1" class="outline-3">
<h3 id="sec-37-1">finance use case : Minimal variance asset allocation for Stocks ISA <a href="http://www.quantisan.com/minimal-variance-asset-allocation-for-stocks-isa/">http://www.quantisan.com/minimal-variance-asset-allocation-for-stocks-isa/</a></h3>
<div class="outline-text-3" id="text-37-1">

</div>

</div>

<div id="outline-container-37-2" class="outline-3">
<h3 id="sec-37-2">glm gam forrest <a href="http://www.r-bloggers.com/a-brief-tour-of-the-trees-and-forests">http://www.r-bloggers.com/a-brief-tour-of-the-trees-and-forests</a></h3>
<div class="outline-text-3" id="text-37-2">

</div>

</div>

<div id="outline-container-37-3" class="outline-3">
<h3 id="sec-37-3"><a href="http://datascientistinsights.com/2013/02/25/20-r-packages-that-should-impact-every-data-scientist/">http://datascientistinsights.com/2013/02/25/20-r-packages-that-should-impact-every-data-scientist/</a></h3>
<div class="outline-text-3" id="text-37-3">

</div>

</div>

<div id="outline-container-37-4" class="outline-3">
<h3 id="sec-37-4">R on hadoop <a href="http://blog.cloudera.com/blog/2013/02/how-to-resample-from-a-large-data-set-in-parallel-with-r-on-hadoop/">http://blog.cloudera.com/blog/2013/02/how-to-resample-from-a-large-data-set-in-parallel-with-r-on-hadoop/</a></h3>
<div class="outline-text-3" id="text-37-4">

</div>

</div>

<div id="outline-container-37-5" class="outline-3">
<h3 id="sec-37-5">R book <a href="https://github.com/hadley/devtools/wiki/Functional-programming">https://github.com/hadley/devtools/wiki/Functional-programming</a></h3>
<div class="outline-text-3" id="text-37-5">

</div>

</div>

<div id="outline-container-37-6" class="outline-3">
<h3 id="sec-37-6">apply articles <a href="http://stackoverflow.com/questions/3505701/r-grouping-functions-sapply-vs-lapply-vs-apply-vs-tapply-vs-by-vs-aggrega">http://stackoverflow.com/questions/3505701/r-grouping-functions-sapply-vs-lapply-vs-apply-vs-tapply-vs-by-vs-aggrega</a></h3>
<div class="outline-text-3" id="text-37-6">

<p><a href="http://nsaunders.wordpress.com/2010/08/20/a-brief-introduction-to-apply-in-r/">http://nsaunders.wordpress.com/2010/08/20/a-brief-introduction-to-apply-in-r/</a>
</p></div>
</div>

</div>

<div id="outline-container-38" class="outline-2">
<h2 id="sec-38">database</h2>
<div class="outline-text-2" id="text-38">


</div>

<div id="outline-container-38-1" class="outline-3">
<h3 id="sec-38-1">MongoDB basics for everyone – Part 5 Using find() and findOne() <a href="http://paulscott.co.za/blog/mongodb-basics-for-everyone-part-5-using-find-and-findone/">http://paulscott.co.za/blog/mongodb-basics-for-everyone-part-5-using-find-and-findone/</a></h3>
<div class="outline-text-3" id="text-38-1">

</div>

</div>

<div id="outline-container-38-2" class="outline-3">
<h3 id="sec-38-2">Distributed Algorithms in NoSQL Databases  <a href="http://highlyscalable.wordpress.com/2012/09/18/distributed-algorithms-in-nosql-databases/">http://highlyscalable.wordpress.com/2012/09/18/distributed-algorithms-in-nosql-databases/</a></h3>
<div class="outline-text-3" id="text-38-2">

<p>data consistency , data placement, system coordination
</p></div>

</div>

<div id="outline-container-38-3" class="outline-3">
<h3 id="sec-38-3">datomic</h3>
<div class="outline-text-3" id="text-38-3">


</div>

<div id="outline-container-38-3-1" class="outline-4">
<h4 id="sec-38-3-1">Learn datalog today <a href="https://github.com/jonase/learndatalogtoday">https://github.com/jonase/learndatalogtoday</a></h4>
<div class="outline-text-4" id="text-38-3-1">

</div>

</div>

<div id="outline-container-38-3-2" class="outline-4">
<h4 id="sec-38-3-2">Component Entities <a href="http://blog.datomic.com/2013/06/component-entities.html">http://blog.datomic.com/2013/06/component-entities.html</a></h4>
<div class="outline-text-4" id="text-38-3-2">

</div>
</div>

</div>

<div id="outline-container-38-4" class="outline-3">
<h3 id="sec-38-4">Inside HyperLevelDB : makes LevelDB faster <a href="http://hackingdistributed.com/2013/06/17/hyperleveldb/">http://hackingdistributed.com/2013/06/17/hyperleveldb/</a></h3>
<div class="outline-text-3" id="text-38-4">

</div>

</div>

<div id="outline-container-38-5" class="outline-3">
<h3 id="sec-38-5">NoSQL Distilled to an hour - Martin Fowler <a href="http://vimeo.com/66052102">http://vimeo.com/66052102</a> <a href="http://martinfowler.com/bliki/PolyglotPersistence.html">http://martinfowler.com/bliki/PolyglotPersistence.html</a></h3>
<div class="outline-text-3" id="text-38-5">

</div>

</div>

<div id="outline-container-38-6" class="outline-3">
<h3 id="sec-38-6">Videos coming <a href="http://2013.nosql-matters.org/cgn/abstracts/">http://2013.nosql-matters.org/cgn/abstracts/</a></h3>
<div class="outline-text-3" id="text-38-6">

</div>

</div>
