toread.org
** Tour of datomic query http://blog.datomic.com/2013/05/a-whirlwind-tour-of-datomic-query_16.html
** Building Cloud Storage Services with Riak http://architects.dzone.com/articles/building-cloud-storage
** graphlab distributed graph DB http://graphlab.com/ http://techcrunch.com/2013/05/14/graphlab-raises-6-75m-for-data-analysis-tool-used-for-consumer-recommendation-services/
** atomic commit explained : http://www.sqlite.org/atomiccommit.html
** cassandra by example : data modeling by Eric Evans http://de.slideshare.net/jericevans/cassandra-by-example-data-modelling-with-cql3
** Using Elastic Search as a Key Value store http://www.jillesvangurp.com/2013/01/15/using-elastic-search-as-a-key-value-store/
** Next Generation Databases  http://nosql-database.org/
** NoSQL matters 2013 conf http://2013.nosql-matters.org/cgn/agenda/
** google F1 The Fault-Tolerant Distributed RDBM  http://research.google.com/pubs/pub38125.html
** cassandra intro http://nosql.mypopescu.com/post/44771946824/brief-intro-to-cassandra-in-27-slides
** graph DB comparison http://nosql.mypopescu.com/post/40759505554/a-comparison-of-7-graph-databases
   https://docs.google.com/spreadsheet/ccc?key=0AlHPKx74VyC5dERyMHlLQ2lMY3dFQS1JRExYQUNhdVE#gid=0
* Data Visualization
** Kepler’s Tally of Planets http://www.nytimes.com/interactive/science/space/keplers-tally-of-planets.html?smid=tw-share
** Sparpaket des Kantons Bern visualisiert by  Thomas Preusse und Oleg Lavrovsky http://www.stuermer.ch/maemst/2013/07/asp-2014/
** Python interactive visualization library for large dataset https://github.com/ContinuumIO/Bokeh based on https://github.com/JosephCottam/Stencil
** Twitter hastags viz by QuatarComputingResearchIinstitute http://scd1.qcri.org/tca/
** JS graph libraries 
*** http://dimplejs.org/
*** http://code.shutterstock.com/rickshaw/
*** http://www.flotcharts.org/ 
*** http://sigmajs.org/ 
*** http://www.oesmith.co.uk/morris.js/
*** http://dygraphs.com/
** JS data projects from okfnlabs http://okfnlabs.org/projects/
*** JS bubble tree lib by Gregor Aisch  https://github.com/okfn/bubbletree/wiki/Bubble-Tree-Documentation
*** Recline.js : relax with your data  http://okfnlabs.org/recline/docs/
*** Timeliner http://timeliner.okfnlabs.org/
** GED VIZ is a new online-tool for visualizing complex economic relations http://viz.ged-project.de/?lang=en
** eyeo festival https://vimeo.com/channels/544709/69448223
** gnuplot
*** gnuplot demos http://gnuplot.sourceforge.net/demo/index.html
*** Frequency Plot explained http://psy.swansea.ac.uk/staff/carter/gnuplot/gnuplot_frequency.htm
** plotting
*** violin plot http://en.wikipedia.org/wiki/Violin_plot http://pyinsci.blogspot.fr/2009/09/violin-plot-with-matplotlib.html
*** boxplot http://glowingpython.blogspot.fr/2012/09/boxplot-with-matplotlib.html http://flowingdata.com/2008/02/15/how-to-read-and-use-a-box-and-whisker-plot/
http://www.purplemath.com/modules/boxwhisk3.htm
*** Dashboard gallery http://econsultancy.com/au/blog/62844-24-beautifully-designed-web-dashboards-that-data-geeks-will-love
** Jason Davies's blog http://www.jasondavies.com/
** financial map viz : between map and flowchart http://opencorporates.com/viz/financial/index.html
** maps
*** GDAL - Geospatial Data Abstraction Library http://www.gdal.org/ : translator library for raster geospatial data formats
*** Best maps tools  http://bashooka.com/freebie/great-tools-for-building-interactive-maps/
    - leafletjs 
    - mapbox 
    - polymaps 
    - maptales 
    - modestmaps 
    - INTERACTIVE WORLD MAPS worldpress plugin
    - JQUERY INTERACTIVE SVG MAP PLUGIN
    - POINT OF INTEREST (POI) AUTO MAP
    - zeemaps
    - MAPS.STAMEN.COM
    - Kartograph
*** A circular subway map for NYC by Max Roberts http://www.creativereview.co.uk/cr-blog/2013/july/nyc-subway-map-max-roberts
*** D3 geo effects explained http://techslides.com/d3-world-maps-tooltips-zooming-and-queue/
