toread.html

<div id="outline-container-38-7" class="outline-3">
<h3 id="sec-38-7">Tour of datomic query <a href="http://blog.datomic.com/2013/05/a-whirlwind-tour-of-datomic-query_16.html">http://blog.datomic.com/2013/05/a-whirlwind-tour-of-datomic-query_16.html</a></h3>
<div class="outline-text-3" id="text-38-7">

</div>

</div>

<div id="outline-container-38-8" class="outline-3">
<h3 id="sec-38-8">Building Cloud Storage Services with Riak <a href="http://architects.dzone.com/articles/building-cloud-storage">http://architects.dzone.com/articles/building-cloud-storage</a></h3>
<div class="outline-text-3" id="text-38-8">

</div>

</div>

<div id="outline-container-38-9" class="outline-3">
<h3 id="sec-38-9">graphlab distributed graph DB <a href="http://graphlab.com/">http://graphlab.com/</a> <a href="http://techcrunch.com/2013/05/14/graphlab-raises-6-75m-for-data-analysis-tool-used-for-consumer-recommendation-services/">http://techcrunch.com/2013/05/14/graphlab-raises-6-75m-for-data-analysis-tool-used-for-consumer-recommendation-services/</a></h3>
<div class="outline-text-3" id="text-38-9">

</div>

</div>

<div id="outline-container-38-10" class="outline-3">
<h3 id="sec-38-10">atomic commit explained : <a href="http://www.sqlite.org/atomiccommit.html">http://www.sqlite.org/atomiccommit.html</a></h3>
<div class="outline-text-3" id="text-38-10">

</div>

</div>

<div id="outline-container-38-11" class="outline-3">
<h3 id="sec-38-11">cassandra by example : data modeling by Eric Evans <a href="http://de.slideshare.net/jericevans/cassandra-by-example-data-modelling-with-cql3">http://de.slideshare.net/jericevans/cassandra-by-example-data-modelling-with-cql3</a></h3>
<div class="outline-text-3" id="text-38-11">

</div>

</div>

<div id="outline-container-38-12" class="outline-3">
<h3 id="sec-38-12">Using Elastic Search as a Key Value store <a href="http://www.jillesvangurp.com/2013/01/15/using-elastic-search-as-a-key-value-store/">http://www.jillesvangurp.com/2013/01/15/using-elastic-search-as-a-key-value-store/</a></h3>
<div class="outline-text-3" id="text-38-12">

</div>

</div>

<div id="outline-container-38-13" class="outline-3">
<h3 id="sec-38-13">Next Generation Databases  <a href="http://nosql-database.org/">http://nosql-database.org/</a></h3>
<div class="outline-text-3" id="text-38-13">

</div>

</div>

<div id="outline-container-38-14" class="outline-3">
<h3 id="sec-38-14">NoSQL matters 2013 conf <a href="http://2013.nosql-matters.org/cgn/agenda/">http://2013.nosql-matters.org/cgn/agenda/</a></h3>
<div class="outline-text-3" id="text-38-14">

</div>

</div>

<div id="outline-container-38-15" class="outline-3">
<h3 id="sec-38-15">google F1 The Fault-Tolerant Distributed RDBM  <a href="http://research.google.com/pubs/pub38125.html">http://research.google.com/pubs/pub38125.html</a></h3>
<div class="outline-text-3" id="text-38-15">

</div>

</div>

<div id="outline-container-38-16" class="outline-3">
<h3 id="sec-38-16">cassandra intro <a href="http://nosql.mypopescu.com/post/44771946824/brief-intro-to-cassandra-in-27-slides">http://nosql.mypopescu.com/post/44771946824/brief-intro-to-cassandra-in-27-slides</a></h3>
<div class="outline-text-3" id="text-38-16">

</div>

</div>

<div id="outline-container-38-17" class="outline-3">
<h3 id="sec-38-17">graph DB comparison <a href="http://nosql.mypopescu.com/post/40759505554/a-comparison-of-7-graph-databases">http://nosql.mypopescu.com/post/40759505554/a-comparison-of-7-graph-databases</a></h3>
<div class="outline-text-3" id="text-38-17">

<p>   <a href="https://docs.google.com/spreadsheet/ccc?key=0AlHPKx74VyC5dERyMHlLQ2lMY3dFQS1JRExYQUNhdVE#gid=0">https://docs.google.com/spreadsheet/ccc?key=0AlHPKx74VyC5dERyMHlLQ2lMY3dFQS1JRExYQUNhdVE#gid=0</a>
</p></div>
</div>

</div>

<div id="outline-container-39" class="outline-2">
<h2 id="sec-39">Data Visualization</h2>
<div class="outline-text-2" id="text-39">


</div>

<div id="outline-container-39-1" class="outline-3">
<h3 id="sec-39-1">Kepler’s Tally of Planets <a href="http://www.nytimes.com/interactive/science/space/keplers-tally-of-planets.html?smid=tw-share">http://www.nytimes.com/interactive/science/space/keplers-tally-of-planets.html?smid=tw-share</a></h3>
<div class="outline-text-3" id="text-39-1">

</div>

</div>

<div id="outline-container-39-2" class="outline-3">
<h3 id="sec-39-2">Sparpaket des Kantons Bern visualisiert by  Thomas Preusse und Oleg Lavrovsky <a href="http://www.stuermer.ch/maemst/2013/07/asp-2014/">http://www.stuermer.ch/maemst/2013/07/asp-2014/</a></h3>
<div class="outline-text-3" id="text-39-2">

</div>

</div>

<div id="outline-container-39-3" class="outline-3">
<h3 id="sec-39-3">Python interactive visualization library for large dataset <a href="https://github.com/ContinuumIO/Bokeh">https://github.com/ContinuumIO/Bokeh</a> based on <a href="https://github.com/JosephCottam/Stencil">https://github.com/JosephCottam/Stencil</a></h3>
<div class="outline-text-3" id="text-39-3">

</div>

</div>

<div id="outline-container-39-4" class="outline-3">
<h3 id="sec-39-4">Twitter hastags viz by QuatarComputingResearchIinstitute <a href="http://scd1.qcri.org/tca/">http://scd1.qcri.org/tca/</a></h3>
<div class="outline-text-3" id="text-39-4">


</div>

<div id="outline-container-39-4-1" class="outline-4">
<h4 id="sec-39-4-1">JS graph libraries</h4>
<div class="outline-text-4" id="text-39-4-1">

<ul>
<li id="sec-39-4-1-1"><a href="http://code.shutterstock.com/rickshaw/">http://code.shutterstock.com/rickshaw/</a><br/>
</li>
</ul>
<ul>
<li id="sec-39-4-1-2"><a href="http://www.flotcharts.org/">http://www.flotcharts.org/</a><br/>
</li>
</ul>
<ul>
<li id="sec-39-4-1-3"><a href="http://sigmajs.org/">http://sigmajs.org/</a><br/>
</li>
</ul>
<ul>
<li id="sec-39-4-1-4"><a href="http://www.oesmith.co.uk/morris.js/">http://www.oesmith.co.uk/morris.js/</a><br/>
</li>
</ul>
<ul>
<li id="sec-39-4-1-5"><a href="http://dygraphs.com/">http://dygraphs.com/</a><br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-39-5" class="outline-3">
<h3 id="sec-39-5">JS data projects from okfnlabs <a href="http://okfnlabs.org/projects/">http://okfnlabs.org/projects/</a></h3>
<div class="outline-text-3" id="text-39-5">


</div>

<div id="outline-container-39-5-1" class="outline-4">
<h4 id="sec-39-5-1">JS bubble tree lib by Gregor Aisch  <a href="https://github.com/okfn/bubbletree/wiki/Bubble-Tree-Documentation">https://github.com/okfn/bubbletree/wiki/Bubble-Tree-Documentation</a></h4>
<div class="outline-text-4" id="text-39-5-1">

</div>

</div>

<div id="outline-container-39-5-2" class="outline-4">
<h4 id="sec-39-5-2">Recline.js : relax with your data  <a href="http://okfnlabs.org/recline/docs/">http://okfnlabs.org/recline/docs/</a></h4>
<div class="outline-text-4" id="text-39-5-2">

</div>

</div>

<div id="outline-container-39-5-3" class="outline-4">
<h4 id="sec-39-5-3">Timeliner <a href="http://timeliner.okfnlabs.org/">http://timeliner.okfnlabs.org/</a></h4>
<div class="outline-text-4" id="text-39-5-3">

</div>
</div>

</div>

<div id="outline-container-39-6" class="outline-3">
<h3 id="sec-39-6">GED VIZ is a new online-tool for visualizing complex economic relations <a href="http://viz.ged-project.de/?lang=en">http://viz.ged-project.de/?lang=en</a></h3>
<div class="outline-text-3" id="text-39-6">

</div>

</div>

<div id="outline-container-39-7" class="outline-3">
<h3 id="sec-39-7">eyeo festival <a href="https://vimeo.com/channels/544709/69448223">https://vimeo.com/channels/544709/69448223</a></h3>
<div class="outline-text-3" id="text-39-7">

</div>

</div>

<div id="outline-container-39-8" class="outline-3">
<h3 id="sec-39-8">gnuplot</h3>
<div class="outline-text-3" id="text-39-8">


</div>

<div id="outline-container-39-8-1" class="outline-4">
<h4 id="sec-39-8-1">gnuplot demos <a href="http://gnuplot.sourceforge.net/demo/index.html">http://gnuplot.sourceforge.net/demo/index.html</a></h4>
<div class="outline-text-4" id="text-39-8-1">

</div>

</div>

<div id="outline-container-39-8-2" class="outline-4">
<h4 id="sec-39-8-2">Frequency Plot explained <a href="http://psy.swansea.ac.uk/staff/carter/gnuplot/gnuplot_frequency.htm">http://psy.swansea.ac.uk/staff/carter/gnuplot/gnuplot_frequency.htm</a></h4>
<div class="outline-text-4" id="text-39-8-2">

</div>
</div>

</div>

<div id="outline-container-39-9" class="outline-3">
<h3 id="sec-39-9">plotting</h3>
<div class="outline-text-3" id="text-39-9">


</div>

<div id="outline-container-39-9-1" class="outline-4">
<h4 id="sec-39-9-1">violin plot <a href="http://en.wikipedia.org/wiki/Violin_plot">http://en.wikipedia.org/wiki/Violin_plot</a> <a href="http://pyinsci.blogspot.fr/2009/09/violin-plot-with-matplotlib.html">http://pyinsci.blogspot.fr/2009/09/violin-plot-with-matplotlib.html</a></h4>
<div class="outline-text-4" id="text-39-9-1">

</div>

</div>

<div id="outline-container-39-9-2" class="outline-4">
<h4 id="sec-39-9-2">boxplot <a href="http://glowingpython.blogspot.fr/2012/09/boxplot-with-matplotlib.html">http://glowingpython.blogspot.fr/2012/09/boxplot-with-matplotlib.html</a> <a href="http://flowingdata.com/2008/02/15/how-to-read-and-use-a-box-and-whisker-plot/">http://flowingdata.com/2008/02/15/how-to-read-and-use-a-box-and-whisker-plot/</a></h4>
<div class="outline-text-4" id="text-39-9-2">

<p><a href="http://www.purplemath.com/modules/boxwhisk3.htm">http://www.purplemath.com/modules/boxwhisk3.htm</a>
</p></div>

</div>

<div id="outline-container-39-9-3" class="outline-4">
<h4 id="sec-39-9-3">Dashboard gallery <a href="http://econsultancy.com/au/blog/62844-24-beautifully-designed-web-dashboards-that-data-geeks-will-love">http://econsultancy.com/au/blog/62844-24-beautifully-designed-web-dashboards-that-data-geeks-will-love</a></h4>
<div class="outline-text-4" id="text-39-9-3">

</div>
</div>

</div>

<div id="outline-container-39-10" class="outline-3">
<h3 id="sec-39-10">Jason Davies's blog <a href="http://www.jasondavies.com/">http://www.jasondavies.com/</a></h3>
<div class="outline-text-3" id="text-39-10">

</div>

</div>

<div id="outline-container-39-11" class="outline-3">
<h3 id="sec-39-11">financial map viz : between map and flowchart <a href="http://opencorporates.com/viz/financial/index.html">http://opencorporates.com/viz/financial/index.html</a></h3>
<div class="outline-text-3" id="text-39-11">

</div>

</div>

<div id="outline-container-39-12" class="outline-3">
<h3 id="sec-39-12">maps</h3>
<div class="outline-text-3" id="text-39-12">


</div>

<div id="outline-container-39-12-1" class="outline-4">
<h4 id="sec-39-12-1">GDAL - Geospatial Data Abstraction Library <a href="http://www.gdal.org/">http://www.gdal.org/</a> : translator library for raster geospatial data formats</h4>
<div class="outline-text-4" id="text-39-12-1">

</div>

</div>

<div id="outline-container-39-12-2" class="outline-4">
<h4 id="sec-39-12-2">Best maps tools  <a href="http://bashooka.com/freebie/great-tools-for-building-interactive-maps/">http://bashooka.com/freebie/great-tools-for-building-interactive-maps/</a></h4>
<div class="outline-text-4" id="text-39-12-2">

<ul>
<li>leafletjs 
</li>
<li>mapbox 
</li>
<li>polymaps 
</li>
<li>maptales 
</li>
<li>modestmaps 
</li>
<li>INTERACTIVE WORLD MAPS worldpress plugin
</li>
<li>JQUERY INTERACTIVE SVG MAP PLUGIN
</li>
<li>POINT OF INTEREST (POI) AUTO MAP
</li>
<li>zeemaps
</li>
<li>MAPS.STAMEN.COM
</li>
<li>Kartograph
</li>
</ul>

</div>

</div>

<div id="outline-container-39-12-3" class="outline-4">
<h4 id="sec-39-12-3">A circular subway map for NYC by Max Roberts <a href="http://www.creativereview.co.uk/cr-blog/2013/july/nyc-subway-map-max-roberts">http://www.creativereview.co.uk/cr-blog/2013/july/nyc-subway-map-max-roberts</a></h4>
<div class="outline-text-4" id="text-39-12-3">

</div>

</div>

<div id="outline-container-39-12-4" class="outline-4">
<h4 id="sec-39-12-4">D3 geo effects explained <a href="http://techslides.com/d3-world-maps-tooltips-zooming-and-queue/">http://techslides.com/d3-world-maps-tooltips-zooming-and-queue/</a></h4>
<div class="outline-text-4" id="text-39-12-4">

</div>

</div>
