toread.org
*** Geospatial Education Portfolio @ Penn State University http://www.worldcampus.psu.edu/gep?cm_mmc=Geospatial-Ed+12-13-_-MOOC-_-Online:Banner:Other-_-GEP+Tracking+URL+(PEN43102)
*** US healthy map http://www.washingtonpost.com/wp-srv/special/health/us-life-expectancies/
*** Compare Urban Life Around the Globe With New Side-by-Side City Maps http://www.wired.com/wiredscience/2013/07/urban-observatory/
*** map blog from wired http://www.wired.com/wiredscience/maplab/
*** heat map example by yelp http://flowingdata.com/2013/07/02/yelp-maps-words-used-in-reviews/
*** other heat map example http://datadrivenjournalism.net/featured_projects/no_time_for_anger_a_reportage_on_fukushima_two_years_after_the_triple_disas
*** Sattelite raster http://www.jasondavies.com/maps/raster/satellite/  
But remember this started with vector tiles. And the vector tiles are
in the Mercator projection. It’s much harder to take Mercator tiles
and reproject them to a different projection because you don’t know
which tiles are visible.

Hard problems like this are Jason Davies’ bread and butter. Jason saw
the above examples and set out to determine which tiles would be
visible in an arbitrary projection. He then created the above visual
demonstration of his algorithm. The red tiles are the ones that are
visible, and as you zoom in and out, you can see it recalculate the
set of needed tiles instantly.
***  making the OpenStreetMap data accessible in tile format http://openstreetmap.us/~migurski/vector-datasource/ 
explanation http://mike.teczno.com/notes/postgreslessness-mapnik-vectiles.html
*** cartodb http://developers.cartodb.com/
*** How to Map Where You've Mapped in OpenStreetMap with tilemill http://www.mapbox.com/blog/how-to-map-contributions-openstreetmap/
*** data.stories on maps with Mike Migurski http://datastori.es/data-stories-20-maps-migurski/
*** modestmaps js library for maps made by stamen team http://modestmaps.com/
*** maps conf http://stateofthemap.us/
*** crimespotting http://oakland.crimespotting.org
*** Transforming the Places We Live With Open Data http://m.theatlanticcities.com/technology/2013/03/our-12-favorite-ideas-transforming-places-we-live-open-data/5083/
*** Twitter maps http://www.mapbox.com/labs/twitter-gnip/languages/
*** Stamen a design and technology studio in San Francisco maps and data visualization. The next most obvious thing. http://stamen.com/
*** Stamen people http://ericrodenbeck.tumblr.com/ http://content.stamen.com/
*** Maps Layout form stamaen : burning maps http://content.stamen.com/announcing_burningmap 
toner maps https://github.com/Citytracking/toner
watercolor http://maps.stamen.com/#watercolor/12/37.7706/-122.3782
*** Maps Applications http://fieldpapers.org/ http://www.dotspotting.org/faq http://citytracking.org/
*** help maps to be better http://walking-papers.org/ by Michal Migurski http://mike.teczno.com/
*** Convert Address to long,lat http://www.gpsvisualizer.com/geocoder/
*** OpenStreetMap's new iD editor http://www.mapbox.com/blog/new-map-editor-launches-openstreetmap/
*** satellite maps explained by MapBox http://www.wired.com/design/2013/05/a-cloudless-atlas/ 
*** satellite maps http://dev.geosprocket.com/d3/sat/
** Jerome Cukier's blog : communicating with data http://www.jeromecukier.net/
** twitter graph viz : egyptian revolution  http://datavisualization.ch/showcases/egyptian-revolution/ http://www.kovasboguta.com/1/post/2011/02/first-post.html
** vizu sparse matrices http://www.cise.ufl.edu/~davis/matrices.html
http://www2.research.att.com/~yifanhu/software.html
** Great contributions to visualization 
*** First graph http://en.wikipedia.org/wiki/William_Playfair
*** example inspired by E. Marley train schedule http://www.c82.net/posts.php?id=66
*** A Tour through the Visualization Zoo http://queue.acm.org/detail.cfm?id=1805128
*** http://www.nytimes.com/interactive/2012/11/02/us/politics/paths-to-the-white-house.html
*** Out of Sight, Out of Mind. http://drones.pitchinteractive.com/
*** Salary vs. Performance http://fathom.info/salaryper
