toread.html

<div id="outline-container-39-12-5" class="outline-4">
<h4 id="sec-39-12-5">Geospatial Education Portfolio @ Penn State University <a href="http://www.worldcampus.psu.edu/gep?cm_mmc=Geospatial-Ed+12-13-_-MOOC-_-Online:Banner:Other-_-GEP+Tracking+URL+(PEN43102)">http://www.worldcampus.psu.edu/gep?cm_mmc=Geospatial-Ed+12-13-_-MOOC-_-Online:Banner:Other-_-GEP+Tracking+URL+(PEN43102)</a></h4>
<div class="outline-text-4" id="text-39-12-5">

</div>

</div>

<div id="outline-container-39-12-6" class="outline-4">
<h4 id="sec-39-12-6">US healthy map <a href="http://www.washingtonpost.com/wp-srv/special/health/us-life-expectancies/">http://www.washingtonpost.com/wp-srv/special/health/us-life-expectancies/</a></h4>
<div class="outline-text-4" id="text-39-12-6">

</div>

</div>

<div id="outline-container-39-12-7" class="outline-4">
<h4 id="sec-39-12-7">Compare Urban Life Around the Globe With New Side-by-Side City Maps <a href="http://www.wired.com/wiredscience/2013/07/urban-observatory/">http://www.wired.com/wiredscience/2013/07/urban-observatory/</a></h4>
<div class="outline-text-4" id="text-39-12-7">

</div>

</div>

<div id="outline-container-39-12-8" class="outline-4">
<h4 id="sec-39-12-8">map blog from wired <a href="http://www.wired.com/wiredscience/maplab/">http://www.wired.com/wiredscience/maplab/</a></h4>
<div class="outline-text-4" id="text-39-12-8">

</div>

</div>

<div id="outline-container-39-12-9" class="outline-4">
<h4 id="sec-39-12-9">heat map example by yelp <a href="http://flowingdata.com/2013/07/02/yelp-maps-words-used-in-reviews/">http://flowingdata.com/2013/07/02/yelp-maps-words-used-in-reviews/</a></h4>
<div class="outline-text-4" id="text-39-12-9">

</div>

</div>

<div id="outline-container-39-12-10" class="outline-4">
<h4 id="sec-39-12-10">other heat map example <a href="http://datadrivenjournalism.net/featured_projects/no_time_for_anger_a_reportage_on_fukushima_two_years_after_the_triple_disas">http://datadrivenjournalism.net/featured_projects/no_time_for_anger_a_reportage_on_fukushima_two_years_after_the_triple_disas</a></h4>
<div class="outline-text-4" id="text-39-12-10">

</div>

</div>

<div id="outline-container-39-12-11" class="outline-4">
<h4 id="sec-39-12-11">Sattelite raster <a href="http://www.jasondavies.com/maps/raster/satellite/">http://www.jasondavies.com/maps/raster/satellite/</a></h4>
<div class="outline-text-4" id="text-39-12-11">

<p>But remember this started with vector tiles. And the vector tiles are
in the Mercator projection. It’s much harder to take Mercator tiles
and reproject them to a different projection because you don’t know
which tiles are visible.
</p>
<p>
Hard problems like this are Jason Davies’ bread and butter. Jason saw
the above examples and set out to determine which tiles would be
visible in an arbitrary projection. He then created the above visual
demonstration of his algorithm. The red tiles are the ones that are
visible, and as you zoom in and out, you can see it recalculate the
set of needed tiles instantly.
</p></div>

</div>

<div id="outline-container-39-12-12" class="outline-4">
<h4 id="sec-39-12-12">making the OpenStreetMap data accessible in tile format <a href="http://openstreetmap.us/~migurski/vector-datasource/">http://openstreetmap.us/~migurski/vector-datasource/</a></h4>
<div class="outline-text-4" id="text-39-12-12">

<p>explanation <a href="http://mike.teczno.com/notes/postgreslessness-mapnik-vectiles.html">http://mike.teczno.com/notes/postgreslessness-mapnik-vectiles.html</a>
</p></div>

</div>

<div id="outline-container-39-12-13" class="outline-4">
<h4 id="sec-39-12-13">cartodb <a href="http://developers.cartodb.com/">http://developers.cartodb.com/</a></h4>
<div class="outline-text-4" id="text-39-12-13">

</div>

</div>

<div id="outline-container-39-12-14" class="outline-4">
<h4 id="sec-39-12-14">How to Map Where You've Mapped in OpenStreetMap with tilemill <a href="http://www.mapbox.com/blog/how-to-map-contributions-openstreetmap/">http://www.mapbox.com/blog/how-to-map-contributions-openstreetmap/</a></h4>
<div class="outline-text-4" id="text-39-12-14">

</div>

</div>

<div id="outline-container-39-12-15" class="outline-4">
<h4 id="sec-39-12-15">data.stories on maps with Mike Migurski <a href="http://datastori.es/data-stories-20-maps-migurski/">http://datastori.es/data-stories-20-maps-migurski/</a></h4>
<div class="outline-text-4" id="text-39-12-15">

</div>

</div>

<div id="outline-container-39-12-16" class="outline-4">
<h4 id="sec-39-12-16">modestmaps js library for maps made by stamen team <a href="http://modestmaps.com/">http://modestmaps.com/</a></h4>
<div class="outline-text-4" id="text-39-12-16">

</div>

</div>

<div id="outline-container-39-12-17" class="outline-4">
<h4 id="sec-39-12-17">maps conf <a href="http://stateofthemap.us/">http://stateofthemap.us/</a></h4>
<div class="outline-text-4" id="text-39-12-17">

</div>

</div>

<div id="outline-container-39-12-18" class="outline-4">
<h4 id="sec-39-12-18">crimespotting <a href="http://oakland.crimespotting.org">http://oakland.crimespotting.org</a></h4>
<div class="outline-text-4" id="text-39-12-18">

</div>

</div>

<div id="outline-container-39-12-19" class="outline-4">
<h4 id="sec-39-12-19">Transforming the Places We Live With Open Data <a href="http://m.theatlanticcities.com/technology/2013/03/our-12-favorite-ideas-transforming-places-we-live-open-data/5083/">http://m.theatlanticcities.com/technology/2013/03/our-12-favorite-ideas-transforming-places-we-live-open-data/5083/</a></h4>
<div class="outline-text-4" id="text-39-12-19">

</div>

</div>

<div id="outline-container-39-12-20" class="outline-4">
<h4 id="sec-39-12-20">Twitter maps <a href="http://www.mapbox.com/labs/twitter-gnip/languages/">http://www.mapbox.com/labs/twitter-gnip/languages/</a></h4>
<div class="outline-text-4" id="text-39-12-20">

</div>

</div>

<div id="outline-container-39-12-21" class="outline-4">
<h4 id="sec-39-12-21">Stamen a design and technology studio in San Francisco maps and data visualization. The next most obvious thing. <a href="http://stamen.com/">http://stamen.com/</a></h4>
<div class="outline-text-4" id="text-39-12-21">

</div>

</div>

<div id="outline-container-39-12-22" class="outline-4">
<h4 id="sec-39-12-22">Stamen people <a href="http://ericrodenbeck.tumblr.com/">http://ericrodenbeck.tumblr.com/</a> <a href="http://content.stamen.com/">http://content.stamen.com/</a></h4>
<div class="outline-text-4" id="text-39-12-22">

</div>

</div>

<div id="outline-container-39-12-23" class="outline-4">
<h4 id="sec-39-12-23">Maps Layout form stamaen : burning maps <a href="http://content.stamen.com/announcing_burningmap">http://content.stamen.com/announcing_burningmap</a></h4>
<div class="outline-text-4" id="text-39-12-23">

<p>toner maps <a href="https://github.com/Citytracking/toner">https://github.com/Citytracking/toner</a>
watercolor <a href="http://maps.stamen.com/#watercolor/12/37.7706/-122.3782">http://maps.stamen.com/#watercolor/12/37.7706/-122.3782</a>
</p></div>

</div>

<div id="outline-container-39-12-24" class="outline-4">
<h4 id="sec-39-12-24">Maps Applications <a href="http://fieldpapers.org/">http://fieldpapers.org/</a> <a href="http://www.dotspotting.org/faq">http://www.dotspotting.org/faq</a> <a href="http://citytracking.org/">http://citytracking.org/</a></h4>
<div class="outline-text-4" id="text-39-12-24">

</div>

</div>

<div id="outline-container-39-12-25" class="outline-4">
<h4 id="sec-39-12-25">help maps to be better <a href="http://walking-papers.org/">http://walking-papers.org/</a> by Michal Migurski <a href="http://mike.teczno.com/">http://mike.teczno.com/</a></h4>
<div class="outline-text-4" id="text-39-12-25">

</div>

</div>

<div id="outline-container-39-12-26" class="outline-4">
<h4 id="sec-39-12-26">Convert Address to long,lat <a href="http://www.gpsvisualizer.com/geocoder/">http://www.gpsvisualizer.com/geocoder/</a></h4>
<div class="outline-text-4" id="text-39-12-26">

</div>

</div>

<div id="outline-container-39-12-27" class="outline-4">
<h4 id="sec-39-12-27">OpenStreetMap's new iD editor <a href="http://www.mapbox.com/blog/new-map-editor-launches-openstreetmap/">http://www.mapbox.com/blog/new-map-editor-launches-openstreetmap/</a></h4>
<div class="outline-text-4" id="text-39-12-27">

</div>

</div>

<div id="outline-container-39-12-28" class="outline-4">
<h4 id="sec-39-12-28">satellite maps explained by MapBox <a href="http://www.wired.com/design/2013/05/a-cloudless-atlas/">http://www.wired.com/design/2013/05/a-cloudless-atlas/</a></h4>
<div class="outline-text-4" id="text-39-12-28">

</div>

</div>

<div id="outline-container-39-12-29" class="outline-4">
<h4 id="sec-39-12-29">satellite maps <a href="http://dev.geosprocket.com/d3/sat/">http://dev.geosprocket.com/d3/sat/</a></h4>
<div class="outline-text-4" id="text-39-12-29">

</div>
</div>

</div>

<div id="outline-container-39-13" class="outline-3">
<h3 id="sec-39-13">Jerome Cukier's blog : communicating with data <a href="http://www.jeromecukier.net/">http://www.jeromecukier.net/</a></h3>
<div class="outline-text-3" id="text-39-13">

</div>

</div>

<div id="outline-container-39-14" class="outline-3">
<h3 id="sec-39-14">twitter graph viz : egyptian revolution  <a href="http://datavisualization.ch/showcases/egyptian-revolution/">http://datavisualization.ch/showcases/egyptian-revolution/</a> <a href="http://www.kovasboguta.com/1/post/2011/02/first-post.html">http://www.kovasboguta.com/1/post/2011/02/first-post.html</a></h3>
<div class="outline-text-3" id="text-39-14">

</div>

</div>

<div id="outline-container-39-15" class="outline-3">
<h3 id="sec-39-15">vizu sparse matrices <a href="http://www.cise.ufl.edu/~davis/matrices.html">http://www.cise.ufl.edu/~davis/matrices.html</a></h3>
<div class="outline-text-3" id="text-39-15">

<p><a href="http://www2.research.att.com/~yifanhu/software.html">http://www2.research.att.com/~yifanhu/software.html</a>
</p></div>

</div>

<div id="outline-container-39-16" class="outline-3">
<h3 id="sec-39-16">Great contributions to visualization</h3>
<div class="outline-text-3" id="text-39-16">


</div>

<div id="outline-container-39-16-1" class="outline-4">
<h4 id="sec-39-16-1">First graph <a href="http://en.wikipedia.org/wiki/William_Playfair">http://en.wikipedia.org/wiki/William_Playfair</a></h4>
<div class="outline-text-4" id="text-39-16-1">

</div>

</div>

<div id="outline-container-39-16-2" class="outline-4">
<h4 id="sec-39-16-2">example inspired by E. Marley train schedule <a href="http://www.c82.net/posts.php?id=66">http://www.c82.net/posts.php?id=66</a></h4>
<div class="outline-text-4" id="text-39-16-2">

</div>

</div>

<div id="outline-container-39-16-3" class="outline-4">
<h4 id="sec-39-16-3">A Tour through the Visualization Zoo <a href="http://queue.acm.org/detail.cfm?id=1805128">http://queue.acm.org/detail.cfm?id=1805128</a></h4>
<div class="outline-text-4" id="text-39-16-3">

</div>

</div>

<div id="outline-container-39-16-4" class="outline-4">
<h4 id="sec-39-16-4"><a href="http://www.nytimes.com/interactive/2012/11/02/us/politics/paths-to-the-white-house.html">http://www.nytimes.com/interactive/2012/11/02/us/politics/paths-to-the-white-house.html</a></h4>
<div class="outline-text-4" id="text-39-16-4">

</div>

</div>

<div id="outline-container-39-16-5" class="outline-4">
<h4 id="sec-39-16-5">Out of Sight, Out of Mind. <a href="http://drones.pitchinteractive.com/">http://drones.pitchinteractive.com/</a></h4>
<div class="outline-text-4" id="text-39-16-5">

</div>

</div>

<div id="outline-container-39-16-6" class="outline-4">
<h4 id="sec-39-16-6">Salary vs. Performance <a href="http://fathom.info/salaryper">http://fathom.info/salaryper</a></h4>
<div class="outline-text-4" id="text-39-16-6">

</div>

</div>
