toread.org
*** exploratory graphs http://www.theglobeandmail.com/news/world/gun-control-in-america-a-state-by-state-breakdown/article6465107/
*** most commont words in corpus http://similardiversity.net/project/
*** El Patrón de los Números Primos https://www.jasondavies.com/primos/
*** wind map http://hint.fm/wind/
** http://www.evolutionoftheweb.com/
** the prefuse visualization toolkit http://prefuse.org/
** Brett Victor videos http://worrydream.com/May2013/
** NBA stats vizu http://www.nytimes.com/interactive/2012/06/11/sports/basketball/nba-shot-analysis.html?ref=sports&_r=0
@wardnyt
Sports Graphics Editor http://nytimes.com
Matthew Ericson
@mericson
Deputy Graphics Director at The New York Times
New York, NY · ericson.net
Jeremy White
@blueshirt
Graphics editor for The New York Times, while also pursuing a PhD in
geography with an emphasis on interactive cartography
New York City · blueshirt.com
** INEQUALITY AND NEW YORK’S SUBWAY http://www.newyorker.com/sandbox/business/subway.html http://dangrover.github.io/sf-transit-inequality/
** The Art of Data Visualization by Edward Tufle  http://datascientistinsights.com/2013/05/10/the-art-of-data-visualization/
http://www.openculture.com/2013/05/the_art_of_data_visualization_.html
Data Visualization History goes together with Science history ( Maps, Galileo ...)
** top 20 vizu tools http://www.netmagazine.com/features/top-20-data-visualisation-tools
** matplotlib examples http://matplotlib.org/xkcd/gallery.html
** essential feature for visual data analysis http://strata.oreilly.com/2013/05/11-essential-features-that-visual-analysis-tools-should-have.html
** Creating a hexagonal cartogram by Ralph Straumann http://www.ralphstraumann.ch/blog/2013/05/creating-a-hexagonal-cartogram/
** A (personal) blog of data sketches from the New York Times Graphics Department http://chartsnthings.tumblr.com/
** Transit Patterns @schemadesign http://visualizing.org/galleries/big-data-week-2013
** How to make a sparktweet http://zachholman.com/spark/ http://quantifiedself.com/2013/04/how-to-make-a-sparktweet/
** Visualize big graph data by mathieu-bastian http://de.slideshare.net/mathieu-bastian/visualize-big-graph-data
** Viz example : Location of Every Photo From the InternationalSpaceStation  http://natronics.github.io/ISS-photo-locations/
source viz in python cairo https://github.com/natronics/ISS-photo-locations/
** Vis for riemann https://github.com/TouchType/Friedrich
** Bigdata vis in R https://github.com/hadley/bigvis
http://blog.revolutionanalytics.com/2013/04/extending-revoscaler-for-mining-big-data.html
http://blog.revolutionanalytics.com/2013/04/visualize-large-data-sets-with-the-bigvis-package.html
** Vega is a visualization grammar, a declarative format for creating, saving and sharing visualization designs. https://github.com/trifacta/vega/wiki
** visu example http://flowingdata.com/2013/04/03/how-a-cab-driver-makes-money/
** Nathan Yau Data Points Visualization that Means Something http://flowingdata.com/book/
** Functional Art : An introduction to information graphics and visualization by Alberto Cairo fhttp://www.thefunctionalart.com/
 http://www.peachpit.com/store/functional-art-an-introduction-to-information-graphics-9780321834737
** github challenge https://github.com/blog/1450-the-github-data-challenge-ii
** Languages usage in github http://langpop.corger.nl/
** regression research design http://www.edwardtufte.com/bboard/q-and-a-fetch-msg?msg_id=0003uc
http://www.edwardtufte.com/tufte/dapp/
** processing
*** http://natureofcode.com/ http://vimeo.com/channels/natureofcode/
*** in quil https://github.com/mudphone/natureofclojure
*** processing https://www.youtube.com/watch?v=eBV14-3LT-g&feature=youtube_gdata_player
** javascript
*** http://gnuplot.respawned.com/ gnuplot in JS
*** https://github.com/mbostock/topojson https://github.com/mbostock/topojson/wiki
*** A streaming parser for the ESRI Shapefile spatial data format https://github.com/mbostock/shapefile
