toread.html

<div id="outline-container-39-16-7" class="outline-4">
<h4 id="sec-39-16-7">exploratory graphs <a href="http://www.theglobeandmail.com/news/world/gun-control-in-america-a-state-by-state-breakdown/article6465107/">http://www.theglobeandmail.com/news/world/gun-control-in-america-a-state-by-state-breakdown/article6465107/</a></h4>
<div class="outline-text-4" id="text-39-16-7">

</div>

</div>

<div id="outline-container-39-16-8" class="outline-4">
<h4 id="sec-39-16-8">most commont words in corpus <a href="http://similardiversity.net/project/">http://similardiversity.net/project/</a></h4>
<div class="outline-text-4" id="text-39-16-8">

</div>

</div>

<div id="outline-container-39-16-9" class="outline-4">
<h4 id="sec-39-16-9">El Patrón de los Números Primos <a href="https://www.jasondavies.com/primos/">https://www.jasondavies.com/primos/</a></h4>
<div class="outline-text-4" id="text-39-16-9">

</div>

</div>

<div id="outline-container-39-16-10" class="outline-4">
<h4 id="sec-39-16-10">wind map <a href="http://hint.fm/wind/">http://hint.fm/wind/</a></h4>
<div class="outline-text-4" id="text-39-16-10">

</div>
</div>

</div>

<div id="outline-container-39-17" class="outline-3">
<h3 id="sec-39-17"><a href="http://www.evolutionoftheweb.com/">http://www.evolutionoftheweb.com/</a></h3>
<div class="outline-text-3" id="text-39-17">

</div>

</div>

<div id="outline-container-39-18" class="outline-3">
<h3 id="sec-39-18">the prefuse visualization toolkit <a href="http://prefuse.org/">http://prefuse.org/</a></h3>
<div class="outline-text-3" id="text-39-18">

</div>

</div>

<div id="outline-container-39-19" class="outline-3">
<h3 id="sec-39-19">Brett Victor videos <a href="http://worrydream.com/May2013/">http://worrydream.com/May2013/</a></h3>
<div class="outline-text-3" id="text-39-19">

</div>

</div>

<div id="outline-container-39-20" class="outline-3">
<h3 id="sec-39-20">NBA stats vizu <a href="http://www.nytimes.com/interactive/2012/06/11/sports/basketball/nba-shot-analysis.html?ref=sports&amp;_r=0">http://www.nytimes.com/interactive/2012/06/11/sports/basketball/nba-shot-analysis.html?ref=sports&amp;_r=0</a></h3>
<div class="outline-text-3" id="text-39-20">

<p>@wardnyt
Sports Graphics Editor <a href="http://nytimes.com">http://nytimes.com</a>
Matthew Ericson
@mericson
Deputy Graphics Director at The New York Times
New York, NY · ericson.net
Jeremy White
@blueshirt
Graphics editor for The New York Times, while also pursuing a PhD in
geography with an emphasis on interactive cartography
New York City · blueshirt.com
</p></div>

</div>

<div id="outline-container-39-21" class="outline-3">
<h3 id="sec-39-21">INEQUALITY AND NEW YORK’S SUBWAY <a href="http://www.newyorker.com/sandbox/business/subway.html">http://www.newyorker.com/sandbox/business/subway.html</a> <a href="http://dangrover.github.io/sf-transit-inequality/">http://dangrover.github.io/sf-transit-inequality/</a></h3>
<div class="outline-text-3" id="text-39-21">

</div>

</div>

<div id="outline-container-39-22" class="outline-3">
<h3 id="sec-39-22">The Art of Data Visualization by Edward Tufle  <a href="http://datascientistinsights.com/2013/05/10/the-art-of-data-visualization/">http://datascientistinsights.com/2013/05/10/the-art-of-data-visualization/</a></h3>
<div class="outline-text-3" id="text-39-22">

<p><a href="http://www.openculture.com/2013/05/the_art_of_data_visualization_.html">http://www.openculture.com/2013/05/the_art_of_data_visualization_.html</a>
Data Visualization History goes together with Science history ( Maps, Galileo &hellip;)
</p></div>

</div>

<div id="outline-container-39-23" class="outline-3">
<h3 id="sec-39-23">top 20 vizu tools <a href="http://www.netmagazine.com/features/top-20-data-visualisation-tools">http://www.netmagazine.com/features/top-20-data-visualisation-tools</a></h3>
<div class="outline-text-3" id="text-39-23">

</div>

</div>

<div id="outline-container-39-24" class="outline-3">
<h3 id="sec-39-24">matplotlib examples <a href="http://matplotlib.org/xkcd/gallery.html">http://matplotlib.org/xkcd/gallery.html</a></h3>
<div class="outline-text-3" id="text-39-24">

</div>

</div>

<div id="outline-container-39-25" class="outline-3">
<h3 id="sec-39-25">essential feature for visual data analysis <a href="http://strata.oreilly.com/2013/05/11-essential-features-that-visual-analysis-tools-should-have.html">http://strata.oreilly.com/2013/05/11-essential-features-that-visual-analysis-tools-should-have.html</a></h3>
<div class="outline-text-3" id="text-39-25">

</div>

</div>

<div id="outline-container-39-26" class="outline-3">
<h3 id="sec-39-26">Creating a hexagonal cartogram by Ralph Straumann <a href="http://www.ralphstraumann.ch/blog/2013/05/creating-a-hexagonal-cartogram/">http://www.ralphstraumann.ch/blog/2013/05/creating-a-hexagonal-cartogram/</a></h3>
<div class="outline-text-3" id="text-39-26">

</div>

</div>

<div id="outline-container-39-27" class="outline-3">
<h3 id="sec-39-27">A (personal) blog of data sketches from the New York Times Graphics Department <a href="http://chartsnthings.tumblr.com/">http://chartsnthings.tumblr.com/</a></h3>
<div class="outline-text-3" id="text-39-27">

</div>

</div>

<div id="outline-container-39-28" class="outline-3">
<h3 id="sec-39-28">Transit Patterns @schemadesign <a href="http://visualizing.org/galleries/big-data-week-2013">http://visualizing.org/galleries/big-data-week-2013</a></h3>
<div class="outline-text-3" id="text-39-28">

</div>

</div>

<div id="outline-container-39-29" class="outline-3">
<h3 id="sec-39-29">How to make a sparktweet <a href="http://zachholman.com/spark/">http://zachholman.com/spark/</a> <a href="http://quantifiedself.com/2013/04/how-to-make-a-sparktweet/">http://quantifiedself.com/2013/04/how-to-make-a-sparktweet/</a></h3>
<div class="outline-text-3" id="text-39-29">

</div>

</div>

<div id="outline-container-39-30" class="outline-3">
<h3 id="sec-39-30">Visualize big graph data by mathieu-bastian <a href="http://de.slideshare.net/mathieu-bastian/visualize-big-graph-data">http://de.slideshare.net/mathieu-bastian/visualize-big-graph-data</a></h3>
<div class="outline-text-3" id="text-39-30">

</div>

</div>

<div id="outline-container-39-31" class="outline-3">
<h3 id="sec-39-31">Viz example : Location of Every Photo From the InternationalSpaceStation  <a href="http://natronics.github.io/ISS-photo-locations/">http://natronics.github.io/ISS-photo-locations/</a></h3>
<div class="outline-text-3" id="text-39-31">

<p>source viz in python cairo <a href="https://github.com/natronics/ISS-photo-locations/">https://github.com/natronics/ISS-photo-locations/</a>
</p></div>

</div>

<div id="outline-container-39-32" class="outline-3">
<h3 id="sec-39-32">Vis for riemann <a href="https://github.com/TouchType/Friedrich">https://github.com/TouchType/Friedrich</a></h3>
<div class="outline-text-3" id="text-39-32">

</div>

</div>

<div id="outline-container-39-33" class="outline-3">
<h3 id="sec-39-33">Bigdata vis in R <a href="https://github.com/hadley/bigvis">https://github.com/hadley/bigvis</a></h3>
<div class="outline-text-3" id="text-39-33">

<p><a href="http://blog.revolutionanalytics.com/2013/04/extending-revoscaler-for-mining-big-data.html">http://blog.revolutionanalytics.com/2013/04/extending-revoscaler-for-mining-big-data.html</a>
<a href="http://blog.revolutionanalytics.com/2013/04/visualize-large-data-sets-with-the-bigvis-package.html">http://blog.revolutionanalytics.com/2013/04/visualize-large-data-sets-with-the-bigvis-package.html</a>
</p></div>

</div>

<div id="outline-container-39-34" class="outline-3">
<h3 id="sec-39-34">Vega is a visualization grammar, a declarative format for creating, saving and sharing visualization designs. <a href="https://github.com/trifacta/vega/wiki">https://github.com/trifacta/vega/wiki</a></h3>
<div class="outline-text-3" id="text-39-34">

</div>

</div>

<div id="outline-container-39-35" class="outline-3">
<h3 id="sec-39-35">visu example <a href="http://flowingdata.com/2013/04/03/how-a-cab-driver-makes-money/">http://flowingdata.com/2013/04/03/how-a-cab-driver-makes-money/</a></h3>
<div class="outline-text-3" id="text-39-35">

</div>

</div>

<div id="outline-container-39-36" class="outline-3">
<h3 id="sec-39-36">Nathan Yau Data Points Visualization that Means Something <a href="http://flowingdata.com/book/">http://flowingdata.com/book/</a></h3>
<div class="outline-text-3" id="text-39-36">

</div>

</div>

<div id="outline-container-39-37" class="outline-3">
<h3 id="sec-39-37">Functional Art : An introduction to information graphics and visualization by Alberto Cairo fhttp://www.thefunctionalart.com/</h3>
<div class="outline-text-3" id="text-39-37">

<p> <a href="http://www.peachpit.com/store/functional-art-an-introduction-to-information-graphics-9780321834737">http://www.peachpit.com/store/functional-art-an-introduction-to-information-graphics-9780321834737</a>
</p></div>

</div>

<div id="outline-container-39-38" class="outline-3">
<h3 id="sec-39-38">github challenge <a href="https://github.com/blog/1450-the-github-data-challenge-ii">https://github.com/blog/1450-the-github-data-challenge-ii</a></h3>
<div class="outline-text-3" id="text-39-38">

</div>

</div>

<div id="outline-container-39-39" class="outline-3">
<h3 id="sec-39-39">Languages usage in github <a href="http://langpop.corger.nl/">http://langpop.corger.nl/</a></h3>
<div class="outline-text-3" id="text-39-39">

</div>

</div>

<div id="outline-container-39-40" class="outline-3">
<h3 id="sec-39-40">regression research design <a href="http://www.edwardtufte.com/bboard/q-and-a-fetch-msg?msg_id=0003uc">http://www.edwardtufte.com/bboard/q-and-a-fetch-msg?msg_id=0003uc</a></h3>
<div class="outline-text-3" id="text-39-40">

<p><a href="http://www.edwardtufte.com/tufte/dapp/">http://www.edwardtufte.com/tufte/dapp/</a>
</p></div>

</div>

<div id="outline-container-39-41" class="outline-3">
<h3 id="sec-39-41">processing</h3>
<div class="outline-text-3" id="text-39-41">


</div>

<div id="outline-container-39-41-1" class="outline-4">
<h4 id="sec-39-41-1"><a href="http://natureofcode.com/">http://natureofcode.com/</a> <a href="http://vimeo.com/channels/natureofcode/">http://vimeo.com/channels/natureofcode/</a></h4>
<div class="outline-text-4" id="text-39-41-1">

</div>

</div>

<div id="outline-container-39-41-2" class="outline-4">
<h4 id="sec-39-41-2">in quil <a href="https://github.com/mudphone/natureofclojure">https://github.com/mudphone/natureofclojure</a></h4>
<div class="outline-text-4" id="text-39-41-2">

</div>

</div>

<div id="outline-container-39-41-3" class="outline-4">
<h4 id="sec-39-41-3">processing <a href="https://www.youtube.com/watch?v=eBV14-3LT-g&amp;feature=youtube_gdata_player">https://www.youtube.com/watch?v=eBV14-3LT-g&amp;feature=youtube_gdata_player</a></h4>
<div class="outline-text-4" id="text-39-41-3">

</div>
</div>

</div>

<div id="outline-container-39-42" class="outline-3">
<h3 id="sec-39-42">javascript</h3>
<div class="outline-text-3" id="text-39-42">


</div>

<div id="outline-container-39-42-1" class="outline-4">
<h4 id="sec-39-42-1"><a href="http://gnuplot.respawned.com/">http://gnuplot.respawned.com/</a> gnuplot in JS</h4>
<div class="outline-text-4" id="text-39-42-1">

</div>

</div>

<div id="outline-container-39-42-2" class="outline-4">
<h4 id="sec-39-42-2"><a href="https://github.com/mbostock/topojson">https://github.com/mbostock/topojson</a> <a href="https://github.com/mbostock/topojson/wiki">https://github.com/mbostock/topojson/wiki</a></h4>
<div class="outline-text-4" id="text-39-42-2">

</div>

</div>

<div id="outline-container-39-42-3" class="outline-4">
<h4 id="sec-39-42-3">A streaming parser for the ESRI Shapefile spatial data format <a href="https://github.com/mbostock/shapefile">https://github.com/mbostock/shapefile</a></h4>
<div class="outline-text-4" id="text-39-42-3">

</div>

</div>
