toread.org
*** The reference http://bost.ocks.org/mike/
*** simple console for learning and experimenting with d3.js data nesting.  http://bl.ocks.org/d/4748131/
** D3
*** Climbing the d3.js Visualisation Stack : rCharts cubism ... http://schoolofdata.org/2013/08/12/climbing-the-d3-js-visualisation-stack/
*** D3 gallery with description http://visualizing.org/galleries/made-d3js
*** UTM zones with D3.js http://bl.ocks.org/turban/5866872
*** plotting the sensors in my Android phone with d3.js and three.js http://enja.org/2012/12/08/plotting-the-sensors-in-my-android-phone-with-d3-js-and-three-js/
*** http://www.d3noob.org/
*** Margin convention http://bl.ocks.org/mbostock/3019563
*** vega clickme http://timelyportfolio.blogspot.ch/2013/04/d3-lifeline-from-vega-and-clickme.html
*** Binify + topoJSON + D3 = How to create awesome binned hexagon maps  http://mechanicalscribe.com/notes/binify-d3-topojson-tutorial/
*** How selection works http://bost.ocks.org/mike/selection/
*** online book "Interactive Data Visualization for the Web" http://ofps.oreilly.com/titles/9781449339739/
** c2 http://www.infoq.com/presentations/Visual-Interfaces
** Handbook of Graph Drawing and Visualization , Roberto Tamassia http://cs.brown.edu/~rt/gdhandbook/
** finance visu example http://make.opendata.ch/forum/discussion/comment/167
** topoJSON https://github.com/mbostock/us-atlas http://bost.ocks.org/mike/map/
install gdal to be able to convert shape file into GeoJSON :
~/dev/misc/gdal-1.9.2/apps/ogr2ogr  -f GeoJSON   -where "iso_a2 = 'CH' AND SCALERANK < 8"   ch_places.json   ~/tmp/ne_10m/ne_10m_populated_places.shp
to get shapefiles : http://gadm.org/download
** http://vis4.net/blog/ kartograph http://kartograph.org/docs/kartograph.js/
* constraint programming
** CP for the impatient http://www.info.ucl.ac.be/~pschaus/cp4impatient/
** medium-level constraint modelling language http://www.minizinc.org/ student job : http://t.co/UntuMZ1sRG
** Scalar models http://yetanothermathprogrammingconsultant.blogspot.ch/2013/05/scalar-models.html
** wormsudoku  Alldiff with precedence http://cp-is-fun.blogspot.ch/2013/01/worm-sudoku-application-for-alldiff.html?spref=tw
** Pierre Schaus operational research in scala https://bitbucket.org/oscarlib/oscar/wiki/Home
** regular expression with crosswords  http://nedbatchelder.com/blog/201302/a_regular_crossword.html
** clojure constraint prog https://github.com/maxtuno/Clojure---JSR-331---Puzzles http://mx-clojure.blogspot.com/
** programmation par contraintes rencontres http://www.lsis.org/jfpc-jiaf2013/jfpc/
* core.logic
** core.logic queries + datomic https://groups.google.com/forum/#!topic/clojure/pVQndAvR8IQ
** nice usae case of featurec http://stackoverflow.com/questions/15821718/how-do-i-de-structure-a-map-in-core-logic
** featurec explained http://michaelrbernste.in/2013/05/12/featurec-and-maps.html
** thread to generate strings https://groups.google.com/forum/?fromgroups=#!topic/clojure/uJnr33vm8iI
**  http://minikanren.org/
** hangout minikaren https://www.youtube.com/watch?v=vRrgaibcTYs
** core.logic overrated http://programming-puzzler.blogspot.ch/2013/03/logic-programming-is-overrated.html
** partial-maps break the transitivity of unification https://groups.google.com/forum/?fromgroups=#!topic/clojure/6n7Y7D4Hbc4 http://dev.clojure.org/jira/browse/LOGIC-76
** countdown numbers game https://groups.google.com/forum/?fromgroups=#!topic/clojure/lT-eaWA2szU
** generate maps with specific constraints http://tsdh.wordpress.com/2012/01/06/using-clojures-core-logic-with-custom-data-structures/
http://objectcommando.com/blog/2011/11/04/the-magical-island-of-kanren-core-logic-intro-part-1/
datalog for lucene query https://groups.google.com/forum/?fromgroups=#!topic/clojure/_M73qeHNFe8 https://gist.github.com/3060305
** future dev works https://github.com/clojure/core.logic/wiki/Development
** Nominal Logic Programming http://swannodette.github.com/Nominal%20Logic/2013/02/08/the-simply-typed-lambda-calculus-in-20-lines-redux/
** persistent database in core.logic https://github.com/threatgrid/pldb
** http://de.slideshare.net/stevensreinout/qwalkeko-a-history-querying-tool
** Path expressions through graphlike structures for clojure using core.logic https://github.com/ReinoutStevens/damp.qwal
** Applicative logic meta-programming using Clojure's core.logic against an Eclipse workspace https://github.com/cderoove/damp.ekeko
* cascalog
