toread.html

<div id="outline-container-39-42-4" class="outline-4">
<h4 id="sec-39-42-4">The reference <a href="http://bost.ocks.org/mike/">http://bost.ocks.org/mike/</a></h4>
<div class="outline-text-4" id="text-39-42-4">

</div>

</div>

<div id="outline-container-39-42-5" class="outline-4">
<h4 id="sec-39-42-5">simple console for learning and experimenting with d3.js data nesting.  <a href="http://bl.ocks.org/d/4748131/">http://bl.ocks.org/d/4748131/</a></h4>
<div class="outline-text-4" id="text-39-42-5">

</div>
</div>

</div>

<div id="outline-container-39-43" class="outline-3">
<h3 id="sec-39-43">D3</h3>
<div class="outline-text-3" id="text-39-43">


</div>

<div id="outline-container-39-43-1" class="outline-4">
<h4 id="sec-39-43-1">Climbing the d3.js Visualisation Stack : rCharts cubism &hellip; <a href="http://schoolofdata.org/2013/08/12/climbing-the-d3-js-visualisation-stack/">http://schoolofdata.org/2013/08/12/climbing-the-d3-js-visualisation-stack/</a></h4>
<div class="outline-text-4" id="text-39-43-1">

</div>

</div>

<div id="outline-container-39-43-2" class="outline-4">
<h4 id="sec-39-43-2">D3 gallery with description <a href="http://visualizing.org/galleries/made-d3js">http://visualizing.org/galleries/made-d3js</a></h4>
<div class="outline-text-4" id="text-39-43-2">

</div>

</div>

<div id="outline-container-39-43-3" class="outline-4">
<h4 id="sec-39-43-3">UTM zones with D3.js <a href="http://bl.ocks.org/turban/5866872">http://bl.ocks.org/turban/5866872</a></h4>
<div class="outline-text-4" id="text-39-43-3">

</div>

</div>

<div id="outline-container-39-43-4" class="outline-4">
<h4 id="sec-39-43-4">plotting the sensors in my Android phone with d3.js and three.js <a href="http://enja.org/2012/12/08/plotting-the-sensors-in-my-android-phone-with-d3-js-and-three-js/">http://enja.org/2012/12/08/plotting-the-sensors-in-my-android-phone-with-d3-js-and-three-js/</a></h4>
<div class="outline-text-4" id="text-39-43-4">

</div>

</div>

<div id="outline-container-39-43-5" class="outline-4">
<h4 id="sec-39-43-5"><a href="http://www.d3noob.org/">http://www.d3noob.org/</a></h4>
<div class="outline-text-4" id="text-39-43-5">

</div>

</div>

<div id="outline-container-39-43-6" class="outline-4">
<h4 id="sec-39-43-6">Margin convention <a href="http://bl.ocks.org/mbostock/3019563">http://bl.ocks.org/mbostock/3019563</a></h4>
<div class="outline-text-4" id="text-39-43-6">

</div>

</div>

<div id="outline-container-39-43-7" class="outline-4">
<h4 id="sec-39-43-7">vega clickme <a href="http://timelyportfolio.blogspot.ch/2013/04/d3-lifeline-from-vega-and-clickme.html">http://timelyportfolio.blogspot.ch/2013/04/d3-lifeline-from-vega-and-clickme.html</a></h4>
<div class="outline-text-4" id="text-39-43-7">

</div>

</div>

<div id="outline-container-39-43-8" class="outline-4">
<h4 id="sec-39-43-8">Binify + topoJSON + D3 = How to create awesome binned hexagon maps  <a href="http://mechanicalscribe.com/notes/binify-d3-topojson-tutorial/">http://mechanicalscribe.com/notes/binify-d3-topojson-tutorial/</a></h4>
<div class="outline-text-4" id="text-39-43-8">

</div>

</div>

<div id="outline-container-39-43-9" class="outline-4">
<h4 id="sec-39-43-9">How selection works <a href="http://bost.ocks.org/mike/selection/">http://bost.ocks.org/mike/selection/</a></h4>
<div class="outline-text-4" id="text-39-43-9">

</div>

</div>

<div id="outline-container-39-43-10" class="outline-4">
<h4 id="sec-39-43-10">online book "Interactive Data Visualization for the Web" <a href="http://ofps.oreilly.com/titles/9781449339739/">http://ofps.oreilly.com/titles/9781449339739/</a></h4>
<div class="outline-text-4" id="text-39-43-10">

</div>
</div>

</div>

<div id="outline-container-39-44" class="outline-3">
<h3 id="sec-39-44">c2 <a href="http://www.infoq.com/presentations/Visual-Interfaces">http://www.infoq.com/presentations/Visual-Interfaces</a></h3>
<div class="outline-text-3" id="text-39-44">

</div>

</div>

<div id="outline-container-39-45" class="outline-3">
<h3 id="sec-39-45">Handbook of Graph Drawing and Visualization , Roberto Tamassia <a href="http://cs.brown.edu/~rt/gdhandbook/">http://cs.brown.edu/~rt/gdhandbook/</a></h3>
<div class="outline-text-3" id="text-39-45">

</div>

</div>

<div id="outline-container-39-46" class="outline-3">
<h3 id="sec-39-46">finance visu example <a href="http://make.opendata.ch/forum/discussion/comment/167">http://make.opendata.ch/forum/discussion/comment/167</a></h3>
<div class="outline-text-3" id="text-39-46">

</div>

</div>

<div id="outline-container-39-47" class="outline-3">
<h3 id="sec-39-47">topoJSON <a href="https://github.com/mbostock/us-atlas">https://github.com/mbostock/us-atlas</a> <a href="http://bost.ocks.org/mike/map/">http://bost.ocks.org/mike/map/</a></h3>
<div class="outline-text-3" id="text-39-47">

<p>install gdal to be able to convert shape file into GeoJSON :
~/dev/misc/gdal-1.9.2/apps/ogr2ogr  -f GeoJSON   -where "iso<sub>a2</sub> = 'CH' AND SCALERANK &lt; 8"   ch<sub>places</sub>.json   ~/tmp/ne<sub>10m</sub>/ne<sub>10m</sub><sub>populated</sub><sub>places</sub>.shp
to get shapefiles : <a href="http://gadm.org/download">http://gadm.org/download</a>
</p></div>

</div>

<div id="outline-container-39-48" class="outline-3">
<h3 id="sec-39-48"><a href="http://vis4.net/blog/">http://vis4.net/blog/</a> kartograph <a href="http://kartograph.org/docs/kartograph.js/">http://kartograph.org/docs/kartograph.js/</a></h3>
<div class="outline-text-3" id="text-39-48">

</div>
</div>

</div>

<div id="outline-container-40" class="outline-2">
<h2 id="sec-40">core.logic</h2>
<div class="outline-text-2" id="text-40">


</div>

<div id="outline-container-40-1" class="outline-3">
<h3 id="sec-40-1">core.logic queries + datomic <a href="https://groups.google.com/forum/#!topic/clojure/pVQndAvR8IQ">https://groups.google.com/forum/#!topic/clojure/pVQndAvR8IQ</a></h3>
<div class="outline-text-3" id="text-40-1">

</div>

</div>

<div id="outline-container-40-2" class="outline-3">
<h3 id="sec-40-2">nice usae case of featurec <a href="http://stackoverflow.com/questions/15821718/how-do-i-de-structure-a-map-in-core-logic">http://stackoverflow.com/questions/15821718/how-do-i-de-structure-a-map-in-core-logic</a></h3>
<div class="outline-text-3" id="text-40-2">

</div>

</div>

<div id="outline-container-40-3" class="outline-3">
<h3 id="sec-40-3">featurec explained <a href="http://michaelrbernste.in/2013/05/12/featurec-and-maps.html">http://michaelrbernste.in/2013/05/12/featurec-and-maps.html</a></h3>
<div class="outline-text-3" id="text-40-3">

</div>

</div>

<div id="outline-container-40-4" class="outline-3">
<h3 id="sec-40-4">thread to generate strings <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/uJnr33vm8iI">https://groups.google.com/forum/?fromgroups=#!topic/clojure/uJnr33vm8iI</a></h3>
<div class="outline-text-3" id="text-40-4">

</div>

</div>

<div id="outline-container-40-5" class="outline-3">
<h3 id="sec-40-5"><a href="http://minikanren.org/">http://minikanren.org/</a></h3>
<div class="outline-text-3" id="text-40-5">

</div>

</div>

<div id="outline-container-40-6" class="outline-3">
<h3 id="sec-40-6">hangout minikaren <a href="https://www.youtube.com/watch?v=vRrgaibcTYs">https://www.youtube.com/watch?v=vRrgaibcTYs</a></h3>
<div class="outline-text-3" id="text-40-6">

</div>

</div>

<div id="outline-container-40-7" class="outline-3">
<h3 id="sec-40-7">core.logic overrated <a href="http://programming-puzzler.blogspot.ch/2013/03/logic-programming-is-overrated.html">http://programming-puzzler.blogspot.ch/2013/03/logic-programming-is-overrated.html</a></h3>
<div class="outline-text-3" id="text-40-7">

</div>

</div>

<div id="outline-container-40-8" class="outline-3">
<h3 id="sec-40-8">partial-maps break the transitivity of unification <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/6n7Y7D4Hbc4">https://groups.google.com/forum/?fromgroups=#!topic/clojure/6n7Y7D4Hbc4</a> <a href="http://dev.clojure.org/jira/browse/LOGIC-76">http://dev.clojure.org/jira/browse/LOGIC-76</a></h3>
<div class="outline-text-3" id="text-40-8">

</div>

</div>

<div id="outline-container-40-9" class="outline-3">
<h3 id="sec-40-9">countdown numbers game <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/lT-eaWA2szU">https://groups.google.com/forum/?fromgroups=#!topic/clojure/lT-eaWA2szU</a></h3>
<div class="outline-text-3" id="text-40-9">

</div>

</div>

<div id="outline-container-40-10" class="outline-3">
<h3 id="sec-40-10">generate maps with specific constraints <a href="http://tsdh.wordpress.com/2012/01/06/using-clojures-core-logic-with-custom-data-structures/">http://tsdh.wordpress.com/2012/01/06/using-clojures-core-logic-with-custom-data-structures/</a></h3>
<div class="outline-text-3" id="text-40-10">

<p><a href="http://objectcommando.com/blog/2011/11/04/the-magical-island-of-kanren-core-logic-intro-part-1/">http://objectcommando.com/blog/2011/11/04/the-magical-island-of-kanren-core-logic-intro-part-1/</a>
datalog for lucene query <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/_M73qeHNFe8">https://groups.google.com/forum/?fromgroups=#!topic/clojure/_M73qeHNFe8</a> <a href="https://gist.github.com/3060305">https://gist.github.com/3060305</a>
</p></div>

</div>

<div id="outline-container-40-11" class="outline-3">
<h3 id="sec-40-11">future dev works <a href="https://github.com/clojure/core.logic/wiki/Development">https://github.com/clojure/core.logic/wiki/Development</a></h3>
<div class="outline-text-3" id="text-40-11">

</div>

</div>

<div id="outline-container-40-12" class="outline-3">
<h3 id="sec-40-12">Nominal Logic Programming <a href="http://swannodette.github.com/Nominal Logic/2013/02/08/the-simply-typed-lambda-calculus-in-20-lines-redux/">http://swannodette.github.com/Nominal%20Logic/2013/02/08/the-simply-typed-lambda-calculus-in-20-lines-redux/</a></h3>
<div class="outline-text-3" id="text-40-12">

</div>

</div>

<div id="outline-container-40-13" class="outline-3">
<h3 id="sec-40-13">persistent database in core.logic <a href="https://github.com/threatgrid/pldb">https://github.com/threatgrid/pldb</a></h3>
<div class="outline-text-3" id="text-40-13">

</div>

</div>

<div id="outline-container-40-14" class="outline-3">
<h3 id="sec-40-14"><a href="http://de.slideshare.net/stevensreinout/qwalkeko-a-history-querying-tool">http://de.slideshare.net/stevensreinout/qwalkeko-a-history-querying-tool</a></h3>
<div class="outline-text-3" id="text-40-14">

</div>

</div>

<div id="outline-container-40-15" class="outline-3">
<h3 id="sec-40-15">Path expressions through graphlike structures for clojure using core.logic <a href="https://github.com/ReinoutStevens/damp.qwal">https://github.com/ReinoutStevens/damp.qwal</a></h3>
<div class="outline-text-3" id="text-40-15">

</div>

</div>

<div id="outline-container-40-16" class="outline-3">
<h3 id="sec-40-16">Applicative logic meta-programming using Clojure's core.logic against an Eclipse workspace <a href="https://github.com/cderoove/damp.ekeko">https://github.com/cderoove/damp.ekeko</a></h3>
<div class="outline-text-3" id="text-40-16">

</div>
</div>

</div>
