toread.org
** arrows https://github.com/rplevy/swiss-arrows to compare with new threading macros as-> some-> cond->
** [[https://groups.google.com/forum/?fromgroups=#!topic/clojure/pRla3_7vqvc][group-by proposition ]]
** use of var in ring apps explained https://groups.google.com/forum/?fromgroups=#!topic/clojure/tZpNp0rEBKQ
** fcts génériques and macros with cgrand https://groups.google.com/forum/?fromgroups=#!topic/clojure-fr/ZoDVW4urFRM
https://github.com/cgrand/parsley/blob/master/src/net/cgrand/parsley/tree.clj#L15
** memoize and concurrency in clj http://kotka.de/blog/2010/03/memoize_done_right.html
** keywordize
(into {} (for ...))
(defn keywordize-keys
  "Recursively transforms all map keys from strings to keywords."
  {:added "1.1"}
  [m]
  (let [f (fn [[k v]]] (if (string? k) [(keyword k) v] [k v]))]
    ;; only apply to maps
    (postwalk (fn [x] (if (map? x) (into {} (map f x)) x)) m))

** some clj patterns
*** Union
(set
  (mapcat #(...
    ...)

monadic bind in the set monad ?

(set (apply concat (for [...]
                               [...])))

(defn union-of [colls]
  (reduce into #{} colls))

*** zipmap
(into {}
      (map #(vector ...)))

fmap in the hash-map functor ?

*** remove empty?

(filter seq ...)
** load optional dependency
https://github.com/sonian/carica/commit/eae079f4bfd1a0d50a75b11cd0f23ca73ec81797
(require 'cheshire.core)
(apply (ns-resolve (symbol "cheshire.core") (symbol "parse-stream")) args)
** multimethod usage on config file
(memfn getPath) instead of #(.getPath %)
(defmulti load-config (comp second
                            (partial re-find #"\.([^..]*?)$")
                            (memfn getPath)))

(defmethod load-config "clj" [resource])
** load properties file
(into {} (doto (java.util.Properties.)
           (.load (-> (Thread/currentThread)
                      (.getContextClassLoader)
                      (.getResourceAsStream "log4j.properties")))))
** reduce + lazy seq : blow up ? https://groups.google.com/forum/?fromgroups=#!topic/clojure/0pcSxK9reSc
user> (defn test1 [coll] (reduce + coll))
#'user/test1
user> (test1 (take 10000000 (iterate inc 0)))
49999995000000
user>

Now if we do:

user> (defn test2 [coll] [(reduce + coll) (reduce + coll)])
#'user/test2
user> (test2 (take 10000000 (iterate inc 0)))
OutOfMemoryError Java heap space  [trace missing]

Clojure has a feature called locals clearing, which sets 'coll to nil before calling reduce in test1, because the compiler can prove it won't be used afterwards.
In test2, coll has to be retained, because reduce is called a second time on it.
 https://github.com/clojure/clojure/blob/master/src/jvm/clojure/lang/Compiler.java#L3458

** deep-merge-with http://clojuredocs.org/clojure_contrib/clojure.contrib.map-utils/deep-merge-with
Like merge-with, but merges maps recursively, applying the given fn
only when there's a non-map at a particular level.

(deepmerge + {:a {:b {:c 1 :d {:x 1 :y 2}} :e 3} :f 4}
{:a {:b {:c 2 :d {:z 9} :z 3} :e 100}})
-> {:a {:b {:z 3, :c 3, :d {:z 9, :x 1, :y 2}}, :e 103}, :f 4}
** core.reducers
*** Improving your Clojure code with core.reducers http://adambard.com/blog/clojure-reducers-for-mortals/
*** reducers by example http://ianrumford.github.io/blog/2013/08/25/some-trivial-examples-of-using-clojure-reducers/
*** reducers https://github.com/cgrand/berlin-profiling/blob/master/src/berlin_profiling/life.clj
http://clojure.com/blog/2012/05/15/anatomy-of-reducer.html
http://clj-me.cgrand.net/2013/02/11/from-lazy-seqs-to-reducers-and-back/
(defn reverse-conses
  ([s tail]
    (if (identical? (rest s) tail)
      s
      (reverse-conses s tail tail)))
  ([s from-tail to-tail]
    (loop [f s b to-tail]
      (if (identical? f from-tail)
        b
        (recur (rest f) (cons (first f) b))))))

(defn seq-seq [f s]
  (let [f1 (reduce #(cons %2 %1) nil
              (f (reify clojure.core.protocols.CollReduce
                   (coll-reduce [this f1 init]
                     f1))))]
    ((fn this [s]
       (lazy-seq
         (when-let [s (seq s)]
           (let [more (this (rest s))
                 x (f1 more (first s))]
             (if (reduced? x)
               (reverse-conses @x more nil)
               (reverse-conses x more)))))) s)))

(defmacro seq->> [s & forms]
  `(seq-seq (fn [n#] (->> n# ~@forms)) ~s))

(take 2 (seq->> (range) (r/map #(str (doto % prn))) (r/take 25)
(r/drop 5)))
** core.typed
*** Typed Clojure by Example http://nathanic.org/posts/2013/typed-clojure-tour/
** clojure.edn/read and clojure.edn/read-string http://clojuredocs.org/clojure_core/clojure.core/read
https://groups.google.com/forum/?fromgroups=#!topic/clojure/YBkUaIaRaow
* clj concurrency
** Pong Game Explained http://ragnard.github.io/2013/10/01/clojurecup-pong-async.html 
** core.async rationale by Rich Hickey http://clojure.com/blog/2013/06/28/clojure-core-async-channels.html
