toread.html

<div id="outline-container-45-8" class="outline-3">
<h3 id="sec-45-8">arrows <a href="https://github.com/rplevy/swiss-arrows">https://github.com/rplevy/swiss-arrows</a> to compare with new threading macros as-&gt; some-&gt; cond-&gt;</h3>
<div class="outline-text-3" id="text-45-8">

</div>

</div>

<div id="outline-container-45-9" class="outline-3">
<h3 id="sec-45-9"><a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/pRla3_7vqvc">group-by proposition </a></h3>
<div class="outline-text-3" id="text-45-9">

</div>

</div>

<div id="outline-container-45-10" class="outline-3">
<h3 id="sec-45-10">use of var in ring apps explained <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/tZpNp0rEBKQ">https://groups.google.com/forum/?fromgroups=#!topic/clojure/tZpNp0rEBKQ</a></h3>
<div class="outline-text-3" id="text-45-10">

</div>

</div>

<div id="outline-container-45-11" class="outline-3">
<h3 id="sec-45-11">fcts génériques and macros with cgrand <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure-fr/ZoDVW4urFRM">https://groups.google.com/forum/?fromgroups=#!topic/clojure-fr/ZoDVW4urFRM</a></h3>
<div class="outline-text-3" id="text-45-11">

<p><a href="https://github.com/cgrand/parsley/blob/master/src/net/cgrand/parsley/tree.clj#L15">https://github.com/cgrand/parsley/blob/master/src/net/cgrand/parsley/tree.clj#L15</a>
</p></div>

</div>

<div id="outline-container-45-12" class="outline-3">
<h3 id="sec-45-12">memoize and concurrency in clj <a href="http://kotka.de/blog/2010/03/memoize_done_right.html">http://kotka.de/blog/2010/03/memoize_done_right.html</a></h3>
<div class="outline-text-3" id="text-45-12">

</div>

</div>

<div id="outline-container-45-13" class="outline-3">
<h3 id="sec-45-13">keywordize</h3>
<div class="outline-text-3" id="text-45-13">

<p>(into {} (for &hellip;))
(defn keywordize-keys
  "Recursively transforms all map keys from strings to keywords."
  {:added "1.1"}
  [m]
  (let [f (fn <a href="#k-v">k v</a>] (if (string? k) [(keyword k) v] [k v]))]
    ;; only apply to maps
    (postwalk (fn [x] (if (map? x) (into {} (map f x)) x)) m))
</p>
</div>

</div>

<div id="outline-container-45-14" class="outline-3">
<h3 id="sec-45-14">some clj patterns</h3>
<div class="outline-text-3" id="text-45-14">


</div>

<div id="outline-container-45-14-1" class="outline-4">
<h4 id="sec-45-14-1">Union</h4>
<div class="outline-text-4" id="text-45-14-1">

<p>(set
  (mapcat #(&hellip;
    &hellip;)
</p>
<p>
monadic bind in the set monad ?
</p>
<p>
(set (apply concat (for [&hellip;]
                               [&hellip;])))
</p>
<p>
(defn union-of [colls]
  (reduce into #{} colls))
</p>
</div>

</div>

<div id="outline-container-45-14-2" class="outline-4">
<h4 id="sec-45-14-2">zipmap</h4>
<div class="outline-text-4" id="text-45-14-2">

<p>(into {}
      (map #(vector &hellip;)))
</p>
<p>
fmap in the hash-map functor ?
</p>
</div>

</div>

<div id="outline-container-45-14-3" class="outline-4">
<h4 id="sec-45-14-3">remove empty?</h4>
<div class="outline-text-4" id="text-45-14-3">


<p>
(filter seq &hellip;)
</p></div>
</div>

</div>

<div id="outline-container-45-15" class="outline-3">
<h3 id="sec-45-15">load optional dependency</h3>
<div class="outline-text-3" id="text-45-15">

<p><a href="https://github.com/sonian/carica/commit/eae079f4bfd1a0d50a75b11cd0f23ca73ec81797">https://github.com/sonian/carica/commit/eae079f4bfd1a0d50a75b11cd0f23ca73ec81797</a>
(require 'cheshire.core)
(apply (ns-resolve (symbol "cheshire.core") (symbol "parse-stream")) args)
</p></div>

</div>

<div id="outline-container-45-16" class="outline-3">
<h3 id="sec-45-16">multimethod usage on config file</h3>
<div class="outline-text-3" id="text-45-16">

<p>(memfn getPath) instead of #(.getPath %)
(defmulti load-config (comp second
                            (partial re-find #"\.([^..]*?)$")
                            (memfn getPath)))
</p>
<p>
(defmethod load-config "clj" [resource])
</p></div>

</div>

<div id="outline-container-45-17" class="outline-3">
<h3 id="sec-45-17">load properties file</h3>
<div class="outline-text-3" id="text-45-17">

<p>(into {} (doto (java.util.Properties.)
           (.load (-&gt; (Thread/currentThread)
                      (.getContextClassLoader)
                      (.getResourceAsStream "log4j.properties")))))
</p></div>

</div>

<div id="outline-container-45-18" class="outline-3">
<h3 id="sec-45-18">reduce + lazy seq : blow up ? <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/0pcSxK9reSc">https://groups.google.com/forum/?fromgroups=#!topic/clojure/0pcSxK9reSc</a></h3>
<div class="outline-text-3" id="text-45-18">

<p>user&gt; (defn test1 [coll] (reduce + coll))
user&gt; (test1 (take 10000000 (iterate inc 0)))
49999995000000
user&gt;
</p>
<p>
Now if we do:
</p>
<p>
user&gt; (defn test2 [coll] [(reduce + coll) (reduce + coll)])
user&gt; (test2 (take 10000000 (iterate inc 0)))
OutOfMemoryError Java heap space  [trace missing]
</p>
<p>
Clojure has a feature called locals clearing, which sets 'coll to nil before calling reduce in test1, because the compiler can prove it won't be used afterwards.
In test2, coll has to be retained, because reduce is called a second time on it.
 <a href="https://github.com/clojure/clojure/blob/master/src/jvm/clojure/lang/Compiler.java#L3458">https://github.com/clojure/clojure/blob/master/src/jvm/clojure/lang/Compiler.java#L3458</a>
</p>
</div>

</div>

<div id="outline-container-45-19" class="outline-3">
<h3 id="sec-45-19">deep-merge-with <a href="http://clojuredocs.org/clojure_contrib/clojure.contrib.map-utils/deep-merge-with">http://clojuredocs.org/clojure_contrib/clojure.contrib.map-utils/deep-merge-with</a></h3>
<div class="outline-text-3" id="text-45-19">

<p>Like merge-with, but merges maps recursively, applying the given fn
only when there's a non-map at a particular level.
</p>
<p>
(deepmerge + {:a {:b {:c 1 :d {:x 1 :y 2}} :e 3} :f 4}
{:a {:b {:c 2 :d {:z 9} :z 3} :e 100}})
-&gt; {:a {:b {:z 3, :c 3, :d {:z 9, :x 1, :y 2}}, :e 103}, :f 4}
</p></div>

</div>

<div id="outline-container-45-20" class="outline-3">
<h3 id="sec-45-20">reducers by example <a href="http://ianrumford.github.io/blog/2013/08/25/some-trivial-examples-of-using-clojure-reducers/">http://ianrumford.github.io/blog/2013/08/25/some-trivial-examples-of-using-clojure-reducers/</a></h3>
<div class="outline-text-3" id="text-45-20">

</div>

</div>

<div id="outline-container-45-21" class="outline-3">
<h3 id="sec-45-21">reducers <a href="https://github.com/cgrand/berlin-profiling/blob/master/src/berlin_profiling/life.clj">https://github.com/cgrand/berlin-profiling/blob/master/src/berlin_profiling/life.clj</a></h3>
<div class="outline-text-3" id="text-45-21">

<p><a href="http://clojure.com/blog/2012/05/15/anatomy-of-reducer.html">http://clojure.com/blog/2012/05/15/anatomy-of-reducer.html</a>
<a href="http://clj-me.cgrand.net/2013/02/11/from-lazy-seqs-to-reducers-and-back/">http://clj-me.cgrand.net/2013/02/11/from-lazy-seqs-to-reducers-and-back/</a>
(defn reverse-conses
  ([s tail]
    (if (identical? (rest s) tail)
      s
      (reverse-conses s tail tail)))
  ([s from-tail to-tail]
    (loop [f s b to-tail]
      (if (identical? f from-tail)
        b
        (recur (rest f) (cons (first f) b))))))
</p>
<p>
(defn seq-seq [f s]
  (let [f1 (reduce #(cons %2 %1) nil
              (f (reify clojure.core.protocols.CollReduce
                   (coll-reduce [this f1 init]
                     f1))))]
    ((fn this [s]
       (lazy-seq
         (when-let [s (seq s)]
           (let [more (this (rest s))
                 x (f1 more (first s))]
             (if (reduced? x)
               (reverse-conses @x more nil)
               (reverse-conses x more)))))) s)))
</p>
<p>
(defmacro seq-&gt;&gt; [s &amp; forms]
  `(seq-seq (fn [n#] (-&gt;&gt; n# ~@forms)) ~s))
</p>
<p>
(take 2 (seq-&gt;&gt; (range) (r/map #(str (doto % prn))) (r/take 25) (r/drop 5)))
</p></div>

</div>

<div id="outline-container-45-22" class="outline-3">
<h3 id="sec-45-22">clojure.edn/read and clojure.edn/read-string <a href="http://clojuredocs.org/clojure_core/clojure.core/read">http://clojuredocs.org/clojure_core/clojure.core/read</a></h3>
<div class="outline-text-3" id="text-45-22">

<p><a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/YBkUaIaRaow">https://groups.google.com/forum/?fromgroups=#!topic/clojure/YBkUaIaRaow</a>
</p></div>
</div>

</div>

<div id="outline-container-46" class="outline-2">
<h2 id="sec-46">clj concurrency</h2>
<div class="outline-text-2" id="text-46">


</div>

<div id="outline-container-46-1" class="outline-3">
<h3 id="sec-46-1">Pong Game Explained <a href="http://ragnard.github.io/2013/10/01/clojurecup-pong-async.html">http://ragnard.github.io/2013/10/01/clojurecup-pong-async.html</a></h3>
<div class="outline-text-3" id="text-46-1">

</div>

</div>

<div id="outline-container-46-2" class="outline-3">
<h3 id="sec-46-2">core.async rationale by Rich Hickey <a href="http://clojure.com/blog/2013/06/28/clojure-core-async-channels.html">http://clojure.com/blog/2013/06/28/clojure-core-async-channels.html</a></h3>
<div class="outline-text-3" id="text-46-2">

</div>

</div>
