toread.org
** promise future agent channels by tbc++ Timothy Baldrigde https://groups.google.com/forum/#!topic/clojure/e6Tg4wXLcug
promise - creates a object that can be deref'd. The result of the
promise can be delivered once, and deref-ing a undelivered will cause
the deref-ing thread to block. A single producer can give a single
value to multiple threads

future - just like a promise, but it the delivering code is given to
the future and the future will go off and execute that code in a
different thread. Single producer delivers a single value produced in
a undefined thread, to multiple consumers

agents - couples a unbounded queue of functions with a single mutable
value. Mutating that value is accomplished by enqueue'ing functions to
be executed against that mutable state. Multiple producers use
functions to modify a mutable ref. Can be deref-ed by may different
consumers

channels - allow multiple producers to provide data to multiple
consumers on a one-to-one basis. That is to say, a single value put
into a channel can only be taken by a single consumer. However,
multiple values can be inflight at a single time. This is all
delivered by a bounded queue (notice the difference with unbounded
agents). This allows for back-pressure, where slow producers can block
faster consumers. So perhaps the best way to think about channels is a
bounded mutable queue of promises

** What is a "state monad binding plan" (referring to code in core.async) https://groups.google.com/forum/#!searchin/clojure/core.async/clojure/soewFCS8dAI/kaJ09e_eA7gJ
** http://swannodette.github.io/2013/08/23/make-no-promises/
** In-depth article : CLOJURESCRIPT CORE.ASYNC DOTS GAME http://rigsomelight.com/2013/08/12/clojurescript-core-async-dots-game.html
** CSP is Responsive Design by David Nolen http://swannodette.github.io/2013/07/31/extracting-processes/
** The State Machines of core.async http://hueypetersen.com/posts/2013/08/02/the-state-machines-of-core-async/
** 100k independent go blocks all running at the same time  http://swannodette.github.io/2013/08/02/100000-processes/
** Hoare examples implemente with core.async https://github.com/nodename/async-plgd
** core.async examples in clojuscript http://swannodette.github.io/2013/07/12/communicating-sequential-processes/ https://github.com/swannodette/async-tests
** some games core.async examples http://tech.puredanger.com/2013/07/10/rps-core-async/ https://github.com/rkneufeld/rouge
** core.async: communicating termination https://groups.google.com/forum/#!topic/clojure/_KzEoq0XcHQ
** Dining Philosophers in core.async http://pepijndevos.nl/2013/07/11/dining-philosophers-in-coreasync.html
** Clojure, core.async and the Lisp Advantage http://www.leonardoborges.com/writings/2013/07/06/clojure-core-dot-async-lisp-advantage/
* clj image
** Image analysis with Clojure and OpenCV: A face detection example http://nils-blum-oeste.net/image-analysis-with-clojure-up-and-running-with-opencv/#.UafoMfH2kuk
** openCV wrapper http://nakkaya.com/2011/01/24/lane-detection-using-clojure-and-opencv/  http://nakkaya.com/vision.html
* Music
** overtone
*** https://github.com/ctford/whelmed 
*** Creating instruments with overtone by Joseph Wilk http://blog.josephwilk.net/clojure/creating-instruments-with-overtone.html
*** overtone http://lifeisagraph.com/2010/03/15/clojure-event-system.html
*** overtone stuff https://gist.github.com/rogerallen http://rogerallen.github.com/ using https://github.com/ctford/leipzig
*** music composition example in overtone https://soundcloud.com/toxi/rukanos-space-organ http://hg.postspectacular.com/resonate-2013
*** sam aaron demo : http://vimeo.com/60534305
** coursera class on music technology https://www.coursera.org/course/musictech
** Music books 
*** http://music.columbia.edu/cmc/MusicAndComputers/ 
*** Puckette: Theory and Techniques of Electronic Music. Online at: http://crca.ucsd.edu/~msp/techniques.htm
*** The Computer Music Tutorial  http://www.chegg.com/textbooks/the-computer-music-tutorial-1st-edition-9780262680820-0262680823?trackid=c8c3f95d&ii=1&om_ss=1
** Music in Python http://pyvideo.org/video/1769/music-theory-and-performance-analysis-with-sebast
* clj devops
** use leiningen for scala project scalding https://github.com/masverba/scalding-on-leiningen
* clj data computation
** Experimental combination of core.logic and core.matrix to allow reasoning with vectors / mathematical expressions https://github.com/clojure-numerics/expresso
