toread.html

<div id="outline-container-46-3" class="outline-3">
<h3 id="sec-46-3">promise future agent channels by tbc++ Timothy Baldrigde <a href="https://groups.google.com/forum/#!topic/clojure/e6Tg4wXLcug">https://groups.google.com/forum/#!topic/clojure/e6Tg4wXLcug</a></h3>
<div class="outline-text-3" id="text-46-3">

<p>promise - creates a object that can be deref'd. The result of the
promise can be delivered once, and deref-ing a undelivered will cause
the deref-ing thread to block. A single producer can give a single
value to multiple threads
</p>
<p>
future - just like a promise, but it the delivering code is given to
the future and the future will go off and execute that code in a
different thread. Single producer delivers a single value produced in
a undefined thread, to multiple consumers
</p>
<p>
agents - couples a unbounded queue of functions with a single mutable
value. Mutating that value is accomplished by enqueue'ing functions to
be executed against that mutable state. Multiple producers use
functions to modify a mutable ref. Can be deref-ed by may different
consumers
</p>
<p>
channels - allow multiple producers to provide data to multiple
consumers on a one-to-one basis. That is to say, a single value put
into a channel can only be taken by a single consumer. However,
multiple values can be inflight at a single time. This is all
delivered by a bounded queue (notice the difference with unbounded
agents). This allows for back-pressure, where slow producers can block
faster consumers. So perhaps the best way to think about channels is a
bounded mutable queue of promises
</p>
</div>

</div>

<div id="outline-container-46-4" class="outline-3">
<h3 id="sec-46-4">What is a "state monad binding plan" (referring to code in core.async) <a href="https://groups.google.com/forum/#!searchin/clojure/core.async/clojure/soewFCS8dAI/kaJ09e_eA7gJ">https://groups.google.com/forum/#!searchin/clojure/core.async/clojure/soewFCS8dAI/kaJ09e_eA7gJ</a></h3>
<div class="outline-text-3" id="text-46-4">

</div>

</div>

<div id="outline-container-46-5" class="outline-3">
<h3 id="sec-46-5"><a href="http://swannodette.github.io/2013/08/23/make-no-promises/">http://swannodette.github.io/2013/08/23/make-no-promises/</a></h3>
<div class="outline-text-3" id="text-46-5">

</div>

</div>

<div id="outline-container-46-6" class="outline-3">
<h3 id="sec-46-6">In-depth article : CLOJURESCRIPT CORE.ASYNC DOTS GAME <a href="http://rigsomelight.com/2013/08/12/clojurescript-core-async-dots-game.html">http://rigsomelight.com/2013/08/12/clojurescript-core-async-dots-game.html</a></h3>
<div class="outline-text-3" id="text-46-6">

</div>

</div>

<div id="outline-container-46-7" class="outline-3">
<h3 id="sec-46-7">CSP is Responsive Design by David Nolen <a href="http://swannodette.github.io/2013/07/31/extracting-processes/">http://swannodette.github.io/2013/07/31/extracting-processes/</a></h3>
<div class="outline-text-3" id="text-46-7">

</div>

</div>

<div id="outline-container-46-8" class="outline-3">
<h3 id="sec-46-8">The State Machines of core.async <a href="http://hueypetersen.com/posts/2013/08/02/the-state-machines-of-core-async/">http://hueypetersen.com/posts/2013/08/02/the-state-machines-of-core-async/</a></h3>
<div class="outline-text-3" id="text-46-8">

</div>

</div>

<div id="outline-container-46-9" class="outline-3">
<h3 id="sec-46-9">100k independent go blocks all running at the same time  <a href="http://swannodette.github.io/2013/08/02/100000-processes/">http://swannodette.github.io/2013/08/02/100000-processes/</a></h3>
<div class="outline-text-3" id="text-46-9">

</div>

</div>

<div id="outline-container-46-10" class="outline-3">
<h3 id="sec-46-10">Hoare examples implemente with core.async <a href="https://github.com/nodename/async-plgd">https://github.com/nodename/async-plgd</a></h3>
<div class="outline-text-3" id="text-46-10">

</div>

</div>

<div id="outline-container-46-11" class="outline-3">
<h3 id="sec-46-11">core.async examples in clojuscript <a href="http://swannodette.github.io/2013/07/12/communicating-sequential-processes/">http://swannodette.github.io/2013/07/12/communicating-sequential-processes/</a> <a href="https://github.com/swannodette/async-tests">https://github.com/swannodette/async-tests</a></h3>
<div class="outline-text-3" id="text-46-11">

</div>

</div>

<div id="outline-container-46-12" class="outline-3">
<h3 id="sec-46-12">some games core.async examples <a href="http://tech.puredanger.com/2013/07/10/rps-core-async/">http://tech.puredanger.com/2013/07/10/rps-core-async/</a> <a href="https://github.com/rkneufeld/rouge">https://github.com/rkneufeld/rouge</a></h3>
<div class="outline-text-3" id="text-46-12">

</div>

</div>

<div id="outline-container-46-13" class="outline-3">
<h3 id="sec-46-13">core.async: communicating termination <a href="https://groups.google.com/forum/#!topic/clojure/_KzEoq0XcHQ">https://groups.google.com/forum/#!topic/clojure/_KzEoq0XcHQ</a></h3>
<div class="outline-text-3" id="text-46-13">

</div>

</div>

<div id="outline-container-46-14" class="outline-3">
<h3 id="sec-46-14">Dining Philosophers in core.async <a href="http://pepijndevos.nl/2013/07/11/dining-philosophers-in-coreasync.html">http://pepijndevos.nl/2013/07/11/dining-philosophers-in-coreasync.html</a></h3>
<div class="outline-text-3" id="text-46-14">

</div>

</div>

<div id="outline-container-46-15" class="outline-3">
<h3 id="sec-46-15">Clojure, core.async and the Lisp Advantage <a href="http://www.leonardoborges.com/writings/2013/07/06/clojure-core-dot-async-lisp-advantage/">http://www.leonardoborges.com/writings/2013/07/06/clojure-core-dot-async-lisp-advantage/</a></h3>
<div class="outline-text-3" id="text-46-15">

</div>
</div>

</div>

<div id="outline-container-47" class="outline-2">
<h2 id="sec-47">clj image</h2>
<div class="outline-text-2" id="text-47">


</div>

<div id="outline-container-47-1" class="outline-3">
<h3 id="sec-47-1">Image analysis with Clojure and OpenCV: A face detection example <a href="http://nils-blum-oeste.net/image-analysis-with-clojure-up-and-running-with-opencv/#.UafoMfH2kuk">http://nils-blum-oeste.net/image-analysis-with-clojure-up-and-running-with-opencv/#.UafoMfH2kuk</a></h3>
<div class="outline-text-3" id="text-47-1">

</div>

</div>

<div id="outline-container-47-2" class="outline-3">
<h3 id="sec-47-2">openCV wrapper <a href="http://nakkaya.com/2011/01/24/lane-detection-using-clojure-and-opencv/">http://nakkaya.com/2011/01/24/lane-detection-using-clojure-and-opencv/</a>  <a href="http://nakkaya.com/vision.html">http://nakkaya.com/vision.html</a></h3>
<div class="outline-text-3" id="text-47-2">

</div>
</div>

</div>

<div id="outline-container-48" class="outline-2">
<h2 id="sec-48">Music</h2>
<div class="outline-text-2" id="text-48">


</div>

<div id="outline-container-48-1" class="outline-3">
<h3 id="sec-48-1">overtone</h3>
<div class="outline-text-3" id="text-48-1">


</div>

<div id="outline-container-48-1-1" class="outline-4">
<h4 id="sec-48-1-1"><a href="https://github.com/ctford/whelmed">https://github.com/ctford/whelmed</a></h4>
<div class="outline-text-4" id="text-48-1-1">

</div>

</div>

<div id="outline-container-48-1-2" class="outline-4">
<h4 id="sec-48-1-2">Creating instruments with overtone by Joseph Wilk <a href="http://blog.josephwilk.net/clojure/creating-instruments-with-overtone.html">http://blog.josephwilk.net/clojure/creating-instruments-with-overtone.html</a></h4>
<div class="outline-text-4" id="text-48-1-2">

</div>

</div>

<div id="outline-container-48-1-3" class="outline-4">
<h4 id="sec-48-1-3">overtone <a href="http://lifeisagraph.com/2010/03/15/clojure-event-system.html">http://lifeisagraph.com/2010/03/15/clojure-event-system.html</a></h4>
<div class="outline-text-4" id="text-48-1-3">

</div>

</div>

<div id="outline-container-48-1-4" class="outline-4">
<h4 id="sec-48-1-4">overtone stuff <a href="https://gist.github.com/rogerallen">https://gist.github.com/rogerallen</a> <a href="http://rogerallen.github.com/">http://rogerallen.github.com/</a> using <a href="https://github.com/ctford/leipzig">https://github.com/ctford/leipzig</a></h4>
<div class="outline-text-4" id="text-48-1-4">

</div>

</div>

<div id="outline-container-48-1-5" class="outline-4">
<h4 id="sec-48-1-5">music composition example in overtone <a href="https://soundcloud.com/toxi/rukanos-space-organ">https://soundcloud.com/toxi/rukanos-space-organ</a> <a href="http://hg.postspectacular.com/resonate-2013">http://hg.postspectacular.com/resonate-2013</a></h4>
<div class="outline-text-4" id="text-48-1-5">

</div>

</div>

<div id="outline-container-48-1-6" class="outline-4">
<h4 id="sec-48-1-6">sam aaron demo : <a href="http://vimeo.com/60534305">http://vimeo.com/60534305</a></h4>
<div class="outline-text-4" id="text-48-1-6">

</div>
</div>

</div>

<div id="outline-container-48-2" class="outline-3">
<h3 id="sec-48-2">coursera class on music technology <a href="https://www.coursera.org/course/musictech">https://www.coursera.org/course/musictech</a></h3>
<div class="outline-text-3" id="text-48-2">

</div>

</div>

<div id="outline-container-48-3" class="outline-3">
<h3 id="sec-48-3">Music books</h3>
<div class="outline-text-3" id="text-48-3">


</div>

<div id="outline-container-48-3-1" class="outline-4">
<h4 id="sec-48-3-1"><a href="http://music.columbia.edu/cmc/MusicAndComputers/">http://music.columbia.edu/cmc/MusicAndComputers/</a></h4>
<div class="outline-text-4" id="text-48-3-1">

</div>

</div>

<div id="outline-container-48-3-2" class="outline-4">
<h4 id="sec-48-3-2">Puckette: Theory and Techniques of Electronic Music. Online at: <a href="http://crca.ucsd.edu/~msp/techniques.htm">http://crca.ucsd.edu/~msp/techniques.htm</a></h4>
<div class="outline-text-4" id="text-48-3-2">

</div>

</div>

<div id="outline-container-48-3-3" class="outline-4">
<h4 id="sec-48-3-3">The Computer Music Tutorial  <a href="http://www.chegg.com/textbooks/the-computer-music-tutorial-1st-edition-9780262680820-0262680823?trackid=c8c3f95d&amp;ii=1&amp;om_ss=1">http://www.chegg.com/textbooks/the-computer-music-tutorial-1st-edition-9780262680820-0262680823?trackid=c8c3f95d&amp;ii=1&amp;om_ss=1</a></h4>
<div class="outline-text-4" id="text-48-3-3">

</div>
</div>

</div>

<div id="outline-container-48-4" class="outline-3">
<h3 id="sec-48-4">Music in Python <a href="http://pyvideo.org/video/1769/music-theory-and-performance-analysis-with-sebast">http://pyvideo.org/video/1769/music-theory-and-performance-analysis-with-sebast</a></h3>
<div class="outline-text-3" id="text-48-4">

</div>
</div>

</div>

<div id="outline-container-49" class="outline-2">
<h2 id="sec-49">clj devops</h2>
<div class="outline-text-2" id="text-49">


</div>

<div id="outline-container-49-1" class="outline-3">
<h3 id="sec-49-1">use leiningen for scala project scalding <a href="https://github.com/masverba/scalding-on-leiningen">https://github.com/masverba/scalding-on-leiningen</a></h3>
<div class="outline-text-3" id="text-49-1">

</div>
</div>

</div>

<div id="outline-container-50" class="outline-2">
<h2 id="sec-50">clj data computation</h2>
<div class="outline-text-2" id="text-50">


</div>

<div id="outline-container-50-1" class="outline-3">
<h3 id="sec-50-1">Experimental combination of core.logic and core.matrix to allow reasoning with vectors / mathematical expressions <a href="https://github.com/clojure-numerics/expresso">https://github.com/clojure-numerics/expresso</a></h3>
<div class="outline-text-3" id="text-50-1">

</div>

</div>
