toread.org
** Algebraic Expressions by Maik Schünemann http://kimavcrp.blogspot.de/2013/05/gsoc-project-algebraic-expressions-pre.html
** Introducing HipHip (Array): Fast and flexible numerical computation in Clojure https://github.com/prismatic/hiphip
http://blog.getprismatic.com/blog/2013/7/10/introducing-hiphip-array-fast-and-flexible-numerical-computation-in-clojure
** client cassandra thrift  https://gist.github.com/daveray/5464943
** matlab --> clojure example http://boss-level.com/?p=160 http://ejackson.github.com/inflow/

** Using riemann to monitor python apps http://www.spootnik.org/tech/2013/05/21_using-riemann-to-monitor-python-apps.html
** clojure event processing with esper http://patternhatch.com/2013/05/29/event-stream-processing-using-clojure-and-esper/
** [[http://blog.getprismatic.com/blog/2012/10/1/prismatics-graph-at-strange-loop.html][graph from prismatic]] [[https://github.com/clojure/tools.namespace][namespace from ssierra]] using [[https://github.com/stuartsierra/flow][flow]] clone from graph
** explained graph usage http://blog.getprismatic.com/blog/2013/2/1/graph-abstractions-for-structured-computation
** discussion https://groups.google.com/forum/?fromgroups=#!topic/clojure/UYXcoK0bTNc http://news.ycombinator.com/item?id=5183236
** behavior trees http://www.altdevblogaday.com/2011/02/24/introduction-to-behavior-trees/
** http://en.wikipedia.org/wiki/Dataflow_programming
** stats computation
*** https://github.com/ReadyForZero/babbage https://groups.google.com/forum/?fromgroups=#!topic/clojure/TEtlhjRRRvk
*** example with fingertree https://gist.github.com/672592  http://blog.sigfpe.com/2010/11/statistical-fingertrees.html
    
* clj java
** jav.nio2 wrapper https://github.com/juergenhoetzel/clj-nio2
(ns test.nio2.test.tail
  (:use clojure.java.io nio2.io nio2.watch nio2.files))

(defn tail [n p]
  "Print the last n lines of path p to stdout"
  (with-open [rdr (reader p)]
    (doseq [l (take-last n (line-seq rdr))]
      (println l))
    (doseq [e (watch-seq (parent (real-path p)) :modify)]
      (when (= (real-path (:path e)) (real-path p))
        (while (.ready rdr) (println (.readLine rdr)))))))
* clj libraries
** DateTime Conversions in Clojure http://decomplecting.org/blog/2013/02/03/datetime-conversions-in-clojure/
** A macro-based refactoring library for Clojure https://github.com/ctford/poker
** Utility libraries and dependency hygiene https://groups.google.com/group/clojure/browse_frm/thread/5ae4b7d514a2cff0
Parallel universes for namespaces  https://github.com/technomancy/metaverse 
** Twitter-api [twitter-api "0.7.4"] https://github.com/adamwynne/twitter-api 
** css DSL https://github.com/noprompt/garden
** Geohash library for clojure by @sunng https://bitbucket.org/sunng/clojure-geohash
* misc clj
** http://www.brandonbloom.name/blog/2013/06/26/slurp-and-spit/
** https://github.com/ztellman/byte-streams
** unifiacation with macros core.contract http://blog.fogus.me/2013/04/23/using-unification-to-write-readable-macros/
** jlatexmath in https://github.com/tgk/tex-service http://forge.scilab.org/index.php/p/jlatexmath/
** detect language with com.cybozu.labs.langdetect.DetectorFactory https://gist.github.com/cemerick/5457242
** clojure in clojure https://bitbucket.org/remleduff/cinc
** stuart Halloway presentations https://github.com/stuarthalloway/presentations/wiki
** typed clojure screencast by Ambrose BS  https://vimeo.com/55196903  https://vimeo.com/55215849  https://vimeo.com/55251041  https://vimeo.com/55280915
** ssierra lib on namespace
** namespacing https://groups.google.com/forum/?fromgroups=#!topic/clojure/GgPmRnmbIZQ
** security group https://groups.google.com/group/clojure-sec?pli=1
** https://github.com/clojure/clojure/blob/clojure-1.5.0-RC1/changes.md
** slamhound to install on emacs to write require/import for you http://www.lispplusplus.com/2012/12/slamhound-130-cleaning-up-all-your.html
** use slog4j http://blog.zololabs.com/2012/12/04/logging-in-clojure-jvm-part-2/
