toread.html

<div id="outline-container-50-2" class="outline-3">
<h3 id="sec-50-2">Algebraic Expressions by Maik Schünemann <a href="http://kimavcrp.blogspot.de/2013/05/gsoc-project-algebraic-expressions-pre.html">http://kimavcrp.blogspot.de/2013/05/gsoc-project-algebraic-expressions-pre.html</a></h3>
<div class="outline-text-3" id="text-50-2">

</div>

</div>

<div id="outline-container-50-3" class="outline-3">
<h3 id="sec-50-3">Introducing HipHip (Array): Fast and flexible numerical computation in Clojure <a href="https://github.com/prismatic/hiphip">https://github.com/prismatic/hiphip</a></h3>
<div class="outline-text-3" id="text-50-3">

<p><a href="http://blog.getprismatic.com/blog/2013/7/10/introducing-hiphip-array-fast-and-flexible-numerical-computation-in-clojure">http://blog.getprismatic.com/blog/2013/7/10/introducing-hiphip-array-fast-and-flexible-numerical-computation-in-clojure</a>
</p></div>

</div>

<div id="outline-container-50-4" class="outline-3">
<h3 id="sec-50-4">client cassandra thrift  <a href="https://gist.github.com/daveray/5464943">https://gist.github.com/daveray/5464943</a></h3>
<div class="outline-text-3" id="text-50-4">

</div>

</div>

<div id="outline-container-50-5" class="outline-3">
<h3 id="sec-50-5">matlab &ndash;&gt; clojure example <a href="http://boss-level.com/?p=160">http://boss-level.com/?p=160</a> <a href="http://ejackson.github.com/inflow/">http://ejackson.github.com/inflow/</a></h3>
<div class="outline-text-3" id="text-50-5">


</div>

</div>

<div id="outline-container-50-6" class="outline-3">
<h3 id="sec-50-6">Using riemann to monitor python apps <a href="http://www.spootnik.org/tech/2013/05/21_using-riemann-to-monitor-python-apps.html">http://www.spootnik.org/tech/2013/05/21_using-riemann-to-monitor-python-apps.html</a></h3>
<div class="outline-text-3" id="text-50-6">

</div>

</div>

<div id="outline-container-50-7" class="outline-3">
<h3 id="sec-50-7">clojure event processing with esper <a href="http://patternhatch.com/2013/05/29/event-stream-processing-using-clojure-and-esper/">http://patternhatch.com/2013/05/29/event-stream-processing-using-clojure-and-esper/</a></h3>
<div class="outline-text-3" id="text-50-7">

</div>

</div>

<div id="outline-container-50-8" class="outline-3">
<h3 id="sec-50-8"><a href="http://blog.getprismatic.com/blog/2012/10/1/prismatics-graph-at-strange-loop.html">graph from prismatic</a> <a href="https://github.com/clojure/tools.namespace">namespace from ssierra</a> using <a href="https://github.com/stuartsierra/flow">flow</a> clone from graph</h3>
<div class="outline-text-3" id="text-50-8">

</div>

</div>

<div id="outline-container-50-9" class="outline-3">
<h3 id="sec-50-9">explained graph usage <a href="http://blog.getprismatic.com/blog/2013/2/1/graph-abstractions-for-structured-computation">http://blog.getprismatic.com/blog/2013/2/1/graph-abstractions-for-structured-computation</a></h3>
<div class="outline-text-3" id="text-50-9">

</div>

</div>

<div id="outline-container-50-10" class="outline-3">
<h3 id="sec-50-10">discussion <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/UYXcoK0bTNc">https://groups.google.com/forum/?fromgroups=#!topic/clojure/UYXcoK0bTNc</a> <a href="http://news.ycombinator.com/item?id=5183236">http://news.ycombinator.com/item?id=5183236</a></h3>
<div class="outline-text-3" id="text-50-10">

</div>

</div>

<div id="outline-container-50-11" class="outline-3">
<h3 id="sec-50-11">behavior trees <a href="http://www.altdevblogaday.com/2011/02/24/introduction-to-behavior-trees/">http://www.altdevblogaday.com/2011/02/24/introduction-to-behavior-trees/</a></h3>
<div class="outline-text-3" id="text-50-11">

</div>

</div>

<div id="outline-container-50-12" class="outline-3">
<h3 id="sec-50-12"><a href="http://en.wikipedia.org/wiki/Dataflow_programming">http://en.wikipedia.org/wiki/Dataflow_programming</a></h3>
<div class="outline-text-3" id="text-50-12">

</div>

</div>

<div id="outline-container-50-13" class="outline-3">
<h3 id="sec-50-13">stats computation</h3>
<div class="outline-text-3" id="text-50-13">


</div>

<div id="outline-container-50-13-1" class="outline-4">
<h4 id="sec-50-13-1"><a href="https://github.com/ReadyForZero/babbage">https://github.com/ReadyForZero/babbage</a> <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/TEtlhjRRRvk">https://groups.google.com/forum/?fromgroups=#!topic/clojure/TEtlhjRRRvk</a></h4>
<div class="outline-text-4" id="text-50-13-1">

</div>

</div>

<div id="outline-container-50-13-2" class="outline-4">
<h4 id="sec-50-13-2">example with fingertree <a href="https://gist.github.com/672592">https://gist.github.com/672592</a>  <a href="http://blog.sigfpe.com/2010/11/statistical-fingertrees.html">http://blog.sigfpe.com/2010/11/statistical-fingertrees.html</a></h4>
<div class="outline-text-4" id="text-50-13-2">


</div>
</div>
</div>

</div>

<div id="outline-container-51" class="outline-2">
<h2 id="sec-51">clj java</h2>
<div class="outline-text-2" id="text-51">


</div>

<div id="outline-container-51-1" class="outline-3">
<h3 id="sec-51-1">jav.nio2 wrapper <a href="https://github.com/juergenhoetzel/clj-nio2">https://github.com/juergenhoetzel/clj-nio2</a></h3>
<div class="outline-text-3" id="text-51-1">

<p>(ns test.nio2.test.tail
  (:use clojure.java.io nio2.io nio2.watch nio2.files))
</p>
<p>
(defn tail [n p]
  "Print the last n lines of path p to stdout"
  (with-open [rdr (reader p)]
    (doseq [l (take-last n (line-seq rdr))]
      (println l))
    (doseq [e (watch-seq (parent (real-path p)) :modify)]
      (when (= (real-path (:path e)) (real-path p))
        (while (.ready rdr) (println (.readLine rdr)))))))
</p></div>
</div>

</div>

<div id="outline-container-52" class="outline-2">
<h2 id="sec-52">clj libraries</h2>
<div class="outline-text-2" id="text-52">


</div>

<div id="outline-container-52-1" class="outline-3">
<h3 id="sec-52-1">DateTime Conversions in Clojure <a href="http://decomplecting.org/blog/2013/02/03/datetime-conversions-in-clojure/">http://decomplecting.org/blog/2013/02/03/datetime-conversions-in-clojure/</a></h3>
<div class="outline-text-3" id="text-52-1">

</div>

</div>

<div id="outline-container-52-2" class="outline-3">
<h3 id="sec-52-2">A macro-based refactoring library for Clojure <a href="https://github.com/ctford/poker">https://github.com/ctford/poker</a></h3>
<div class="outline-text-3" id="text-52-2">

</div>

</div>

<div id="outline-container-52-3" class="outline-3">
<h3 id="sec-52-3">Utility libraries and dependency hygiene <a href="https://groups.google.com/group/clojure/browse_frm/thread/5ae4b7d514a2cff0">https://groups.google.com/group/clojure/browse_frm/thread/5ae4b7d514a2cff0</a></h3>
<div class="outline-text-3" id="text-52-3">

<p>Parallel universes for namespaces  <a href="https://github.com/technomancy/metaverse">https://github.com/technomancy/metaverse</a> 
</p></div>

</div>

<div id="outline-container-52-4" class="outline-3">
<h3 id="sec-52-4">Twitter-api [twitter-api "0.7.4"] <a href="https://github.com/adamwynne/twitter-api">https://github.com/adamwynne/twitter-api</a></h3>
<div class="outline-text-3" id="text-52-4">

</div>

</div>

<div id="outline-container-52-5" class="outline-3">
<h3 id="sec-52-5">css DSL <a href="https://github.com/noprompt/garden">https://github.com/noprompt/garden</a></h3>
<div class="outline-text-3" id="text-52-5">

</div>

</div>

<div id="outline-container-52-6" class="outline-3">
<h3 id="sec-52-6">Geohash library for clojure by @sunng <a href="https://bitbucket.org/sunng/clojure-geohash">https://bitbucket.org/sunng/clojure-geohash</a></h3>
<div class="outline-text-3" id="text-52-6">

</div>
</div>

</div>

<div id="outline-container-53" class="outline-2">
<h2 id="sec-53">misc clj</h2>
<div class="outline-text-2" id="text-53">


</div>

<div id="outline-container-53-1" class="outline-3">
<h3 id="sec-53-1"><a href="http://www.brandonbloom.name/blog/2013/06/26/slurp-and-spit/">http://www.brandonbloom.name/blog/2013/06/26/slurp-and-spit/</a></h3>
<div class="outline-text-3" id="text-53-1">

</div>

</div>

<div id="outline-container-53-2" class="outline-3">
<h3 id="sec-53-2"><a href="https://github.com/ztellman/byte-streams">https://github.com/ztellman/byte-streams</a></h3>
<div class="outline-text-3" id="text-53-2">

</div>

</div>

<div id="outline-container-53-3" class="outline-3">
<h3 id="sec-53-3">unifiacation with macros core.contract <a href="http://blog.fogus.me/2013/04/23/using-unification-to-write-readable-macros/">http://blog.fogus.me/2013/04/23/using-unification-to-write-readable-macros/</a></h3>
<div class="outline-text-3" id="text-53-3">

</div>

</div>

<div id="outline-container-53-4" class="outline-3">
<h3 id="sec-53-4">jlatexmath in <a href="https://github.com/tgk/tex-service">https://github.com/tgk/tex-service</a> <a href="http://forge.scilab.org/index.php/p/jlatexmath/">http://forge.scilab.org/index.php/p/jlatexmath/</a></h3>
<div class="outline-text-3" id="text-53-4">

</div>

</div>

<div id="outline-container-53-5" class="outline-3">
<h3 id="sec-53-5">detect language with com.cybozu.labs.langdetect.DetectorFactory <a href="https://gist.github.com/cemerick/5457242">https://gist.github.com/cemerick/5457242</a></h3>
<div class="outline-text-3" id="text-53-5">

</div>

</div>

<div id="outline-container-53-6" class="outline-3">
<h3 id="sec-53-6">clojure in clojure <a href="https://bitbucket.org/remleduff/cinc">https://bitbucket.org/remleduff/cinc</a></h3>
<div class="outline-text-3" id="text-53-6">

</div>

</div>

<div id="outline-container-53-7" class="outline-3">
<h3 id="sec-53-7">stuart Halloway presentations <a href="https://github.com/stuarthalloway/presentations/wiki">https://github.com/stuarthalloway/presentations/wiki</a></h3>
<div class="outline-text-3" id="text-53-7">

</div>

</div>

<div id="outline-container-53-8" class="outline-3">
<h3 id="sec-53-8">typed clojure screencast by Ambrose BS  <a href="https://vimeo.com/55196903">https://vimeo.com/55196903</a>  <a href="https://vimeo.com/55215849">https://vimeo.com/55215849</a>  <a href="https://vimeo.com/55251041">https://vimeo.com/55251041</a>  <a href="https://vimeo.com/55280915">https://vimeo.com/55280915</a></h3>
<div class="outline-text-3" id="text-53-8">

</div>

</div>

<div id="outline-container-53-9" class="outline-3">
<h3 id="sec-53-9">ssierra lib on namespace</h3>
<div class="outline-text-3" id="text-53-9">

</div>

</div>

<div id="outline-container-53-10" class="outline-3">
<h3 id="sec-53-10">namespacing <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/GgPmRnmbIZQ">https://groups.google.com/forum/?fromgroups=#!topic/clojure/GgPmRnmbIZQ</a></h3>
<div class="outline-text-3" id="text-53-10">

</div>

</div>

<div id="outline-container-53-11" class="outline-3">
<h3 id="sec-53-11">security group <a href="https://groups.google.com/group/clojure-sec?pli=1">https://groups.google.com/group/clojure-sec?pli=1</a></h3>
<div class="outline-text-3" id="text-53-11">

</div>

</div>

<div id="outline-container-53-12" class="outline-3">
<h3 id="sec-53-12"><a href="https://github.com/clojure/clojure/blob/clojure-1.5.0-RC1/changes.md">https://github.com/clojure/clojure/blob/clojure-1.5.0-RC1/changes.md</a></h3>
<div class="outline-text-3" id="text-53-12">

</div>

</div>

<div id="outline-container-53-13" class="outline-3">
<h3 id="sec-53-13">slamhound to install on emacs to write require/import for you <a href="http://www.lispplusplus.com/2012/12/slamhound-130-cleaning-up-all-your.html">http://www.lispplusplus.com/2012/12/slamhound-130-cleaning-up-all-your.html</a></h3>
<div class="outline-text-3" id="text-53-13">

</div>

</div>

<div id="outline-container-53-14" class="outline-3">
<h3 id="sec-53-14">use slog4j <a href="http://blog.zololabs.com/2012/12/04/logging-in-clojure-jvm-part-2/">http://blog.zololabs.com/2012/12/04/logging-in-clojure-jvm-part-2/</a></h3>
<div class="outline-text-3" id="text-53-14">

</div>

</div>
