toread.org
** check logging in clj
http://corfield.org/blog/post.cfm/real-world-clojure-logging
http://www.paullegato.com/blog/log4j-clojure/
http://gphil.net/posts/2012-09-04-logging-in-clojure.html simple concrete example
** http://randomcomputation.blogspot.ch/2013/01/monte-carlo-tree-search-in-clojure.
** fast idiomatic pretty-printer  https://github.com/brandonbloom/fipp
** intro clojure http://www.unexpected-vortices.com/clojure/brief-beginners-guide/libs-management-and-use.html

** write, transport , process logs http://blog.zololabs.com/2013/01/24/logging-in-clojure-jvm-part-4/
** display vector , hash as ASCII table https://github.com/owainlewis/tabular clojure.pprint/print-table is for maps only
** clojure table layout https://github.com/joegallo/doric
** http://stevelosh.com/blog/2012/07/caves-of-clojure-01/ interact with terminals http://sjl.bitbucket.org/clojure-lanterna/
** schema in clj https://github.com/runa-dev/clj-schema
** http://hackaday.com/2013/02/07/gifsockets-websockets-using-animated-gif-files/
** http://dev.clojure.org/display/community/Project+Ideas
* clj machine learning
** review code on levenshtein algo and memoization https://groups.google.com/forum/#!topic/clojure/w6SRYE4n6pc
** clojure wrapper on top various nlp libs https://github.com/jimpil/hotel-nlp
** Sentiment analysis in clojure http://kilotau.com/blog/2012/07/06/creating-a-simple-sentiment-analyzer-using-cl/ https://github.com/damionjunk/sentimental
* clj server
** event system explained in clojure (FSM + redis + rabbitmq)  http://www.quantisan.com/event-driven-finite-state-machine-for-a-distributed-trading-system/
** Stuart Sierra about tools.namespace http://thinkrelevance.com/blog/2013/06/04/clojure-workflow-reloaded
** http://paulosuzart.github.com/blog/2013/02/07/configuring-clojure-immutant-by-environment/
* clj perf
** Proteus: local mutable variables for the masses by Zach Tellman https://github.com/ztellman/proteus https://groups.google.com/forum/#!topic/clojure/7HNNiJJTte4
** Clojure: Elegance vs. Performance? https://groups.google.com/forum/#!topic/clojure/-oPnklPSLx8
** intrumenting clojure http://corfield.org/blog/post.cfm/instrumenting-clojure-for-new-relic-monitoring
** quick-bench http://clojurefun.wordpress.com/2013/03/07/achieving-awesome-numerical-performance-in-clojure/
** primes optimized http://loufranco.com/blog/20-days-of-clojure-day-15
** A simple IO library for using Clojure's reducers  https://github.com/thebusby/iota/
** list of useful links http://www.verious.com/board/AKumar/improving-performance-with-clojure/
* clj webdev
** webframework à la django https://github.com/caribou
** Manual Clojure Deployment https://juxt.pro/articles/manual-clojure-deployment.html
** enlive snippet use case https://groups.google.com/forum/#!topic/enlive-clj/h0Y2pYOe6o4 
https://github.com/xavi/noir-auth-app/blob/master/src/noir_auth_app/views/admin.clj#L30-L102  https://groups.google.com/forum/#!topic/enlive-clj/EJWSH5G7rH0
** websockets with http-kit https://github.com/cgmartin/clj-wamp
** Parallel Processing with Pedestal https://github.com/pedestal/app-tutorial/wiki/Parallel-Processing
** Pedestal Todo app https://github.com/konrad-garus/pedestal-todo
** JSON on steroid inpired by EDN https://github.com/lynaghk/json-tagged-literals
** Building an iOS weather app with Angular and ClojureScript http://keminglabs.com/blog/angular-cljs-mobile-weather-app/
* clj GUI
** http://nathanwilliams.github.io/2013/05/15/seesaw-gui-programming-the-clojure-way/
** clojure IDE http://nightcode.info/
* cljs
** http://www.panoramap.org web-app with Leaflet  https://github.com/bzg/wlmmap
