toread.html

<div id="outline-container-53-15" class="outline-3">
<h3 id="sec-53-15">check logging in clj</h3>
<div class="outline-text-3" id="text-53-15">

<p><a href="http://corfield.org/blog/post.cfm/real-world-clojure-logging">http://corfield.org/blog/post.cfm/real-world-clojure-logging</a>
<a href="http://www.paullegato.com/blog/log4j-clojure/">http://www.paullegato.com/blog/log4j-clojure/</a>
<a href="http://gphil.net/posts/2012-09-04-logging-in-clojure.html">http://gphil.net/posts/2012-09-04-logging-in-clojure.html</a> simple concrete example
</p></div>

</div>

<div id="outline-container-53-16" class="outline-3">
<h3 id="sec-53-16"><a href="http://randomcomputation.blogspot.ch/2013/01/monte-carlo-tree-search-in-clojure">http://randomcomputation.blogspot.ch/2013/01/monte-carlo-tree-search-in-clojure</a>.</h3>
<div class="outline-text-3" id="text-53-16">

</div>

</div>

<div id="outline-container-53-17" class="outline-3">
<h3 id="sec-53-17">fast idiomatic pretty-printer  <a href="https://github.com/brandonbloom/fipp">https://github.com/brandonbloom/fipp</a></h3>
<div class="outline-text-3" id="text-53-17">

</div>

</div>

<div id="outline-container-53-18" class="outline-3">
<h3 id="sec-53-18">intro clojure <a href="http://www.unexpected-vortices.com/clojure/brief-beginners-guide/libs-management-and-use.html">http://www.unexpected-vortices.com/clojure/brief-beginners-guide/libs-management-and-use.html</a></h3>
<div class="outline-text-3" id="text-53-18">


</div>

</div>

<div id="outline-container-53-19" class="outline-3">
<h3 id="sec-53-19">write, transport , process logs <a href="http://blog.zololabs.com/2013/01/24/logging-in-clojure-jvm-part-4/">http://blog.zololabs.com/2013/01/24/logging-in-clojure-jvm-part-4/</a></h3>
<div class="outline-text-3" id="text-53-19">

</div>

</div>

<div id="outline-container-53-20" class="outline-3">
<h3 id="sec-53-20">display vector , hash as ASCII table <a href="https://github.com/owainlewis/tabular">https://github.com/owainlewis/tabular</a> clojure.pprint/print-table is for maps only</h3>
<div class="outline-text-3" id="text-53-20">

</div>

</div>

<div id="outline-container-53-21" class="outline-3">
<h3 id="sec-53-21">clojure table layout <a href="https://github.com/joegallo/doric">https://github.com/joegallo/doric</a></h3>
<div class="outline-text-3" id="text-53-21">

</div>

</div>

<div id="outline-container-53-22" class="outline-3">
<h3 id="sec-53-22"><a href="http://stevelosh.com/blog/2012/07/caves-of-clojure-01/">http://stevelosh.com/blog/2012/07/caves-of-clojure-01/</a> interact with terminals <a href="http://sjl.bitbucket.org/clojure-lanterna/">http://sjl.bitbucket.org/clojure-lanterna/</a></h3>
<div class="outline-text-3" id="text-53-22">

</div>

</div>

<div id="outline-container-53-23" class="outline-3">
<h3 id="sec-53-23">schema in clj <a href="https://github.com/runa-dev/clj-schema">https://github.com/runa-dev/clj-schema</a></h3>
<div class="outline-text-3" id="text-53-23">

</div>

</div>

<div id="outline-container-53-24" class="outline-3">
<h3 id="sec-53-24"><a href="http://hackaday.com/2013/02/07/gifsockets-websockets-using-animated-gif-files/">http://hackaday.com/2013/02/07/gifsockets-websockets-using-animated-gif-files/</a></h3>
<div class="outline-text-3" id="text-53-24">

</div>

</div>

<div id="outline-container-53-25" class="outline-3">
<h3 id="sec-53-25"><a href="http://dev.clojure.org/display/community/Project+Ideas">http://dev.clojure.org/display/community/Project+Ideas</a></h3>
<div class="outline-text-3" id="text-53-25">

</div>
</div>

</div>

<div id="outline-container-54" class="outline-2">
<h2 id="sec-54">clj machine learning</h2>
<div class="outline-text-2" id="text-54">


</div>

<div id="outline-container-54-1" class="outline-3">
<h3 id="sec-54-1">review code on levenshtein algo and memoization <a href="https://groups.google.com/forum/#!topic/clojure/w6SRYE4n6pc">https://groups.google.com/forum/#!topic/clojure/w6SRYE4n6pc</a></h3>
<div class="outline-text-3" id="text-54-1">

</div>

</div>

<div id="outline-container-54-2" class="outline-3">
<h3 id="sec-54-2">clojure wrapper on top various nlp libs <a href="https://github.com/jimpil/hotel-nlp">https://github.com/jimpil/hotel-nlp</a></h3>
<div class="outline-text-3" id="text-54-2">

</div>

</div>

<div id="outline-container-54-3" class="outline-3">
<h3 id="sec-54-3">Sentiment analysis in clojure <a href="http://kilotau.com/blog/2012/07/06/creating-a-simple-sentiment-analyzer-using-cl/">http://kilotau.com/blog/2012/07/06/creating-a-simple-sentiment-analyzer-using-cl/</a> <a href="https://github.com/damionjunk/sentimental">https://github.com/damionjunk/sentimental</a></h3>
<div class="outline-text-3" id="text-54-3">

</div>
</div>

</div>

<div id="outline-container-55" class="outline-2">
<h2 id="sec-55">clj server</h2>
<div class="outline-text-2" id="text-55">


</div>

<div id="outline-container-55-1" class="outline-3">
<h3 id="sec-55-1">event system explained in clojure (FSM + redis + rabbitmq)  <a href="http://www.quantisan.com/event-driven-finite-state-machine-for-a-distributed-trading-system/">http://www.quantisan.com/event-driven-finite-state-machine-for-a-distributed-trading-system/</a></h3>
<div class="outline-text-3" id="text-55-1">

</div>

</div>

<div id="outline-container-55-2" class="outline-3">
<h3 id="sec-55-2">Stuart Sierra about tools.namespace <a href="http://thinkrelevance.com/blog/2013/06/04/clojure-workflow-reloaded">http://thinkrelevance.com/blog/2013/06/04/clojure-workflow-reloaded</a></h3>
<div class="outline-text-3" id="text-55-2">

</div>

</div>

<div id="outline-container-55-3" class="outline-3">
<h3 id="sec-55-3"><a href="http://paulosuzart.github.com/blog/2013/02/07/configuring-clojure-immutant-by-environment/">http://paulosuzart.github.com/blog/2013/02/07/configuring-clojure-immutant-by-environment/</a></h3>
<div class="outline-text-3" id="text-55-3">

</div>
</div>

</div>

<div id="outline-container-56" class="outline-2">
<h2 id="sec-56">clj perf</h2>
<div class="outline-text-2" id="text-56">


</div>

<div id="outline-container-56-1" class="outline-3">
<h3 id="sec-56-1">Proteus: local mutable variables for the masses by Zach Tellman <a href="https://github.com/ztellman/proteus">https://github.com/ztellman/proteus</a> <a href="https://groups.google.com/forum/#!topic/clojure/7HNNiJJTte4">https://groups.google.com/forum/#!topic/clojure/7HNNiJJTte4</a></h3>
<div class="outline-text-3" id="text-56-1">

</div>

</div>

<div id="outline-container-56-2" class="outline-3">
<h3 id="sec-56-2">Clojure: Elegance vs. Performance? <a href="https://groups.google.com/forum/#!topic/clojure/-oPnklPSLx8">https://groups.google.com/forum/#!topic/clojure/-oPnklPSLx8</a></h3>
<div class="outline-text-3" id="text-56-2">

</div>

</div>

<div id="outline-container-56-3" class="outline-3">
<h3 id="sec-56-3">intrumenting clojure <a href="http://corfield.org/blog/post.cfm/instrumenting-clojure-for-new-relic-monitoring">http://corfield.org/blog/post.cfm/instrumenting-clojure-for-new-relic-monitoring</a></h3>
<div class="outline-text-3" id="text-56-3">

</div>

</div>

<div id="outline-container-56-4" class="outline-3">
<h3 id="sec-56-4">quick-bench <a href="http://clojurefun.wordpress.com/2013/03/07/achieving-awesome-numerical-performance-in-clojure/">http://clojurefun.wordpress.com/2013/03/07/achieving-awesome-numerical-performance-in-clojure/</a></h3>
<div class="outline-text-3" id="text-56-4">

</div>

</div>

<div id="outline-container-56-5" class="outline-3">
<h3 id="sec-56-5">primes optimized <a href="http://loufranco.com/blog/20-days-of-clojure-day-15">http://loufranco.com/blog/20-days-of-clojure-day-15</a></h3>
<div class="outline-text-3" id="text-56-5">

</div>

</div>

<div id="outline-container-56-6" class="outline-3">
<h3 id="sec-56-6">A simple IO library for using Clojure's reducers  <a href="https://github.com/thebusby/iota/">https://github.com/thebusby/iota/</a></h3>
<div class="outline-text-3" id="text-56-6">

</div>

</div>

<div id="outline-container-56-7" class="outline-3">
<h3 id="sec-56-7">list of useful links <a href="http://www.verious.com/board/AKumar/improving-performance-with-clojure/">http://www.verious.com/board/AKumar/improving-performance-with-clojure/</a></h3>
<div class="outline-text-3" id="text-56-7">

</div>
</div>

</div>

<div id="outline-container-57" class="outline-2">
<h2 id="sec-57">clj webdev</h2>
<div class="outline-text-2" id="text-57">


</div>

<div id="outline-container-57-1" class="outline-3">
<h3 id="sec-57-1">Manual Clojure Deployment <a href="https://juxt.pro/articles/manual-clojure-deployment.html">https://juxt.pro/articles/manual-clojure-deployment.html</a></h3>
<div class="outline-text-3" id="text-57-1">

</div>

</div>

<div id="outline-container-57-2" class="outline-3">
<h3 id="sec-57-2">enlive snippet use case <a href="https://groups.google.com/forum/#!topic/enlive-clj/h0Y2pYOe6o4">https://groups.google.com/forum/#!topic/enlive-clj/h0Y2pYOe6o4</a></h3>
<div class="outline-text-3" id="text-57-2">

<p><a href="https://github.com/xavi/noir-auth-app/blob/master/src/noir_auth_app/views/admin.clj#L30-L102">https://github.com/xavi/noir-auth-app/blob/master/src/noir_auth_app/views/admin.clj#L30-L102</a>  <a href="https://groups.google.com/forum/#!topic/enlive-clj/EJWSH5G7rH0">https://groups.google.com/forum/#!topic/enlive-clj/EJWSH5G7rH0</a>
</p></div>

</div>

<div id="outline-container-57-3" class="outline-3">
<h3 id="sec-57-3">websockets with http-kit <a href="https://github.com/cgmartin/clj-wamp">https://github.com/cgmartin/clj-wamp</a></h3>
<div class="outline-text-3" id="text-57-3">

</div>

</div>

<div id="outline-container-57-4" class="outline-3">
<h3 id="sec-57-4">Parallel Processing with Pedestal <a href="https://github.com/pedestal/app-tutorial/wiki/Parallel-Processing">https://github.com/pedestal/app-tutorial/wiki/Parallel-Processing</a></h3>
<div class="outline-text-3" id="text-57-4">

</div>

</div>

<div id="outline-container-57-5" class="outline-3">
<h3 id="sec-57-5">Pedestal Todo app <a href="https://github.com/konrad-garus/pedestal-todo">https://github.com/konrad-garus/pedestal-todo</a></h3>
<div class="outline-text-3" id="text-57-5">

</div>

</div>

<div id="outline-container-57-6" class="outline-3">
<h3 id="sec-57-6">JSON on steroid inpired by EDN <a href="https://github.com/lynaghk/json-tagged-literals">https://github.com/lynaghk/json-tagged-literals</a></h3>
<div class="outline-text-3" id="text-57-6">

</div>

</div>

<div id="outline-container-57-7" class="outline-3">
<h3 id="sec-57-7">Building an iOS weather app with Angular and ClojureScript <a href="http://keminglabs.com/blog/angular-cljs-mobile-weather-app/">http://keminglabs.com/blog/angular-cljs-mobile-weather-app/</a></h3>
<div class="outline-text-3" id="text-57-7">

</div>
</div>

</div>

<div id="outline-container-58" class="outline-2">
<h2 id="sec-58">clj GUI</h2>
<div class="outline-text-2" id="text-58">


</div>

<div id="outline-container-58-1" class="outline-3">
<h3 id="sec-58-1"><a href="http://nathanwilliams.github.io/2013/05/15/seesaw-gui-programming-the-clojure-way/">http://nathanwilliams.github.io/2013/05/15/seesaw-gui-programming-the-clojure-way/</a></h3>
<div class="outline-text-3" id="text-58-1">

</div>

</div>

<div id="outline-container-58-2" class="outline-3">
<h3 id="sec-58-2">clojure IDE <a href="http://nightcode.info/">http://nightcode.info/</a></h3>
<div class="outline-text-3" id="text-58-2">

</div>
</div>

</div>

<div id="outline-container-59" class="outline-2">
<h2 id="sec-59">cljs</h2>
<div class="outline-text-2" id="text-59">


</div>

<div id="outline-container-59-1" class="outline-3">
<h3 id="sec-59-1"><a href="http://www.panoramap.org">http://www.panoramap.org</a> web-app with Leaflet  <a href="https://github.com/bzg/wlmmap">https://github.com/bzg/wlmmap</a></h3>
<div class="outline-text-3" id="text-59-1">

</div>

</div>
