toread.org
** CljsFiddle http://cljsfiddle.net/fiddle/swannodette.test-logic code http://github.com/jonase/cljsfiddle
** Purnam - AngularJs Language Extensions for Clojurescript Inspired by lispyscript, coffescript and clang https://github.com/zcaudate/purnam
** cljs templating http://blog.getprismatic.com/blog/2013/1/14/bringing-functional-to-the-frontend-clojure-clojurescript-for-the-web https://github.com/Prismatic/dommy
** cljs properties access http://dev.clojure.org/display/design/Unified+ClojureScript+and+Clojure+field+access+syntax
good (.-MAX_NUMBER js/Math) and (.ceil js/Math 3.14)
not clojure compatible js/Math.MAX_NUMBER and (js/Math.ceil 3.14)
** testing in cljs https://groups.google.com/forum/?fromgroups=#!topic/clojurescript/a2WcxJvp8Qo
 https://github.com/prismatic/cljs-test https://github.com/cemerick/yonder
** clojurescript internal http://www.infoq.com/presentations/ClojureScript-Optimizations
** FRP http://tailrecursion.com/blog/2013/02/15/introducing-javelin-an-frp-library-for-clojurescript/
https://github.com/alandipert/enduro-todo
** https://github.com/cemerick/clojurescript.test
* parser
** Grammar explained with regular expressions http://nikic.github.io/2012/06/15/The-true-power-of-regular-expressions.html
** Instaparse: Parsing With Clojure Is the New Black http://walkwithoutrhythm.net/blog/2013/05/16/instaparse-parsing-with-clojure-is-the-new-black/
** incremental vector (instaparser) https://groups.google.com/group/clojure/browse_frm/thread/a43a6be002be83d
** clj instaparser https://github.com/Engelberg/instaparse https://groups.google.com/forum/?fromgroups=#!topic/clojure/9U-0ZIWpMSg
** a Groovy-like syntax atop Clojure pasing done with kern https://github.com/gavingroovygrover/grojure
https://groups.google.com/forum/?fromgroups=#!topic/clojure/-kEXiuDRejE
** PEG in JS http://pegjs.majda.cz/online
** kern tuto https://github.com/blancas/morph/wiki/Writing-a-Simple-Parser
** simple markdown parser http://deltadiaz.blogspot.ch/2012/04/parsing-with-haskell.html
** Functional parsing library from chapter 8 of Programming in Haskell http://www.cs.nott.ac.uk/~gmh/Parsing.lhs
** parser combinator  https://github.com/blancas/kern/wiki https://github.com/youngnh/parsatron https://groups.google.com/forum/?fromgroups=#!topic/clojure/hgMcvG8kWS4
** parsley http://walkwithoutrhythm.net/blog/2012/12/29/parsing-is-fun-again/
** lexer https://github.com/xsc/lexington
** parser in smalltalk http://scg.unibe.ch/research/helvetia/petitparser

** parser in cofescript https://github.com/JonAbrams/tomljs SQL parser https://gist.github.com/grncdr/5039898
* IDE
** Cursive is the Clojure IDE that understands your code http://cursiveclojure.com/
** clojure IDE https://github.com/arthuredelstein/clooj
** clojure debugging with ritz http://ianeslick.com/2013/05/17/clojure-debugging-13-emacs-nrepl-and-ritz/
** emacs
*** How to learn Emacs keyboard shortcuts http://sachachua.com/blog/2013/09/how-to-learn-emacs-keyboard-shortcuts-a-visual-tutorial-for-newbies/
*** Learn #Emacs Lisp in 15 minutes http://bzg.fr/learn-emacs-lisp-in-15-minutes.html
*** emacs wiki http://www.emacswiki.org/emacs/InteractiveSpell
*** emacs find java source http://blog.jayfields.com/2013/04/emacs-lisp-find-java-sources.html?spref=tw
*** emacs live tuto http://paradigmx.net/blog/2013/04/01/clojure-toolchain-reloaded/
*** emacs org-mode and clojure http://kimavcrp.blogspot.ch/2012/05/literate-programming-in-clojure-table.html
*** mastering emacs http://www.masteringemacs.org/
** vim
*** Vim is your new IDE @vrde http://tmp.devcharm.com/pages/vim-is-your-new-ide
*** vim 7 best habits  http://www.moolenaar.net/habits.html
*** dispatch vim http://thechangelog.com/introducing-dispatch-vim-the-asynchronous-build-and-test-dispatcher/
*** vim repl debug mode https://github.com/dgrnbrg/vim-redl
