toread.html

<div id="outline-container-59-2" class="outline-3">
<h3 id="sec-59-2">CljsFiddle <a href="http://cljsfiddle.net/fiddle/swannodette.test-logic">http://cljsfiddle.net/fiddle/swannodette.test-logic</a> code <a href="http://github.com/jonase/cljsfiddle">http://github.com/jonase/cljsfiddle</a></h3>
<div class="outline-text-3" id="text-59-2">

</div>

</div>

<div id="outline-container-59-3" class="outline-3">
<h3 id="sec-59-3">Purnam - AngularJs Language Extensions for Clojurescript Inspired by lispyscript, coffescript and clang <a href="https://github.com/zcaudate/purnam">https://github.com/zcaudate/purnam</a></h3>
<div class="outline-text-3" id="text-59-3">

</div>

</div>

<div id="outline-container-59-4" class="outline-3">
<h3 id="sec-59-4">cljs templating <a href="http://blog.getprismatic.com/blog/2013/1/14/bringing-functional-to-the-frontend-clojure-clojurescript-for-the-web">http://blog.getprismatic.com/blog/2013/1/14/bringing-functional-to-the-frontend-clojure-clojurescript-for-the-web</a> <a href="https://github.com/Prismatic/dommy">https://github.com/Prismatic/dommy</a></h3>
<div class="outline-text-3" id="text-59-4">

</div>

</div>

<div id="outline-container-59-5" class="outline-3">
<h3 id="sec-59-5">cljs properties access <a href="http://dev.clojure.org/display/design/Unified+ClojureScript+and+Clojure+field+access+syntax">http://dev.clojure.org/display/design/Unified+ClojureScript+and+Clojure+field+access+syntax</a></h3>
<div class="outline-text-3" id="text-59-5">

<p>good (.-MAX<sub>NUMBER</sub> js/Math) and (.ceil js/Math 3.14)
not clojure compatible js/Math.MAX<sub>NUMBER</sub> and (js/Math.ceil 3.14)
</p></div>

</div>

<div id="outline-container-59-6" class="outline-3">
<h3 id="sec-59-6">testing in cljs <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojurescript/a2WcxJvp8Qo">https://groups.google.com/forum/?fromgroups=#!topic/clojurescript/a2WcxJvp8Qo</a></h3>
<div class="outline-text-3" id="text-59-6">

<p> <a href="https://github.com/prismatic/cljs-test">https://github.com/prismatic/cljs-test</a> <a href="https://github.com/cemerick/yonder">https://github.com/cemerick/yonder</a>
</p></div>

</div>

<div id="outline-container-59-7" class="outline-3">
<h3 id="sec-59-7">clojurescript internal <a href="http://www.infoq.com/presentations/ClojureScript-Optimizations">http://www.infoq.com/presentations/ClojureScript-Optimizations</a></h3>
<div class="outline-text-3" id="text-59-7">

</div>

</div>

<div id="outline-container-59-8" class="outline-3">
<h3 id="sec-59-8">FRP <a href="http://tailrecursion.com/blog/2013/02/15/introducing-javelin-an-frp-library-for-clojurescript/">http://tailrecursion.com/blog/2013/02/15/introducing-javelin-an-frp-library-for-clojurescript/</a></h3>
<div class="outline-text-3" id="text-59-8">

<p><a href="https://github.com/alandipert/enduro-todo">https://github.com/alandipert/enduro-todo</a>
</p></div>

</div>

<div id="outline-container-59-9" class="outline-3">
<h3 id="sec-59-9"><a href="https://github.com/cemerick/clojurescript.test">https://github.com/cemerick/clojurescript.test</a></h3>
<div class="outline-text-3" id="text-59-9">

</div>
</div>

</div>

<div id="outline-container-60" class="outline-2">
<h2 id="sec-60">parser</h2>
<div class="outline-text-2" id="text-60">


</div>

<div id="outline-container-60-1" class="outline-3">
<h3 id="sec-60-1">Grammar explained with regular expressions <a href="http://nikic.github.io/2012/06/15/The-true-power-of-regular-expressions.html">http://nikic.github.io/2012/06/15/The-true-power-of-regular-expressions.html</a></h3>
<div class="outline-text-3" id="text-60-1">

</div>

</div>

<div id="outline-container-60-2" class="outline-3">
<h3 id="sec-60-2">Instaparse: Parsing With Clojure Is the New Black <a href="http://walkwithoutrhythm.net/blog/2013/05/16/instaparse-parsing-with-clojure-is-the-new-black/">http://walkwithoutrhythm.net/blog/2013/05/16/instaparse-parsing-with-clojure-is-the-new-black/</a></h3>
<div class="outline-text-3" id="text-60-2">

</div>

</div>

<div id="outline-container-60-3" class="outline-3">
<h3 id="sec-60-3">incremental vector (instaparser) <a href="https://groups.google.com/group/clojure/browse_frm/thread/a43a6be002be83d">https://groups.google.com/group/clojure/browse_frm/thread/a43a6be002be83d</a></h3>
<div class="outline-text-3" id="text-60-3">

</div>

</div>

<div id="outline-container-60-4" class="outline-3">
<h3 id="sec-60-4">clj instaparser <a href="https://github.com/Engelberg/instaparse">https://github.com/Engelberg/instaparse</a> <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/9U-0ZIWpMSg">https://groups.google.com/forum/?fromgroups=#!topic/clojure/9U-0ZIWpMSg</a></h3>
<div class="outline-text-3" id="text-60-4">

</div>

</div>

<div id="outline-container-60-5" class="outline-3">
<h3 id="sec-60-5">a Groovy-like syntax atop Clojure pasing done with kern <a href="https://github.com/gavingroovygrover/grojure">https://github.com/gavingroovygrover/grojure</a></h3>
<div class="outline-text-3" id="text-60-5">

<p><a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/-kEXiuDRejE">https://groups.google.com/forum/?fromgroups=#!topic/clojure/-kEXiuDRejE</a>
</p></div>

</div>

<div id="outline-container-60-6" class="outline-3">
<h3 id="sec-60-6">PEG in JS <a href="http://pegjs.majda.cz/online">http://pegjs.majda.cz/online</a></h3>
<div class="outline-text-3" id="text-60-6">

</div>

</div>

<div id="outline-container-60-7" class="outline-3">
<h3 id="sec-60-7">kern tuto <a href="https://github.com/blancas/morph/wiki/Writing-a-Simple-Parser">https://github.com/blancas/morph/wiki/Writing-a-Simple-Parser</a></h3>
<div class="outline-text-3" id="text-60-7">

</div>

</div>

<div id="outline-container-60-8" class="outline-3">
<h3 id="sec-60-8">simple markdown parser <a href="http://deltadiaz.blogspot.ch/2012/04/parsing-with-haskell.html">http://deltadiaz.blogspot.ch/2012/04/parsing-with-haskell.html</a></h3>
<div class="outline-text-3" id="text-60-8">

</div>

</div>

<div id="outline-container-60-9" class="outline-3">
<h3 id="sec-60-9">Functional parsing library from chapter 8 of Programming in Haskell <a href="http://www.cs.nott.ac.uk/~gmh/Parsing.lhs">http://www.cs.nott.ac.uk/~gmh/Parsing.lhs</a></h3>
<div class="outline-text-3" id="text-60-9">

</div>

</div>

<div id="outline-container-60-10" class="outline-3">
<h3 id="sec-60-10">parser combinator  <a href="https://github.com/blancas/kern/wiki">https://github.com/blancas/kern/wiki</a> <a href="https://github.com/youngnh/parsatron">https://github.com/youngnh/parsatron</a> <a href="https://groups.google.com/forum/?fromgroups=#!topic/clojure/hgMcvG8kWS4">https://groups.google.com/forum/?fromgroups=#!topic/clojure/hgMcvG8kWS4</a></h3>
<div class="outline-text-3" id="text-60-10">

</div>

</div>

<div id="outline-container-60-11" class="outline-3">
<h3 id="sec-60-11">parsley <a href="http://walkwithoutrhythm.net/blog/2012/12/29/parsing-is-fun-again/">http://walkwithoutrhythm.net/blog/2012/12/29/parsing-is-fun-again/</a></h3>
<div class="outline-text-3" id="text-60-11">

</div>

</div>

<div id="outline-container-60-12" class="outline-3">
<h3 id="sec-60-12">lexer <a href="https://github.com/xsc/lexington">https://github.com/xsc/lexington</a></h3>
<div class="outline-text-3" id="text-60-12">

</div>

</div>

<div id="outline-container-60-13" class="outline-3">
<h3 id="sec-60-13">parser in smalltalk <a href="http://scg.unibe.ch/research/helvetia/petitparser">http://scg.unibe.ch/research/helvetia/petitparser</a></h3>
<div class="outline-text-3" id="text-60-13">


</div>

</div>

<div id="outline-container-60-14" class="outline-3">
<h3 id="sec-60-14">parser in cofescript <a href="https://github.com/JonAbrams/tomljs">https://github.com/JonAbrams/tomljs</a> SQL parser <a href="https://gist.github.com/grncdr/5039898">https://gist.github.com/grncdr/5039898</a></h3>
<div class="outline-text-3" id="text-60-14">

</div>
</div>

</div>

<div id="outline-container-61" class="outline-2">
<h2 id="sec-61">IDE</h2>
<div class="outline-text-2" id="text-61">


</div>

<div id="outline-container-61-1" class="outline-3">
<h3 id="sec-61-1">clojure IDE <a href="https://github.com/arthuredelstein/clooj">https://github.com/arthuredelstein/clooj</a></h3>
<div class="outline-text-3" id="text-61-1">

</div>

</div>

<div id="outline-container-61-2" class="outline-3">
<h3 id="sec-61-2">clojure debugging with ritz <a href="http://ianeslick.com/2013/05/17/clojure-debugging-13-emacs-nrepl-and-ritz/">http://ianeslick.com/2013/05/17/clojure-debugging-13-emacs-nrepl-and-ritz/</a></h3>
<div class="outline-text-3" id="text-61-2">

</div>

</div>

<div id="outline-container-61-3" class="outline-3">
<h3 id="sec-61-3">emacs</h3>
<div class="outline-text-3" id="text-61-3">


</div>

<div id="outline-container-61-3-1" class="outline-4">
<h4 id="sec-61-3-1">How to learn Emacs keyboard shortcuts <a href="http://sachachua.com/blog/2013/09/how-to-learn-emacs-keyboard-shortcuts-a-visual-tutorial-for-newbies/">http://sachachua.com/blog/2013/09/how-to-learn-emacs-keyboard-shortcuts-a-visual-tutorial-for-newbies/</a></h4>
<div class="outline-text-4" id="text-61-3-1">

</div>

</div>

<div id="outline-container-61-3-2" class="outline-4">
<h4 id="sec-61-3-2">Learn #Emacs Lisp in 15 minutes <a href="http://bzg.fr/learn-emacs-lisp-in-15-minutes.html">http://bzg.fr/learn-emacs-lisp-in-15-minutes.html</a></h4>
<div class="outline-text-4" id="text-61-3-2">

</div>

</div>

<div id="outline-container-61-3-3" class="outline-4">
<h4 id="sec-61-3-3">emacs wiki <a href="http://www.emacswiki.org/emacs/InteractiveSpell">http://www.emacswiki.org/emacs/InteractiveSpell</a></h4>
<div class="outline-text-4" id="text-61-3-3">

</div>

</div>

<div id="outline-container-61-3-4" class="outline-4">
<h4 id="sec-61-3-4">emacs find java source <a href="http://blog.jayfields.com/2013/04/emacs-lisp-find-java-sources.html?spref=tw">http://blog.jayfields.com/2013/04/emacs-lisp-find-java-sources.html?spref=tw</a></h4>
<div class="outline-text-4" id="text-61-3-4">

</div>

</div>

<div id="outline-container-61-3-5" class="outline-4">
<h4 id="sec-61-3-5">emacs live tuto <a href="http://paradigmx.net/blog/2013/04/01/clojure-toolchain-reloaded/">http://paradigmx.net/blog/2013/04/01/clojure-toolchain-reloaded/</a></h4>
<div class="outline-text-4" id="text-61-3-5">

</div>

</div>

<div id="outline-container-61-3-6" class="outline-4">
<h4 id="sec-61-3-6">emacs org-mode and clojure <a href="http://kimavcrp.blogspot.ch/2012/05/literate-programming-in-clojure-table.html">http://kimavcrp.blogspot.ch/2012/05/literate-programming-in-clojure-table.html</a></h4>
<div class="outline-text-4" id="text-61-3-6">

</div>

</div>

<div id="outline-container-61-3-7" class="outline-4">
<h4 id="sec-61-3-7">mastering emacs <a href="http://www.masteringemacs.org/">http://www.masteringemacs.org/</a></h4>
<div class="outline-text-4" id="text-61-3-7">

</div>
</div>

</div>

<div id="outline-container-61-4" class="outline-3">
<h3 id="sec-61-4">vim</h3>
<div class="outline-text-3" id="text-61-4">


</div>

<div id="outline-container-61-4-1" class="outline-4">
<h4 id="sec-61-4-1">vim 7 best habits  <a href="http://www.moolenaar.net/habits.html">http://www.moolenaar.net/habits.html</a></h4>
<div class="outline-text-4" id="text-61-4-1">

</div>

</div>

<div id="outline-container-61-4-2" class="outline-4">
<h4 id="sec-61-4-2">dispatch vim <a href="http://thechangelog.com/introducing-dispatch-vim-the-asynchronous-build-and-test-dispatcher/">http://thechangelog.com/introducing-dispatch-vim-the-asynchronous-build-and-test-dispatcher/</a></h4>
<div class="outline-text-4" id="text-61-4-2">

</div>

</div>

<div id="outline-container-61-4-3" class="outline-4">
<h4 id="sec-61-4-3">vim repl debug mode <a href="https://github.com/dgrnbrg/vim-redl">https://github.com/dgrnbrg/vim-redl</a></h4>
<div class="outline-text-4" id="text-61-4-3">

</div>

</div>
