toread.org
*** vim https://github.com/guns/vim-clojure-static vim plugins https://github.com/guns/screen https://bitbucket.org/kovisoft/paredit/overview
*** http://michaelalynmiller.com/blog/2013/02/27/vim-tmux-clojure/

** Structural editing http://alan.dipert.org/post/47461498337/structural-editing-apocrypha
** stoke strutured editing http://alan.dipert.org/post/47444634908/structural-editing-revisited
** vimscript book http://learnvimscriptthehardway.stevelosh.com/?published
** LightTable IDE http://www.chris-granger.com/2012/12/11/anatomy-of-a-knockout/ http://www.chris-granger.com/2013/01/24/the-ide-as-data/
** lein faster https://github.com/technomancy/leiningen/wiki/Faster
Fast JVM launching without the hassle of persistent JVMs. https://github.com/flatland/drip/
** lein startup https://groups.google.com/group/clojure/browse_thread/thread/7b96718933962f35
> I take this to mean that there's no widely accepted solution.

The widely-accepted solution is to leave a single process running. It
certainly has limitations, but it's the way most people deal with the
problem.
> Really, I just want `lein run` to be faster. Can someone explain where all
> this time is spent?

Basically it comes from having to load two JVMs, one for Leiningen
itself and one for the project. Leiningen itself is fairly optimized for
this (fully AOTed, bytecode verification is turned off, fancy warm-up
JIT techniques disabled) which is why it's possible to get `lein
version` to return in under a second in some cases. But there are
various compatibility issues that prevent us from being able to perform
the same optimizations on project JVMs. These are documented on the
"Faster" page of the Leiningen wiki, and you can do some testing to
determine whether or not they affect your project in particular; if not
then they should provide a good boost.
But nothing will ever come close to the speed of keeping the JVM
resident, which is why I'm working on `:eval-in :nrepl` and lein.el. For
people who don't use Emacs, Jark is the only tool I'm aware of that is
working towards this in a way that's decoupled from the editor. They
could probably use some help both testing and implementing it.
> I hear a lot of talk of compiling, but why would we re-compile things where
> none of the dependencies have changed?

Performing a full AOT of all your dependencies will help if you have a
large project with lots of dependencies that get loaded at application
boot. But that effect would be something along the lines of bringing
boot down from 20s to 12s rather than bringing it from 5s to <1s.
** org-mode tips
#+begin_src clojure :exports both
    (with-out-str (print-table [{:a 1 :b 2 :c 3} {:b 5 :a 7 :c "dog"}]))
#+end_src

(Using with-out-str is needed because print-table of course returns nil)

But what I get when generating HTML (via "C-c C-e b") is not a table, but the literal text of the table markup. I.e. compiling the above source block yeilds:

#+RESULTS: clojure-org-table

** light table http://www.chris-granger.com/2013/02/27/light-table-030-experience/
* Tech stuff
**  http://petapixel.com/2013/09/29/newly-developed-software-helps-get-high-quality-photos-crappy-lenses/
**  http://pitchmarathon.co/prizes/
** Creating network and connecting from anywhere where people are interested. http://guifi.net/en/node/38392
** Prism All your data, in one place http://prism.andrevv.com/
** Artisan electronic device http://www.creativereview.co.uk/cr-blog/2013/may/yves-saint-laurent-meets-nasa
** Tetris for ever http://tetrisconcept.net/wiki/Playing_forever
** A [work-in-progress] self-hosted, anti-social RSS reader https://github.com/swanson/stringer
** Best Content Discovery Application ?
  Flipboard
 Instapaper
 Pinterest
 Prismatic
 Tumblr

** openstack  http://techup.ch/925/2nd-swiss-openstack-ug-meeting
** privacy and data http://gigaom.com/2013/02/06/think-europeans-are-more-into-data-privacy-than-americans-think-again/
** opensource dropbox : owncloud5 seafile
http://linuxaria.com/article/installation-of-seafile-open-source-dropbox-alternative-for-teams?lang=en
http://techcrunch.com/2013/02/24/meet-owncloud-5-the-open-source-dropbox/
* Fablab
* Education
** MOOC list http://www.mooc-list.com/categories/computer-science-artificial-intelligence-robotics-vision
** Wonder How-To : math craft , origami, ... http://mathcraft.wonderhowto.com/how-to/make-hyperbolic-paraboloid-using-skewers-0131751/
** programming school http://codeclub.org.uk/ 
** puzzle game http://worrydream.com/AlligatorEggs/
** experiments howto teachkids to programs scratch http://snapcircuits.net/  http://technomancy.us/167
** speciatin vs. specialisation http://www.openculture.com/2013/05/ken_robinson_explains_how_to_escape_the_death_valley_of_american_education.html
