toread.html

<div id="outline-container-61-4-4" class="outline-4">
<h4 id="sec-61-4-4">vim <a href="https://github.com/guns/vim-clojure-static">https://github.com/guns/vim-clojure-static</a> vim plugins <a href="https://github.com/guns/screen">https://github.com/guns/screen</a> <a href="https://bitbucket.org/kovisoft/paredit/overview">https://bitbucket.org/kovisoft/paredit/overview</a></h4>
<div class="outline-text-4" id="text-61-4-4">

</div>

</div>

<div id="outline-container-61-4-5" class="outline-4">
<h4 id="sec-61-4-5"><a href="http://michaelalynmiller.com/blog/2013/02/27/vim-tmux-clojure/">http://michaelalynmiller.com/blog/2013/02/27/vim-tmux-clojure/</a></h4>
<div class="outline-text-4" id="text-61-4-5">


</div>
</div>

</div>

<div id="outline-container-61-5" class="outline-3">
<h3 id="sec-61-5">Structural editing <a href="http://alan.dipert.org/post/47461498337/structural-editing-apocrypha">http://alan.dipert.org/post/47461498337/structural-editing-apocrypha</a></h3>
<div class="outline-text-3" id="text-61-5">

</div>

</div>

<div id="outline-container-61-6" class="outline-3">
<h3 id="sec-61-6">stoke strutured editing <a href="http://alan.dipert.org/post/47444634908/structural-editing-revisited">http://alan.dipert.org/post/47444634908/structural-editing-revisited</a></h3>
<div class="outline-text-3" id="text-61-6">

</div>

</div>

<div id="outline-container-61-7" class="outline-3">
<h3 id="sec-61-7">vimscript book <a href="http://learnvimscriptthehardway.stevelosh.com/?published">http://learnvimscriptthehardway.stevelosh.com/?published</a></h3>
<div class="outline-text-3" id="text-61-7">

</div>

</div>

<div id="outline-container-61-8" class="outline-3">
<h3 id="sec-61-8">LightTable IDE <a href="http://www.chris-granger.com/2012/12/11/anatomy-of-a-knockout/">http://www.chris-granger.com/2012/12/11/anatomy-of-a-knockout/</a> <a href="http://www.chris-granger.com/2013/01/24/the-ide-as-data/">http://www.chris-granger.com/2013/01/24/the-ide-as-data/</a></h3>
<div class="outline-text-3" id="text-61-8">

</div>

</div>

<div id="outline-container-61-9" class="outline-3">
<h3 id="sec-61-9">lein faster <a href="https://github.com/technomancy/leiningen/wiki/Faster">https://github.com/technomancy/leiningen/wiki/Faster</a></h3>
<div class="outline-text-3" id="text-61-9">

<p>Fast JVM launching without the hassle of persistent JVMs. <a href="https://github.com/flatland/drip/">https://github.com/flatland/drip/</a>
</p></div>

</div>

<div id="outline-container-61-10" class="outline-3">
<h3 id="sec-61-10">lein startup <a href="https://groups.google.com/group/clojure/browse_thread/thread/7b96718933962f35">https://groups.google.com/group/clojure/browse_thread/thread/7b96718933962f35</a></h3>
<div class="outline-text-3" id="text-61-10">

<p>&gt; I take this to mean that there's no widely accepted solution.
</p>
<p>
The widely-accepted solution is to leave a single process running. It
certainly has limitations, but it's the way most people deal with the
problem.
&gt; Really, I just want `lein run` to be faster. Can someone explain where all
&gt; this time is spent?
</p>
<p>
Basically it comes from having to load two JVMs, one for Leiningen
itself and one for the project. Leiningen itself is fairly optimized for
this (fully AOTed, bytecode verification is turned off, fancy warm-up
JIT techniques disabled) which is why it's possible to get `lein
version` to return in under a second in some cases. But there are
various compatibility issues that prevent us from being able to perform
the same optimizations on project JVMs. These are documented on the
"Faster" page of the Leiningen wiki, and you can do some testing to
determine whether or not they affect your project in particular; if not
then they should provide a good boost.
But nothing will ever come close to the speed of keeping the JVM
resident, which is why I'm working on `:eval-in :nrepl` and lein.el. For
people who don't use Emacs, Jark is the only tool I'm aware of that is
working towards this in a way that's decoupled from the editor. They
could probably use some help both testing and implementing it.
&gt; I hear a lot of talk of compiling, but why would we re-compile things where
&gt; none of the dependencies have changed?
</p>
<p>
Performing a full AOT of all your dependencies will help if you have a
large project with lots of dependencies that get loaded at application
boot. But that effect would be something along the lines of bringing
boot down from 20s to 12s rather than bringing it from 5s to &lt;1s.
</p></div>

</div>

<div id="outline-container-61-11" class="outline-3">
<h3 id="sec-61-11">org-mode tips</h3>
<div class="outline-text-3" id="text-61-11">




<pre class="example">(with-out-str (print-table [{:a 1 :b 2 :c 3} {:b 5 :a 7 :c "dog"}]))
</pre>


<p>
(Using with-out-str is needed because print-table of course returns nil)
</p>
<p>
But what I get when generating HTML (via "C-c C-e b") is not a table, but the literal text of the table markup. I.e. compiling the above source block yeilds:
</p>

</div>

</div>

<div id="outline-container-61-12" class="outline-3">
<h3 id="sec-61-12">light table <a href="http://www.chris-granger.com/2013/02/27/light-table-030-experience/">http://www.chris-granger.com/2013/02/27/light-table-030-experience/</a></h3>
<div class="outline-text-3" id="text-61-12">

</div>
</div>

</div>

<div id="outline-container-62" class="outline-2">
<h2 id="sec-62">Tech stuff</h2>
<div class="outline-text-2" id="text-62">


</div>

<div id="outline-container-62-1" class="outline-3">
<h3 id="sec-62-1"><a href="http://petapixel.com/2013/09/29/newly-developed-software-helps-get-high-quality-photos-crappy-lenses/">http://petapixel.com/2013/09/29/newly-developed-software-helps-get-high-quality-photos-crappy-lenses/</a></h3>
<div class="outline-text-3" id="text-62-1">

</div>

</div>

<div id="outline-container-62-2" class="outline-3">
<h3 id="sec-62-2"><a href="http://pitchmarathon.co/prizes/">http://pitchmarathon.co/prizes/</a></h3>
<div class="outline-text-3" id="text-62-2">

</div>

</div>

<div id="outline-container-62-3" class="outline-3">
<h3 id="sec-62-3">Creating network and connecting from anywhere where people are interested. <a href="http://guifi.net/en/node/38392">http://guifi.net/en/node/38392</a></h3>
<div class="outline-text-3" id="text-62-3">

</div>

</div>

<div id="outline-container-62-4" class="outline-3">
<h3 id="sec-62-4">Prism All your data, in one place <a href="http://prism.andrevv.com/">http://prism.andrevv.com/</a></h3>
<div class="outline-text-3" id="text-62-4">

</div>

</div>

<div id="outline-container-62-5" class="outline-3">
<h3 id="sec-62-5">Artisan electronic device <a href="http://www.creativereview.co.uk/cr-blog/2013/may/yves-saint-laurent-meets-nasa">http://www.creativereview.co.uk/cr-blog/2013/may/yves-saint-laurent-meets-nasa</a></h3>
<div class="outline-text-3" id="text-62-5">

</div>

</div>

<div id="outline-container-62-6" class="outline-3">
<h3 id="sec-62-6">Tetris for ever <a href="http://tetrisconcept.net/wiki/Playing_forever">http://tetrisconcept.net/wiki/Playing_forever</a></h3>
<div class="outline-text-3" id="text-62-6">

</div>

</div>

<div id="outline-container-62-7" class="outline-3">
<h3 id="sec-62-7">A [work-in-progress] self-hosted, anti-social RSS reader <a href="https://github.com/swanson/stringer">https://github.com/swanson/stringer</a></h3>
<div class="outline-text-3" id="text-62-7">

</div>

</div>

<div id="outline-container-62-8" class="outline-3">
<h3 id="sec-62-8">Best Content Discovery Application ?</h3>
<div class="outline-text-3" id="text-62-8">

<p>  Flipboard
 Instapaper
 Pinterest
 Prismatic
 Tumblr
</p>
</div>

</div>

<div id="outline-container-62-9" class="outline-3">
<h3 id="sec-62-9">openstack  <a href="http://techup.ch/925/2nd-swiss-openstack-ug-meeting">http://techup.ch/925/2nd-swiss-openstack-ug-meeting</a></h3>
<div class="outline-text-3" id="text-62-9">

</div>

</div>

<div id="outline-container-62-10" class="outline-3">
<h3 id="sec-62-10">privacy and data <a href="http://gigaom.com/2013/02/06/think-europeans-are-more-into-data-privacy-than-americans-think-again/">http://gigaom.com/2013/02/06/think-europeans-are-more-into-data-privacy-than-americans-think-again/</a></h3>
<div class="outline-text-3" id="text-62-10">

</div>

</div>

<div id="outline-container-62-11" class="outline-3">
<h3 id="sec-62-11">opensource dropbox : owncloud5 seafile</h3>
<div class="outline-text-3" id="text-62-11">

<p><a href="http://linuxaria.com/article/installation-of-seafile-open-source-dropbox-alternative-for-teams?lang=en">http://linuxaria.com/article/installation-of-seafile-open-source-dropbox-alternative-for-teams?lang=en</a>
<a href="http://techcrunch.com/2013/02/24/meet-owncloud-5-the-open-source-dropbox/">http://techcrunch.com/2013/02/24/meet-owncloud-5-the-open-source-dropbox/</a>
</p></div>
</div>

</div>

<div id="outline-container-63" class="outline-2">
<h2 id="sec-63">Fablab</h2>
<div class="outline-text-2" id="text-63">

</div>

</div>

<div id="outline-container-64" class="outline-2">
<h2 id="sec-64">Education</h2>
<div class="outline-text-2" id="text-64">


</div>

<div id="outline-container-64-1" class="outline-3">
<h3 id="sec-64-1">MOOC list <a href="http://www.mooc-list.com/categories/computer-science-artificial-intelligence-robotics-vision">http://www.mooc-list.com/categories/computer-science-artificial-intelligence-robotics-vision</a></h3>
<div class="outline-text-3" id="text-64-1">

</div>

</div>

<div id="outline-container-64-2" class="outline-3">
<h3 id="sec-64-2">Wonder How-To : math craft , origami, &hellip; <a href="http://mathcraft.wonderhowto.com/how-to/make-hyperbolic-paraboloid-using-skewers-0131751/">http://mathcraft.wonderhowto.com/how-to/make-hyperbolic-paraboloid-using-skewers-0131751/</a></h3>
<div class="outline-text-3" id="text-64-2">

</div>

</div>

<div id="outline-container-64-3" class="outline-3">
<h3 id="sec-64-3">programming school <a href="http://codeclub.org.uk/">http://codeclub.org.uk/</a></h3>
<div class="outline-text-3" id="text-64-3">

</div>

</div>

<div id="outline-container-64-4" class="outline-3">
<h3 id="sec-64-4">puzzle game <a href="http://worrydream.com/AlligatorEggs/">http://worrydream.com/AlligatorEggs/</a></h3>
<div class="outline-text-3" id="text-64-4">

</div>

</div>

<div id="outline-container-64-5" class="outline-3">
<h3 id="sec-64-5">experiments howto teachkids to programs scratch <a href="http://snapcircuits.net/">http://snapcircuits.net/</a>  <a href="http://technomancy.us/167">http://technomancy.us/167</a></h3>
<div class="outline-text-3" id="text-64-5">

</div>

</div>

<div id="outline-container-64-6" class="outline-3">
<h3 id="sec-64-6">speciatin vs. specialisation <a href="http://www.openculture.com/2013/05/ken_robinson_explains_how_to_escape_the_death_valley_of_american_education.html">http://www.openculture.com/2013/05/ken_robinson_explains_how_to_escape_the_death_valley_of_american_education.html</a></h3>
<div class="outline-text-3" id="text-64-6">

</div>

</div>
