toread.org
** mooc pedagogy http://edtechfrontier.com/2013/05/11/the-pedagogy-of-moocs/
**  Data Science Apprenticeship http://www.datasciencecentral.com/profiles/blogs/the-face-of-the-new-university
** Potential projects to be completed:  http://www.datasciencecentral.com/profiles/blogs/proposal-for-an-apprenticeship-in-data-science
   - hacking and reverse-engineering projects (TBD)
   - web crawling projects: how many Facebook accounts are duplicate or dead? Or categorize Tweets
   - taxonomy creation or improving an existing taxonomy
   - optimal pricing for bid keywords on Google
   - create a web app that provide (in real time) better-than-average trading signals
   - find low-frequency and Botnet fraud cases in a sea of data
   - internship in computational marketing with a data science start-up
   - automated plagiarism detection
   - use web crawlers, assess whether Google Search favors
      - (1) its products over competitors [is this an unfair business practice?],
      - (2) local over non-local results and
      - (3) returns different results to web robots and humans. Identify other bias and patterns in Google search results.
** http://www.slate.com/articles/technology/top_right/2011/08/flipping_the_classroom.html
Classroom flipping means assigning lectures as homework, leaving actual classroom time for hands-on instruction and group work.
Ng told me his class at Stanford is already doing this, and he’s encouraging other professors to adopt the approach for their Coursera classes as well.
** massive open online course MOOC
*** http://www.slate.com/blogs/future_tense/2013/02/05/mooc_meltdown_coursera_course_on_fundamentals_of_online_education_ends_in.html
*** http://www.slate.com/articles/technology/future_tense/2012/07/coursera_udacity_edx_will_free_online_ivy_league_courses_end_the_era_of_expensive_higher_ed_.html
** http://codeacademy.com
** http://www.code.org/learn/scratch
* Research
**  Douglas C. Engelbart A research for augmenting human Intellect http://sloan.stanford.edu/mousesite/1968Demo.html
** http://en.wikipedia.org/wiki/J._C._R._Licklider
* Jobs
** Data Viz jobs mailing list https://groups.google.com/forum/?fromgroups#!forum/data-vis-jobs
