toread.html

<div id="outline-container-64-7" class="outline-3">
<h3 id="sec-64-7">mooc pedagogy <a href="http://edtechfrontier.com/2013/05/11/the-pedagogy-of-moocs/">http://edtechfrontier.com/2013/05/11/the-pedagogy-of-moocs/</a></h3>
<div class="outline-text-3" id="text-64-7">

</div>

</div>

<div id="outline-container-64-8" class="outline-3">
<h3 id="sec-64-8">Data Science Apprenticeship <a href="http://www.datasciencecentral.com/profiles/blogs/the-face-of-the-new-university">http://www.datasciencecentral.com/profiles/blogs/the-face-of-the-new-university</a></h3>
<div class="outline-text-3" id="text-64-8">

</div>

</div>

<div id="outline-container-64-9" class="outline-3">
<h3 id="sec-64-9">Potential projects to be completed:  <a href="http://www.datasciencecentral.com/profiles/blogs/proposal-for-an-apprenticeship-in-data-science">http://www.datasciencecentral.com/profiles/blogs/proposal-for-an-apprenticeship-in-data-science</a></h3>
<div class="outline-text-3" id="text-64-9">

<ul>
<li>hacking and reverse-engineering projects (TBD)
</li>
<li>web crawling projects: how many Facebook accounts are duplicate or dead? Or categorize Tweets
</li>
<li>taxonomy creation or improving an existing taxonomy
</li>
<li>optimal pricing for bid keywords on Google
</li>
<li>create a web app that provide (in real time) better-than-average trading signals
</li>
<li>find low-frequency and Botnet fraud cases in a sea of data
</li>
<li>internship in computational marketing with a data science start-up
</li>
<li>automated plagiarism detection
</li>
<li>use web crawlers, assess whether Google Search favors
<ul>
<li>(1) its products over competitors [is this an unfair business practice?],
</li>
<li>(2) local over non-local results and
</li>
<li>(3) returns different results to web robots and humans. Identify other bias and patterns in Google search results.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-64-10" class="outline-3">
<h3 id="sec-64-10"><a href="http://www.slate.com/articles/technology/top_right/2011/08/flipping_the_classroom.html">http://www.slate.com/articles/technology/top_right/2011/08/flipping_the_classroom.html</a></h3>
<div class="outline-text-3" id="text-64-10">

<p>Classroom flipping means assigning lectures as homework, leaving actual classroom time for hands-on instruction and group work.
Ng told me his class at Stanford is already doing this, and he’s encouraging other professors to adopt the approach for their Coursera classes as well.
</p></div>

</div>

<div id="outline-container-64-11" class="outline-3">
<h3 id="sec-64-11">massive open online course MOOC</h3>
<div class="outline-text-3" id="text-64-11">


</div>

<div id="outline-container-64-11-1" class="outline-4">
<h4 id="sec-64-11-1"><a href="http://www.slate.com/blogs/future_tense/2013/02/05/mooc_meltdown_coursera_course_on_fundamentals_of_online_education_ends_in.html">http://www.slate.com/blogs/future_tense/2013/02/05/mooc_meltdown_coursera_course_on_fundamentals_of_online_education_ends_in.html</a></h4>
<div class="outline-text-4" id="text-64-11-1">

</div>

</div>

<div id="outline-container-64-11-2" class="outline-4">
<h4 id="sec-64-11-2"><a href="http://www.slate.com/articles/technology/future_tense/2012/07/coursera_udacity_edx_will_free_online_ivy_league_courses_end_the_era_of_expensive_higher_ed_.html">http://www.slate.com/articles/technology/future_tense/2012/07/coursera_udacity_edx_will_free_online_ivy_league_courses_end_the_era_of_expensive_higher_ed_.html</a></h4>
<div class="outline-text-4" id="text-64-11-2">

</div>
</div>

</div>

<div id="outline-container-64-12" class="outline-3">
<h3 id="sec-64-12">codeacademy.com</h3>
<div class="outline-text-3" id="text-64-12">

</div>

</div>

<div id="outline-container-64-13" class="outline-3">
<h3 id="sec-64-13"><a href="http://www.code.org/learn/scratch">http://www.code.org/learn/scratch</a></h3>
<div class="outline-text-3" id="text-64-13">

</div>
</div>

</div>

<div id="outline-container-65" class="outline-2">
<h2 id="sec-65">Research</h2>
<div class="outline-text-2" id="text-65">


</div>

<div id="outline-container-65-1" class="outline-3">
<h3 id="sec-65-1">Douglas C. Engelbart A research for augmenting human Intellect <a href="http://sloan.stanford.edu/mousesite/1968Demo.html">http://sloan.stanford.edu/mousesite/1968Demo.html</a></h3>
<div class="outline-text-3" id="text-65-1">

</div>

</div>

<div id="outline-container-65-2" class="outline-3">
<h3 id="sec-65-2"><a href="http://en.wikipedia.org/wiki/J._C._R._Licklider">http://en.wikipedia.org/wiki/J._C._R._Licklider</a></h3>
<div class="outline-text-3" id="text-65-2">

</div>
</div>

</div>

<div id="outline-container-66" class="outline-2">
<h2 id="sec-66">Jobs</h2>
<div class="outline-text-2" id="text-66">


</div>

<div id="outline-container-66-1" class="outline-3">
<h3 id="sec-66-1">Data Viz jobs mailing list <a href="https://groups.google.com/forum/?fromgroups#!forum/data-vis-jobs">https://groups.google.com/forum/?fromgroups#!forum/data-vis-jobs</a></h3>
<div class="outline-text-3" id="text-66-1">

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: Maximilien</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
